      *################################################################*00010000
      *                                                                 00020000
      * FD Trade Finance                                                00030000
      *                                                                 00040000
      * Copy-area R115ITP0.                                             00050002
      *                                                                 00060000
      * Interface for all database access on table TF_Tast_Part.        00070002
      *                                                                 00080000
      * The interface kan read one spesific occurence,                  00090000
      * or several occurences, fully or partly qualified with           00100000
      * from- and to- values.                                           00110000
      *                                                                 00120000
      * When reading several occurences, one must always start with     00130000
      * -In-Get-1st, and continue with -In-Get-Next.                    00140000
      *                                                                 00150000
      * NB!  There are several key-fields, which may be used            00160000
      *      differently depending on the need.                         00170000
      *      See seperate description below.                            00180000
      *                                                                 00190000
      *                                                                 00200000
      * An ordinary Select call may look like this:                     00210000
      *                                                                 00220000
      *    Initialize                          R115ITP0-Tast-Part       00230002
      *    Set   R115ITP0-Version        To    True                     00240002
      *    Set   R115ITP0-In-Select      To    True                     00250002
      *                                                                 00260014
      * One of these:                                                   00270014
      * 1) Set   R115ITP0-In-Actual      To    True                     00280014
      * 2) Set   R115ITP0-In-Work        To    True                     00290014
      *                                                                 00300014
      *    Move  &fin-inst-id            To    R115ITP0-In-Fin-Inst-ID  00310002
      *    Move  &contract-type          To    R115ITP0-In-Contract-Type00320002
      *    Move  &contract-no            To    R115ITP0-In-Contract-No  00330002
      *    Move  &Role-Type              To    R115ITP0-In-Role-Type    00340010
      *                                                                 00350001
      * To specify relation to Main_Contract or Part_Amount:            00360001
      * One of these: (3rd only for cursors)                            00370001
      * 1) Set   R115ITP0-In-Rel-MC      To    True                     00380002
      * 2) Set   R115ITP0-In-Rel-PA      To    True                     00390002
      * 3) Set   R115ITP0-In-Rel-All     To    True                     00400002
      *                                                                 00410000
      * If you want Tast_Part for a Part_Amount, fill in these:         00420002
      *    Move  &currency (ISO 4217)    To    R115ITP0-In-CA-Currency  00430002
      *    Move  &part-amount seq.no     To    R115ITP0-In-PA-Seq-No    00440002
      *                                                                 00450000
      *    Call  'F115ITP0'              Using R115ITP0-Tast-Part       00460002
      *                                        R7919999-Error-Area      00470009
      *    End-Call                                                     00480000
      *                                                                 00490000
      *    Evaluate True                                                00500000
      *      When R7919999-Return-Abend                                 00510009
      *        Move  '&&&&'              To    R7919999-Paragraph       00520009
      *        Perform Z900-Abend                                       00530000
      *                                                                 00540000
      *      When R7919999-Return-Error                                 00550009
      *        ...not found...                                          00560000
      *                                                                 00570000
      *      When R7919999-Return-OK                                    00580009
      *        ...found...                                              00590000
      *                                                                 00600000
      *    End-Evaluate                                                 00610000
      *                                                                 00620000
      *################################################################*00630000
      * Date ! Si! Change description                            ! 3A ! 00640000
      *------+---+-----------------------------------------------+----+ 00650000
      *150200!NDL! New copy area                                 !LM04! 00680012
      *################################################################*00690000
      *                                                                 00700000
         03  R115ITP0-Tast-Part.                                        00710002
      *                                                                 00720000
           05  R115ITP0-Version-No              Pic  X(08).             00730002
             88  R115ITP0-Version                    Value '20000215'.  00740017
      *                                                                 00750000
      *----------------------------------------------------------------*00760000
      *                                                                 00770000
           05  R115ITP0-Qualification.                                  00780002
      *                                                                 00790000
             10  R115ITP0-In-Action             Pic  X(16).             00800002
               88  R115ITP0-In-Get-1st               Value 'GET-1ST'.   00810002
               88  R115ITP0-In-Get-Next              Value 'GET-NEXT'.  00820002
               88  R115ITP0-In-Select                Value 'SELECT'.    00830002
               88  R115ITP0-In-Insert                Value 'INSERT'.    00840002
               88  R115ITP0-In-Update                Value 'UPDATE'.    00850002
               88  R115ITP0-In-Delete                Value 'DELETE'.    00860002
      *                                                                 00870000
      * There are several key-fields, which may be used differently     00880000
      * depending on the need.                                          00890000
      *                                                                 00900000
      * In-Table must be set whatever the desired action is.            00910014
      *                                                                 00920014
      * For Insert, use the Data area for all fields.                   00930013
      *                                                                 00940013
      * For Select, Update and Delete, use:                             00950013
      *     - Fin-Inst-No or Fin-Inst-ID                                00960000
      *     - Contract-Type                                             00970000
      *     - Contract-No                                               00980000
      *     - Relation (Rel-MC or Rel-PA)                               00990001
      *     - If Rel-PA is specified:                                   01000001
      *       - Currency                                                01010000
      *       - Part Amount Sequence Number                             01020000
      *     - Role-Type                                                 01030010
      *                                                                 01040000
      * For cursor (Get-1st / Get-Next), use:                           01050000
      *     -         : Fin-Inst-No or Fin-Inst-ID                      01060000
      *     - optional: Contract-Type                                   01070000
      *             or: Contract-Type with mask (e.g. 'I* ')            01080000
      *     - Optional: From-Contr-No and To-Contr-No                   01090000
      *     - Optional: Relation                                        01100001
      *     - If Rel-PA is specified:                                   01110001
      *       - Optional: Currency and Part Amount Seq.no               01120004
      *     - Optional: Role-Type                                       01130010
      *             or: Role-Type with mask (e.g. 'I* ')                01140010
      *                                                                 01160000
             10  R115ITP0-In-Key.                                       01170002
      *                                                                 01180000
               15  R115ITP0-In-Table-Version    Pic  X(16).             01190016
                 88  R115ITP0-In-Actual              Value 'ACTUAL'.    01200014
                 88  R115ITP0-In-Work                Value 'WORK'.      01210014
      *                                                                 01220014
      *        It is optional wether you use Fin-Inst-No or Fin-Inst-ID.01230000
               15  R115ITP0-In-Fin-Inst.                                01240002
                 20  R115ITP0-In-Fin-Inst-No    Pic  X(18).             01250006
                 20  R115ITP0-In-Fin-Inst-ID    Pic S9(18)       Comp-3.01260002
      *                                                                 01270000
      *        Contract-Type and -No is mandatory for                   01280000
      *        Select/Update/Delete.                                    01290013
               15  R115ITP0-In-Contract.                                01300002
                 20  R115ITP0-In-Contract-Type  Pic  X(03).             01310002
                 20  R115ITP0-In-Contract-No    Pic S9(07)       Comp-3.01320002
      *                                                                 01330000
                 20  R115ITP0-In-From-Contr-No  Pic S9(07)       Comp-3.01340002
                 20  R115ITP0-In-To-Contr-No    Pic S9(07)       Comp-3.01350002
      *                                                                 01360000
               15  R115ITP0-In-Role-Type        Pic  X(10).             01370010
      *                                                                 01380010
      *        You need to specify wether you want Tast_Part            01390002
      *        related to Main_Contract, Part_Amount or any.            01400001
      *        Rel-MC or Rel-PA must be specified for                   01410001
      *        Select/Update/Delete.                                    01420013
               15  R115ITP0-In-Relation         Pic  X(02).             01430002
                 88  R115ITP0-In-Rel-MC              Value 'MC'.        01440002
                 88  R115ITP0-In-Rel-PA              Value 'PA'.        01450002
                 88  R115ITP0-In-Rel-Any             Value '* ', '  '.  01460002
      *                                                                 01470000
      *        These fields are only relevant if Rel-PA is specified.   01480001
      *        They are both mandatory for Select/Update/Delete.        01490013
               15  R115ITP0-In-Part-Amount.                             01500002
                 20  R115ITP0-In-CA-Currency    Pic  X(03).             01510002
                 20  R115ITP0-In-PA-Seq-No      Pic S9(04)       Comp.  01520002
      *                                                                 01530000
      * When performing a Get-1st-call one may ask for the total        01620000
      * number of rows complying with the qualification.                01630013
      *                                                                 01640000
             10  R115ITP0-In-Code-Count         Pic  X(10).             01650002
               88  R115ITP0-In-CC-Count              Value 'COUNT'.     01660002
      *                                                                 01670000
      *----------------------------------------------------------------*01680000
      *                                                                 01690000
           05  R115ITP0-Data.                                           01700002
      *                                                                 01710000
             10  R115ITP0-Key.                                          01720002
               15  R115ITP0-Fin-Inst-ID         Pic S9(18)       Comp-3.01730002
               15  R115ITP0-Contract-ID.                                01740002
                 20  R115ITP0-Contract-Type     Pic  X(03).             01750002
                 20  R115ITP0-Contract-No       Pic S9(07)       Comp-3.01760002
      *                                                                 01770000
      *      These fields are only relevant if Rel-PA is specified.     01780006
               15  R115ITP0-Part-Amount.                                01790006
                 20  R115ITP0-CA-Currency       Pic  X(03).             01800006
                 20  R115ITP0-PA-Seq-No         Pic S9(04)       Comp.  01810006
      *                                                                 01820006
               15  R115ITP0-Role-Type           Pic  X(10).             01830010
      *                                                                 01840010
             10  Filler.                                                01850006
               15  R115ITP0-Fin-Inst-No         Pic  X(18).             01860006
      *                                                                 01870006
      *      This code defines wether the Tast-Part is related to       01880002
      *      the main contract or a part amount.                        01890002
             10  R115ITP0-Relation              Pic  X(02).             01900005
               88  R115ITP0-Rel-MC                   Value 'MC'.        01910002
               88  R115ITP0-Rel-PA                   Value 'PA'.        01920002
      *                                                                 01930002
             10  R115ITP0-Bic                   Pic  X(12).             01940002
             10  R115ITP0-Name                  Pic  X(35).             01950002
             10  R115ITP0-Address1              Pic  X(35).             01960002
             10  R115ITP0-Address2              Pic  X(35).             01960003
             10  R115ITP0-Address3              Pic  X(35).             01960004
             10  R115ITP0-Address4              Pic  X(35).             01960005
             10  R115ITP0-Country-Code          Pic  X(02).             01960006
             10  R115ITP0-Geo-Code              Pic S9(04)       Comp.  01960007
      *                                                                 01970000
      * The following accumulators are only relevant when performing    01980000
      * Get-1st or Get-Next.                                            01990000
      * Row-No starts on 1 when doing Get-1st, and increases by 1 for   02000000
      * each Get-Next.                                                  02010000
      * Total-Rows is set when doing Get-1st, but ONLY if the           02020000
      * In-CC-Count is set. The field will tell you how many rows       02030000
      * that complies with your qualification.                          02040008
      *                                                                 02050000
             10  R115ITP0-Out-Accumulators.                             02060002
               15  R115ITP0-Out-Row-No          Pic S9(11)       Comp-3.02070002
               15  R115ITP0-Out-Total-Rows      Pic S9(11)       Comp-3.02080002
      *                                                                 02090000
