      *################################################################*00010000
      *                                                                 00020000
      * FD Trade Finance                                                00030000
      *                                                                 00040000
      * Copy-area R115L140.                                             00050005
      *                                                                 00460000
      *################################################################*00470000
      * Date ! Si! Change description                            ! 3A ! 00480000
      *------+---+-----------------------------------------------+----+ 00490000
      *060901!NDL! New Charge Action, to use when accept shadow  !LO18! 00500003
      *      !   ! on Part Amount, to keep charge % of PA on CH  !    ! 00500003
      *------+---+-----------------------------------------------+----+ 00490000
      *050599!RM ! New copy area                                 !LG10! 00500003
      *################################################################*00510000
      *                                                                 00520000
         03  R115L140-Shadow.                                           00530005
      *                                                                 00540000
           05  R115L140-Version-No              Pic  X(08).             00550005
             88  R115L140-Version                    Value '19990101'.  00560005
      *                                                                 00570000
      *----------------------------------------------------------------*00580000
      *                                                                 00690020
           05  R115L140-Qualification.                                  00690100
      *                                                                 00690200
             10  R115L140-Header-Info.                                  00530041
               15  R115L140-Function            Pic  x(08).
               15  R115L140-Medium              Pic  x(02).
               15  R115L140-Shadow-Action       Pic  X(20).
                 88    R115L140-Create-Shadow        Value 'CREATE  '.
                 88    R115L140-Accept-Shadow        Value 'ACCEPT  '.
                 88    R115L140-Delete-Shadow        Value 'DELETE  '.
      *                                                                 00690200
               15  R115L140-Charge-Action       Pic  X(01)  Value ' '.
                 88    R115L140-Charge-PA            Value 'Y'.
      *                                                                 00690200
             10  R115L140-Key-Info.                                     00530041
               15  R115L140-Fin-Inst-No         Pic  X(18).             00550039
               15  R115L140-In-Reg-No           Pic  9(04).
               15  R115L140-Contract-Type       Pic  X(03).             00550039
               15  R115L140-Contract-No         Pic S9(07)      Comp-3. 00550039
      *                                                                 00690200
      *----------------------------------------------------------------*01150000
      *                                                                 01160000
           05  R115L140-Data.                                           01170005
      *                                                                 01180000
             10  R115L140-Dummy                 Pic  X(01).             01330006
      *                                                                 01340000
