      *################################################################*00010000
      *                                                                 00020000
      * FD Trade Finance                                                00030000
      *                                                                 00040000
      * Copy-area R115L050.                                             00050005
      *                                                                 00460000
      *################################################################*00470000
      * Date ! Si! Change description                            ! 3A ! 00480000
      *------+---+-----------------------------------------------+----+ 00490000
      *010399!RM ! New copy area                                 !LG10! 00500003
      *################################################################*00510000
      *                                                                 00520000
         03  R115L050-Initial-Check.                                    00530005
      *                                                                 00540000
           05  R115L050-Version-No              Pic  X(08).             00550005
             88  R115L050-Version                    Value '19990101'.  00560005
      *                                                                 00570000
      *----------------------------------------------------------------*00580000
      *                                                                 00690020
           05  R115L050-Qualification.                                  00690100
      *                                                                 00690200
             10  R115L050-Header-Info.                                  00530041
               15  R115L050-Function            Pic  x(08).
               15  R115L050-Medium              Pic  x(02).
      *                                                                 00690200
             10  R115L050-Key-Info.                                     00530041
               15  R115L050-Fin-Inst-No         Pic  X(18).             00550039
               15  R115L050-Contr-Type          Pic  X(03).             00550039
               15  R115L050-Contr-No            Pic S9(07)  Comp-3.     00550039
               15  R115L050-PA-Seq-No           Pic S9(05)  Comp-3.     00550039
      *                                                                 00870001
               15  R115L050-Operation-Type      Pic  X(20).             00550039
               15  R115L050-Last-Update-TX      Pic  X(26).             00550039
      *                                                                 00870001
             10  R115L050-Optional-Info.                                00530041
               15  R115L050-Check-Update-TX     Pic  X(01).             00550039
                   88 R115L050-Check-For-Upd-Yes              Value ' '.00550039
                   88 R115L050-Check-For-Upd-No               Value 'N'.00550039
      *                                                                 00870001
      *----------------------------------------------------------------*01150000
      *                                                                 01160000
           05  R115L050-Data.                                           01170005
      *                                                                 01180000
             10  R115L050-Cur-Status-Prop       Pic  X(80).             01330006
      *                                                                 01340000
