      *################################################################*00010000
      *                                                                 00020000
      * FD Trade Finance                                                00030000
      *                                                                 00040000
      * Copy-area R115L240.                                             00050005
      *                                                                 00060000
      *                                                                 00460000
      *################################################################*00470000
      * Date ! Si! Change description                            ! 3A ! 00480000
      *------+---+-----------------------------------------------+----+ 00490000
      *010399!RM ! New copy area                                 !LG10! 00500003
      *################################################################*00510000
      *                                                                 00520000
         03  R115L240-Find-SWIFT-Adr.                                   00530005
      *                                                                 00540000
           05  R115L240-Version-No               Pic  X(08).            00550005
             88  R115L240-Version                    Value '20010215'.  00560005
      *                                                                 00570000
      *----------------------------------------------------------------*00580000
      *                                                                 00690020
           05  R115L240-Qualification.                                  00690100
      *                                                                 00690200
             10  R115L240-In-Key.                                       00860005
      *                                                                 00870001
              15  R115L240-In-Fin-Inst-No        Pic  X(18).            00890005
              15  R115L240-In-Fin-Inst-ID        Pic S9(18)      Comp-3.00890005
              15  R115L240-In-Cust-No            Pic S9(11)      Comp-3.00890005
              15  R115L240-In-Cust-ID            Pic S9(11)      Comp-3.00890005
      *                                                                 01140000
      *----------------------------------------------------------------*01150000
      *                                                                 01160000
           05  R115L240-Data.                                           01170005
      *                                                                 01340000
             10  R115L240-Swift-Address          Pic  X(45).            01330006
      *                                                                 01340000
