      *################################################################*00010000
      *                                                                 00020000
      * FD Trade Finance                                                00030000
      *                                                                 00040000
      * Copy-area R115L030.                                             00050005
      *                                                                 00060000
      * Module will list permitted functions belonging to a certain     00070005
      * status                                                          00070006
      *                                                                 00200000
      *################################################################*00470000
      * Date ! Si! Change description                            ! 3A ! 00480000
      *------+---+-----------------------------------------------+----+ 00490000
      *010399!RM ! New copy area                                 !LG10! 00500003
      *################################################################*00510000
      *                                                                 00520000
         03  R115L030-Set-Timestamp.                                    00530005
      *                                                                 00540000
           05  R115L030-Version-No              Pic  X(08).             00550005
             88  R115L030-Version                    Value '19990614'.  00560005
      *                                                                 00570000
      *----------------------------------------------------------------*00580000
      *                                                                 00690020
           05  R115L030-Qualification.                                  00690100
      *                                                                 00690200
               10  R115L030-Fin-Inst-No         Pic  X(18).
               10  R115L030-Contract-Type       Pic  X(03).
               10  R115L030-Contract-No         Pic S9(07)       Comp-3.
      *                                                                 00690200
               10  R115L030-CA-Currency         Pic  X(03).
               10  R115L030-PA-Seq-No           Pic S9(04)       Comp.
      *                                                                 00690200
               10  R115L030-Function            Pic  X(08).             00890005
               10  R115L030-Medium              Pic  X(02).             00890005
               10  R115L030-Exec-Date           Pic S9(08).             00890005
               10  R115L030-System-Date         Pic S9(08).             00890005
               10  R115L030-System-Time         Pic S9(08).             00890005
               10  R115L030-Userid              Pic  X(08).             00890005
      *                                                                 01340000
               10  R115L030-Status              Pic  X(20).             00890005
               10  R115L030-Status-SW           Pic  X(01).             00890005
                   88  R115L030-Set-Status                   Value 'Y'. 00890005
      *                                                                 01340000
      *        10  R115L030-In-Progress         Pic  X(01).             00890005
      *        10  R115L030-In-Progress-Sw      Pic  X(01).             00890005
      *            88  R115L030-Set-In-Progress              Value 'Y'. 00890005
      *                                                                 01340000
      *----------------------------------------------------------------*01150000
      *                                                                 01160000
           05  R115L030-Data.                                           01170005
      *                                                                 01180000
             10  R115L030-Timestamp             Pic  X(26).             01330006
             10  R115L030-Date                  Pic S9(09)       Comp-3.01330006
             10  R115L030-Time                  Pic S9(09)       Comp-3.01330006
      *                                                                 01180000
