000100*################################################################*00010000
000200*                                                                 00020000
000300* FD/Trace Finance                                                00030000
000400*                                                                 00040000
000500* Copy-area R115L330.                                             00050000
000600* Generate Field 79 in MT707                                      00060000
000700*                                                                 00070000
000800*################################################################*00080000
000900* Date ! Si! Change history                                ! 3A ! 00090000
001000*------+---+-----------------------------------------------+----+ 00100000
001100*180903!NDL! New Copyarea                                  !LY15! 00110000
001200*################################################################*00120000
001300   03  R115L330-Field79.                                          00130000
001400*                                                                 00140000
001500     05  R115L330-Version-No              Pic  X(08).             00150000
001600       88  R115L330-Version                    Value '20030225'.  00160000
001700*                                                                 00170000
001800*----------------------------------------------------------------*00180000
001900*                                                                 00190000
002000     05  R115L330-Qualification.                                  00200000
002100       10  R115L330-In-Key.                                       00210000
002200*                                                                 00220000
002300         15  R115L330-In-Fin-Inst.                                00230000
002400           20  R115L330-In-Fin-Inst-No    Pic  X(18).             00240000
002500           20  R115L330-In-Reg-No         Pic  9(4).              00250000
002600*                                                                 00260000
002700         15  R115L330-In-Contract.                                00270000
002800           20  R115L330-In-Contract-Type  Pic  X(03).             00280000
002900           20  R115L330-In-Contract-No    Pic S9(07)       Comp-3.00290000
002910*                                                                 00291001
003000         15  R115L330-In-Operation-Type   Pic  X(20).             00300001
003400*                                                                 00340000
003700*----------------------------------------------------------------*00370000
003800*                                                                 00380000
003900     05  R115L330-Data.                                           00390000
004000*                                                                 00400000
004100       10  R115L330-Dummy                Pic X(01).               00410002
