           03  R728IXL0-Kunde.
             05 R728IXL0-Version-No Pic X(08).
                88 R728IXL0-Versjon Value '00000001'.
             05 R728IXL0-Action Pic X(16).
                88 R728IXL0-In-Select Value 'SELECT'.
             05 R728IXL0-In-Hent-Navn Pic X.
                88 R728IXL0-In-Hent-Navn-Ja Value 'J'.
             05 R728IXL0-In-Hent-Adresse Pic X.
                88 R728IXL0-In-Hent-Adresse-Ja Value 'J'.
             05 R728IXL0-In-Hent-Notat Pic X.
                88 R728IXL0-In-Hent-Notat-Ja Value 'J'.
             05 R728IXL0-In-Hent-Bosted Pic X.
                88 R728IXL0-In-Hent-Bosted-Ja Value 'J'.
             05 R728IXL0-In-Konsern-Nr Pic 9(04).
             05 R728IXL0-In-Konsern-ID Pic X(18).
             05 R728IXL0-In-Kunde-ID Pic 9(11).
             05 R728IXL0-KU-Type Pic X.
                88 R728IXL0-KU-Type-Person Value 'P'.
             05 R728IXL0-PK-Pers-Fornavn Pic X(35).
             05 R728IXL0-PK-Pers-Etternavn Pic X(35).
             05 R728IXL0-NK-Naer-Firmanavn Pic X(70).
             05 R728IXL0-AD-Land-Kode Pic X(02).
             05 R728IXL0-AD-Linje-1 Pic X(35).
             05 R728IXL0-AD-Linje-2 Pic X(35).
             05 R728IXL0-AD-Linje-3 Pic X(35).
             05 R728IXL0-AD-Linje-4 Pic X(35).
             05 R728IXL0-AD-Geo-Kode Pic X(10).
             05 R728IXL0-KU-Sektor-Kode Pic 9(04).
             05 R728IXL0-KU-Sektor-Eierkode Pic 9(04).
             05 R728IXL0-AD-Post-Nummer Pic X(10).
             05 R728IXL0-AD-Post-Sted Pic X(35).
