       Identification Division.                                         00010000
       Program-ID. F115ICA0.                                            00020000
       Author.  Henning Langfeldt Rødland.                              00030000
      *################################################################*00040000
      *                                                                 00050000
      * FD Trade Finance                                                00060000
      *                                                                 00070000
      * Interface for all database access on table TF_Contract_Amount.  00080003
      *                                                                 00090003
      * The interface kan read one spesific occurence,                  00100003
      * or several occurences, fully or partly qualified with           00110003
      * from- and to- values.                                           00120003
      *                                                                 00130003
      * When reading several occurences, one must always start with     00140003
      * -In-Get-1st, and continue with -In-Get-Next.                    00150003
      *                                                                 00160003
      * NB!  There are several key-fields, which may be used            00170003
      *      differently depending on the need.                         00180003
      *      See seperate description below.                            00190003
      *                                                                 00200003
      *                                                                 00210003
      * An ordinary Select call may look like this:                     00220003
      *                                                                 00230003
      *    Initialize                          R115ICA0-Contract-Amount 00240003
      *    Set   R115ICA0-Version        To    True                     00250003
      *    Set   R115ICA0-In-Select      To    True                     00260003
      *                                                                 00270025
      * One of these:                                                   00280025
      * 1) Set   R115ICA0-In-Actual      To    True                     00290025
      * 2) Set   R115ICA0-In-Work        To    True                     00300025
      *                                                                 00310025
      *    Move  &fin-inst-id            To    R115ICA0-In-Fin-Inst-ID  00320003
      *    Move  &contract-type          To    R115ICA0-In-Contract-Type00330003
      *    Move  &contract-no            To    R115ICA0-In-Contract-No  00340003
      *    Move  &currency (ISO 4217)    To    R115ICA0-In-Currency     00350003
      *                                                                 00360003
      *    Call  'F115ICA0'              Using R115ICA0-Contract-Amount 00370003
      *                                        R7919999-Error-Area      00380005
      *    End-Call                                                     00390003
      *                                                                 00400003
      *    Evaluate True                                                00410003
      *      When R7919999-Return-Abend                                 00420005
      *        Move  '&&&&'              To    R7919999-Paragraph       00430005
      *        Perform Z900-Abend                                       00440003
      *                                                                 00450003
      *      When R7919999-Return-Error                                 00460005
      *        ...not found...                                          00470003
      *                                                                 00480003
      *      When R7919999-Return-OK                                    00490005
      *        ...found...                                              00500003
      *                                                                 00510003
      *    End-Evaluate                                                 00520003
      *                                                                 00530003
      *################################################################*00540000
      * Date ! Si! Change description                            ! 3A ! 00550000
      *------+---+-----------------------------------------------+----+ 00560000
      *190600!HLR! Removed cursors CT, CN, CU, FI-CN, FI-CU,     !LO18! 00570031
      *      !   ! CT-CN, CT-CU, CN-CU, FI-CT-CU, FI-CN-CU,      !    ! 00580031
      *      !   ! CT-CN-CU.                                     !    ! 00590031
      *      !   ! Changed cursor-qual. on FK_TFMC_Contr_Type    !    ! 00600031
      *      !   ! from "Like" to "=".                           !    ! 00610031
      *      !   ! Removed interval on Contract-No.              !    ! 00620032
      *290199!HLR! New module                                    !LG10! 00630000
      *################################################################*00640000
       Environment Division.                                            00650000
       Configuration Section.                                           00660000
       Special-Names.                                                   00670000
           Decimal-Point Is Comma.                                      00680000
      *                                                                 00690000
      *################################################################*00700000
       Data Division.                                                   00710000
       Working-Storage Section.                                         00720000
      *                                                                 00730000
       01  Filler.                                                      00740000
      *                                                                 00750000
           05  W-Table-Name              Pic  X(18) Value               00760000
                                                   'TF_Contract_Amount'.00770000
             88  SW-Table-Actual             Value 'TF_Contract_Amount'.00780028
             88  SW-Table-Work               Value 'TF_Work_CA        '.00790028
      *                                                                 00800000
           05  W-IO-Length               Pic S9(04)              Comp.  00810000
           05  W-Tally                   Pic S9(05)              Comp.  00820022
      *                                                                 00830000
           05  WD-Length                 Pic  Z.ZZ9.                    00840000
      *                                                                 00850000
           05  Ind-WS-Put                Pic S9(04)              Comp.  00860000
           05  Ind-WS                    Pic S9(04)              Comp.  00870000
           05  W-Max-Occ-WS-Tab          Pic S9(04)              Comp.  00880000
      *                                                                 00890000
           05  Filler.                                                  00900000
               10  WD-Fin-Inst-ID        Pic  zzzzzzzzzzzzzzzzz9.       00910000
               10  WD-Contract-No        Pic  9999999.                  00920000
      *                                                                 00930000
           05  Filler.                                                  00940000
               10  W-Fin-Inst-No         Pic  X(18).                    00950008
               10  W-Fin-Inst-ID         Pic  9(18)              Comp-3.00960000
      *                                                                 00970000
           05  W-Input-Action            Pic  X(10).                    00980000
             88  SW-IA-Initialize                   Value 'INITIALIZE'. 00990000
      *                                                                 01000000
      *    This field is needed because of the old interfaces used to   01010008
      *    access Fin-Inst-ID and Customer ID.                          01020008
           05  W-Tmp-Konsern-Nr          Pic  9(04).                    01030008
      *                                                                 01040008
      *----------------------------------------------------------------*01050000
      * Counters, used on cursor read, to return row no. and total      01060000
      * no. of rows.                                                    01070000
      * Total no. of rows is only returned when -In-Count is set on     01080000
      * the Get-1st-call.                                               01090000
      *                                                                 01100000
           05  WC-Counters.                                             01110000
               10  WC-Row-No             Pic S9(11)              Comp-3.01120000
               10  WC-Total-No-Of-Rows   Pic S9(11)              Comp-3.01130000
      *                                                                 01140000
      *----------------------------------------------------------------*01150000
      * Switches used for selecting the correct cursor:                 01160000
      *                                                                 01170000
           05  SW-Cursor-Code.                                          01180000
               10  SW-CC-Fin-Inst        Pic  X(01).                    01190000
                 88  SW-Use-Fin-Inst                Value 'F'.          01200000
               10  SW-CC-Contract-Type   Pic  X(01).                    01210000
                 88  SW-Use-Contract-Type           Value 'T'.          01220000
               10  SW-CC-Contract-No     Pic  X(01).                    01230000
                 88  SW-Use-Contract-No             Value 'N'.          01240000
               10  SW-CC-Currency        Pic  X(01).                    01250000
                 88  SW-Use-Currency                Value 'C'.          01260000
      *                                                                 01270000
           05  Filler                    Redefines SW-Cursor-Code       01280000
                                         Pic  X(04).                    01290000
             88  SW-Use-Fi-Asc                      Value 'F   '.       01300000
             88  SW-Use-Fi-CT-Asc                   Value 'FT  '.       01310000
             88  SW-Use-Fi-CT-CN-Asc                Value 'FTN '.       01320000
             88  SW-Use-Fi-CT-CN-Cu-Asc             Value 'FTNC'.       01330000
      *                                                                 01340000
      *----------------------------------------------------------------*01350000
      * These fields are used for SQL qualification:                    01360000
      *                                                                 01370000
           05  W-DB-Key.                                                01380000
               10  W-DB-Fin-Inst-ID      Pic S9(18)              Comp-3.01390000
               10  W-DB-Contract-Type    Pic  X(03).                    01400000
               10  W-DB-Contract-No      Pic S9(07)              Comp-3.01410032
               10  W-DB-Currency         Pic  X(03).                    01420000
      *                                                                 01430000
      *----------------------------------------------------------------*01440000
      * These fields are used for comparison with the WS-fields.        01450000
      *                                                                 01460000
           05  WE-Cursor-Info.                                          01470000
             07  WE-Key.                                                01480000
               10  WE-Fin-Inst-ID        Pic S9(18)              Comp-3.01490000
               10  WE-Fin-Inst-No        Pic  X(18).                    01500008
               10  WE-Contract-Type      Pic  X(03).                    01510000
               10  WE-Contract-No        Pic S9(07)              Comp-3.01520032
               10  WE-Currency           Pic  X(03).                    01530000
             07  WE-Code-Sequence        Pic  X(01).                    01540000
               88  WE-CS-Ascending                  Value 'A'.          01550000
               88  WE-CS-Descending                 Value 'D'.          01560000
      *                                                                 01570000
      *----------------------------------------------------------------*01580000
      * Storage, and switches for identifying the content:              01590000
      * The cursor info is used to verify that the get-next has the     01600000
      * same qualification as the get-1st.                              01610000
      *                                                                 01620000
       01  W-Storage.                                                   01630000
      *                                                                 01640000
           05  WS-Cursor-Info.                                          01650000
             07  WS-Key.                                                01660000
               10  WS-Fin-Inst-ID        Pic S9(18)              Comp-3.01670000
               10  WS-Fin-Inst-No        Pic  X(18).                    01680008
               10  WS-Contract-Type      Pic  X(03).                    01690000
               10  WS-Contract-No        Pic S9(07)              Comp-3.01700032
               10  WS-Currency           Pic  X(03).                    01710000
             07  WS-Code-Sequence        Pic  X(01).                    01720000
               88  WS-CS-Ascending                  Value 'A'.          01730000
               88  WS-CS-Descending                 Value 'D'.          01740000
             07  WS-Cursor-Status        Pic  X(08).                    01750000
               88  WS-Cursor-OK                     Value 'OK'.         01760000
               88  WS-Cursor-End                    Value 'END'.        01770000
      *                                                                 01780000
      * We store all occurences that are read, also those that we do    01790000
      * not find. This is to reduce the number of DB2 accesses.         01800000
      *                                                                 01810000
           05  WS-DB2-Table.                                            01820000
             07  WS-DB2-Row              Occurs 10 Times.               01830000
               10  WS-DB2-Tbl-Version    Pic  X(16).                    01840026
               10  WS-DB2-Fin-Inst-ID    Pic S9(18)              Comp-3.01850026
               10  WS-DB2-Contract-Type  Pic  X(03).                    01860000
               10  WS-DB2-Contract-No    Pic S9(07)              Comp-3.01870000
               10  WS-DB2-Currency       Pic  X(03).                    01880000
               10  WS-DB2-Row-Status     Pic S9(01)              Comp-3.01890016
                 88  WS-DB2-Not-Read                Value +0.           01900000
                 88  WS-DB2-Read                    Value +1.           01910000
                 88  WS-DB2-Not-Found               Value +2.           01920000
               10  WS-DB2-DCL            Pic  X(250).                   01930000
      *                                                                 01940000
      *----------------------------------------------------------------*01950000
      * Areas for use when accessing DB2.                               01960000
      *                                                                 01970000
           Exec SQL Include R115TFCA End-Exec.                          01980000
      *                                                                 01990000
      *----------------------------------------------------------------*02000000
      * Internal area:                                                  02010000
      *                                                                 02020000
       01  W-Int-IO-Area.                                               02030000
           Copy R115ICA0.                                               02040000
      *                                                                 02050000
      *----------------------------------------------------------------*02060000
      * Assorted copy-areas:                                            02070000
      *                                                                 02080000
       01  Filler.                                                      02090000
           Copy R115ICAS.                                               02100000
      *                                                                 02110000
       01  Filler.                                                      02120000
           Copy R5879010.                                               02130000
      *                                                                 02140000
       01  Filler.                                                      02150000
           Copy R7918030.                                               02160000
      *                                                                 02170000
       Copy R115X000.                                                   02180007
      *                                                                 02190007
      *################################################################.02200000
       Linkage Section.                                                 02210000
      *                                                                 02220000
       01  L-Ext-IO-Area                 Pic  X(560).                   02230000
       Copy R7919999.                                                   02240000
      *                                                                 02250000
      *################################################################.02260000
       Procedure Division                Using L-Ext-IO-Area            02270000
                                               R7919999-Error-Area.     02280005
      *                                                                 02290000
       A000-Main                         Section.                       02300000
      *                                                                 02310000
           Perform B000-Initialize                                      02320000
      *                                                                 02330000
           Evaluate True                                                02340000
             When SW-IA-Initialize                                      02350000
               Continue                                                 02360000
      *                                                                 02370000
             When Other                                                 02380000
               Perform ZI00-Conv-Input-Version                          02390015
               Perform C000-Interface                                   02400000
               Perform ZO00-Conv-Output-Version                         02410015
      *                                                                 02420000
           End-Evaluate                                                 02430000
      *                                                                 02440000
           Goback.                                                      02450000
      *################################################################*02460000
       B000-Initialize                   Section.                       02470000
      *                                                                 02480000
           Set   R7919999-Return-OK      To    True                     02490005
      *                                                                 02500000
           Evaluate True                                                02510000
             When L-Ext-IO-Area (1:10)   =     'INITIALIZE'             02520000
               Set   Sw-IA-Initialize    To    True                     02530000
             When Other                                                 02540000
               Move  Space               To    W-Input-Action           02550000
           End-Evaluate                                                 02560000
      *                                                                 02570000
           Compute  W-Max-Occ-WS-Tab                                    02580000
               =    Length               Of    WS-DB2-Table             02590000
               /    Length               Of    WS-DB2-Row               02600000
      *                                                                 02610000
           If  Sw-IA-Initialize                                         02620000
           or  WS-DB2-Row-Status (1)     Not   Numeric                  02630016
               Initialize                      W-Storage                02640000
               Move  +0                  To    Ind-WS-Put               02650000
           End-If                                                       02660000
      *                                                                 02670000
           If  WC-Row-No                 Not   Numeric                  02680000
           or  WC-Total-No-Of-Rows       Not   Numeric                  02690000
               Initialize                      WC-Counters              02700000
           End-If                                                       02710000
      *                                                                 02720000
           Evaluate True                                                02730007
             When Not R115X000-Is-Initiated                             02740007
               Initialize                      R115X000-External-Data   02750007
             When Not R115X000-Version                                  02760007
               Initialize                      R7918030-ErrorMessage    02770007
               Move  'GL-VERSION-INVALID'                               02780007
                                         To    R7918030-In-MessageCode  02790007
               Move  'VAR1'              To R7918030-In-Variable-Key (1)02800007
               Move  R115X000-Version-No To R7918030-In-Variable-Data(1)02810007
               Move  'VAR2'              To R7918030-In-Variable-Key (2)02820007
               Move  'R115X000'          To R7918030-In-Variable-Data(2)02830007
               Perform Z000-Error-Message                               02840007
               Move  'B001'              To    R7919999-Paragraph       02850007
               Perform Z900-Abend                                       02860007
           End-Evaluate                                                 02870007
      *                                                                 02880007
           .                                                            02890000
      *################################################################.02900000
       C000-Interface                    Section.                       02910000
      *                                                                 02920000
           Perform C100-Verify                                          02930026
      *                                                                 02940026
           Evaluate True                                                02950000
             When R115ICA0-In-Get-1st                                   02960000
               Perform C200-Initialize-Output                           02970026
               Perform D000-Get-1st                                     02980000
               Perform E000-Get-Next                                    02990000
      *                                                                 03000000
             When R115ICA0-In-Get-Next                                  03010000
               Perform C200-Initialize-Output                           03020026
               Perform E000-Get-Next                                    03030000
      *                                                                 03040000
             When R115ICA0-In-Select                                    03050000
               Perform C200-Initialize-Output                           03060026
               Perform F000-Select                                      03070000
      *                                                                 03080000
             When R115ICA0-In-Insert                                    03090000
               Perform G000-Insert                                      03100000
      *                                                                 03110000
             When R115ICA0-In-Update                                    03120000
               Perform H000-Update                                      03130000
      *                                                                 03140000
             When R115ICA0-In-Delete                                    03150000
               Perform I000-Delete                                      03160000
      *                                                                 03170000
             When Other                                                 03180000
               Initialize                      R7918030-ErrorMessage    03190005
               Move  'GL-IN-AKSJON-UV'   To    R7918030-In-MessageCode  03200005
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03210005
               Move  R115ICA0-In-Action  To R7918030-In-Variable-Data(1)03220005
               Perform Z000-Error-Message                               03230000
               Move  'C001'              To    R7919999-Paragraph       03240005
               Perform Z900-Abend                                       03250000
      *                                                                 03260000
           End-Evaluate                                                 03270000
      *                                                                 03280000
           .                                                            03290000
      *################################################################.03300000
       C100-Verify                       Section.                       03310026
      *                                                                 03320000
           Evaluate True                                                03330028
             When R115ICA0-In-Actual                                    03340028
               Set   SW-Table-Actual     To    True                     03350028
      *                                                                 03360028
             When R115ICA0-In-Work                                      03370028
               Set   SW-Table-Work       To    True                     03380028
      *                                                                 03390028
             When other                                                 03400028
               Initialize                      R7918030-ErrorMessage    03410026
               Move  'GL-IN-TABLE-VERSION-UV'                           03420026
                                         To    R7918030-In-MessageCode  03430026
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03440026
               Move  R115ICA0-In-Table-Version                          03450026
                                         To R7918030-In-Variable-Data(1)03460026
               Perform Z000-Error-Message                               03470026
               Move  'C101'              To    R7919999-Paragraph       03480026
               Perform Z900-Abend                                       03490026
      *                                                                 03500026
           End-Evaluate                                                 03510028
      *                                                                 03520028
           .                                                            03530026
      *################################################################.03540026
       C200-Initialize-Output            Section.                       03550026
      *                                                                 03560026
           Initialize                          R115ICA0-Data            03570000
      *                                                                 03580000
           .                                                            03590000
      *################################################################.03600000
       D000-Get-1st                      Section.                       03610000
      *                                                                 03620000
           Perform D100-Prepare-Input                                   03630000
           Perform D200-Prepare-Qualification                           03640000
           Perform D300-Select-Cursor                                   03650000
           If  R115ICA0-In-CC-Count                                     03660000
               Perform D400-Count-Cursor                                03670000
           End-If                                                       03680000
           Perform D500-Open-Cursor                                     03690000
      *                                                                 03700000
           .                                                            03710000
      *################################################################.03720000
       D100-Prepare-Input                Section.                       03730000
      *                                                                 03740000
      * We create internal from- and to-values, depending on the input. 03750000
      *                                                                 03760000
           Initialize                          WE-Cursor-Info           03770000
      *                                                                 03780000
           Move  R115ICA0-In-Fin-Inst-ID To    WE-Fin-Inst-ID           03790000
           Move  R115ICA0-In-Fin-Inst-No To    WE-Fin-Inst-No           03800000
      *                                                                 03810000
           Move  R115ICA0-In-Contract-Type                              03820000
                                         To    WE-Contract-Type         03830000
      *    Move  +0                      To    W-Tally                  03840031
      *    Inspect WE-Contract-Type     Tallying W-Tally for all '*' '%'03850031
      *    If  W-Tally                   >     +0                       03860031
      *        Inspect WE-Contract-Type  Converting '* ' to '%%'        03870031
      *    End-If                                                       03880031
      *                                                                 03890000
      *                                                                 03901333
           Move  R115ICA0-In-Contract-No To    WE-Contract-No           03902033
      *                                                                 03910000
           Move  R115ICA0-In-Currency    To    WE-Currency              03920000
           Move  +0                      To    W-Tally                  03930022
           Inspect WE-Currency          Tallying W-Tally for all '*' '%'03940022
           If  W-Tally                   >     +0                       03950022
               Inspect WE-Currency       Converting '* ' to '%%'        03960022
           End-If                                                       03970021
      *                                                                 03980000
           .                                                            03990000
      *################################################################.04000000
       D200-Prepare-Qualification        Section.                       04010000
      *                                                                 04020000
      * We store the qualification, so that we can check that the       04030000
      * qualification do not change on any following Get-Next.          04040000
      *                                                                 04050000
           Initialize                          WS-Cursor-Info           04060000
           Move  WE-Key                  To    WS-Key                   04070000
           Move  WE-Code-Sequence        To    WS-Code-Sequence         04080000
      *                                                                 04090000
           Initialize WC-Counters                                       04100000
      *                                                                 04110000
      * We fill in the SQL host variables.                              04120000
      *                                                                 04130000
           Initialize                          W-DB-Key                 04140000
      *                                                                 04150000
           Move  WE-Fin-Inst-ID          To    W-DB-Fin-Inst-ID         04160000
           Move  WE-Contract-Type        To    W-DB-Contract-Type       04170000
           Move  WE-Contract-No          To    W-DB-Contract-No         04180032
           Move  WE-Currency             To    W-DB-Currency            04190000
      *                                                                 04200000
           If  WE-Fin-Inst-No            Not = Space                    04210008
           and W-DB-Fin-Inst-ID          =     +0                       04220000
               Move  WE-Fin-Inst-No      To    W-Fin-Inst-No            04230000
               Perform N100-Fetch-Fin-Inst-ID                           04240000
               Move  W-Fin-Inst-ID       To    W-DB-Fin-Inst-ID         04250000
           End-If                                                       04260000
      *                                                                 04270000
           .                                                            04280000
      *################################################################.04290000
       D300-Select-Cursor                Section.                       04300000
      *                                                                 04310000
      * We choose which cursor to use, depending on the qualification.  04320000
      *                                                                 04330000
           Move  Space                   To    SW-Cursor-Code           04340000
      *                                                                 04350000
           If  W-DB-Fin-Inst-ID          Not = +0                       04360000
               Set  Sw-Use-Fin-Inst      To    True                     04370000
           End-If                                                       04380000
      *                                                                 04390000
           If  W-DB-Contract-Type        Not = Space                    04400020
      *    and W-DB-Contract-Type (1:1)  Not = '%'                      04410031
               Set   SW-Use-Contract-Type                               04420000
                                         To    True                     04430000
           End-If                                                       04440019
      *                                                                 04450000
           If  W-DB-Contract-No          Not = +0                       04460032
               Set   SW-Use-Contract-No  To    True                     04470000
           End-If                                                       04480032
      *                                                                 04490000
           If  W-DB-Currency             Not = Space                    04500020
           and W-DB-Currency (1:1)       Not = '%'                      04510020
               Set  Sw-Use-Currency      To    True                     04520000
           End-If                                                       04530000
      *                                                                 04540000
           Evaluate True                                                04550000
             When SW-Use-Fi-Asc                                         04560000
             or   SW-Use-Fi-CT-Asc                                      04570000
             or   SW-Use-Fi-CT-CN-Asc                                   04580000
             or   SW-Use-Fi-CT-CN-Cu-Asc                                04590000
               Continue                                                 04600000
      *                                                                 04610000
             When other                                                 04620000
               Initialize                      R7918030-ErrorMessage    04630005
               Move  'GL-CURSOR-UV'      To    R7918030-In-MessageCode  04640005
               Move  'VAR1'              To R7918030-In-Variable-Key (1)04650005
               Move  SW-Cursor-Code      To R7918030-In-Variable-Data(1)04660005
               Perform Z000-Error-Message                               04670000
               Move  'D302'              To    R7919999-Paragraph       04680005
               Perform Z900-Abend                                       04690000
      *                                                                 04700000
           End-Evaluate                                                 04710000
      *                                                                 04720000
           .                                                            04730000
      *################################################################.04740000
       D400-Count-Cursor                 Section.                       04750000
      *                                                                 04760000
           Initialize                          R115ICAS-SQL-Submodules  04770000
           Set   R115ICAS-Version        To    True                     04780000
           Set   R115ICAS-In-Count-Cursor                               04790000
                                         To    True                     04800000
           Move  R115ICA0-In-Table-Version                              04810026
                                         To    R115ICAS-In-Table-Version04820026
           Move  Sw-Cursor-Code          To    R115ICAS-Cursor-Code     04830026
           Move  W-DB-Key                To    R115ICAS-DB-Key          04840000
      *                                                                 04850000
           Call  'F115ICAR'              Using R115ICAS-SQL-Submodules  04860000
                                               DCLTF-Contract-Amount    04870000
                                               R7919999-Error-Area      04880005
           End-Call                                                     04890000
      *                                                                 04900000
           Evaluate True                                                04910000
             When R7919999-Return-OK                                    04920005
               Move  R115ICAS-Out-Total-Rows                            04930000
                                         To    WC-Total-No-Of-Rows      04940000
      *                                                                 04950000
             When other                                                 04960000
               Move  'D401'              To    R7919999-Paragraph       04970005
               Perform Z900-Abend                                       04980000
      *                                                                 04990000
           End-Evaluate                                                 05000000
      *                                                                 05010000
           .                                                            05020000
      *################################################################.05030000
       D500-Open-Cursor                  Section.                       05040000
      *                                                                 05050000
           Initialize                          R115ICAS-SQL-Submodules  05060000
           Set   R115ICAS-Version        To    True                     05070000
           Set   R115ICAS-In-Open-Cursor To    True                     05080000
           Move  R115ICA0-In-Table-Version                              05090026
                                         To    R115ICAS-In-Table-Version05100026
           Move  Sw-Cursor-Code          To    R115ICAS-Cursor-Code     05110000
           Move  W-DB-Key                To    R115ICAS-DB-Key          05120000
      *                                                                 05130000
           Call  'F115ICAR'              Using R115ICAS-SQL-Submodules  05140000
                                               DCLTF-Contract-Amount    05150000
                                               R7919999-Error-Area      05160005
           End-Call                                                     05170000
      *                                                                 05180000
           Evaluate True                                                05190000
             When R7919999-Return-OK                                    05200005
               Set   WS-Cursor-OK        To    True                     05210000
      *                                                                 05220000
             When other                                                 05230000
               Move  'D501'              To    R7919999-Paragraph       05240005
               Perform Z900-Abend                                       05250000
      *                                                                 05260000
           End-Evaluate                                                 05270000
      *                                                                 05280000
           .                                                            05290000
      *################################################################.05300000
       E000-Get-Next                     Section.                       05310000
      *                                                                 05320000
           Perform D100-Prepare-Input                                   05330000
           Perform E100-Check-Qualification                             05340000
           Perform E200-Fetch-Cursor                                    05350000
      *                                                                 05360000
           If  R7919999-Return-OK                                       05370005
               Perform L100-Store-DCL                                   05380000
               Perform J000-Get-Columns                                 05390000
           End-If                                                       05400000
      *                                                                 05410000
           .                                                            05420000
      *################################################################.05430000
       E100-Check-Qualification          Section.                       05440000
      *                                                                 05450000
      * We use the WE-fields for comparison with the WS-fields.         05460000
      * This to verify that the qualification has not changes since     05470000
      * the Get-1st.                                                    05480000
      *                                                                 05490000
           Evaluate True                                                05500000
             When WE-Key                 =     WS-Key                   05510000
             and  WE-Code-Sequence       =     WS-Code-Sequence         05520000
             and  WS-Cursor-OK                                          05530000
               Continue                                                 05540000
      *                                                                 05550000
             When WE-Key                 =     WS-Key                   05560000
             and  WE-Code-Sequence       =     WS-Code-Sequence         05570000
             and  WS-Cursor-End                                         05580000
               Initialize                      R7918030-ErrorMessage    05590005
               Move  'DB-LEST-SISTE'     To    R7918030-In-MessageCode  05600005
               Move  'VAR1'              To R7918030-In-Variable-Key (1)05610005
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)05620005
               Perform Z000-Error-Message                               05630000
               Move  'E101'              To    R7919999-Paragraph       05640005
               Perform Z900-Abend                                       05650000
      *                                                                 05660000
             When Other                                                 05670000
               Initialize                      R7918030-ErrorMessage    05680005
               Move  'GL-BRUK-GET-1ST'   To    R7918030-In-MessageCode  05690005
               Perform Z000-Error-Message                               05700000
               Move  'E102'              To    R7919999-Paragraph       05710005
               Perform Z900-Abend                                       05720000
      *                                                                 05730000
           End-Evaluate                                                 05740000
      *                                                                 05750000
           .                                                            05760000
      *################################################################.05770000
       E200-Fetch-Cursor                 Section.                       05780000
      *                                                                 05790000
           Initialize                          R115ICAS-SQL-Submodules  05800000
           Set   R115ICAS-Version        To    True                     05810000
           Set   R115ICAS-In-Fetch-Cursor                               05820000
                                         To    True                     05830000
           Move  R115ICA0-In-Table-Version                              05840026
                                         To    R115ICAS-In-Table-Version05850026
           Move  Sw-Cursor-Code          To    R115ICAS-Cursor-Code     05860000
           Move  W-DB-Key                To    R115ICAS-DB-Key          05870000
      *                                                                 05880000
           Call  'F115ICAR'              Using R115ICAS-SQL-Submodules  05890000
                                               DCLTF-Contract-Amount    05900000
                                               R7919999-Error-Area      05910005
           End-Call                                                     05920000
      *                                                                 05930000
           Evaluate True                                                05940000
             When R7919999-Return-OK                                    05950005
               Add   +1                  To    WC-Row-No                05960000
      *                                                                 05970000
             When R7919999-Return-Error                                 05980005
               Set   WS-Cursor-End       To    True                     05990000
               If  WC-Row-No             =     +0                       06000000
                 Then                                                   06010000
                   Initialize                  R7918030-ErrorMessage    06020005
                   Move  'DB-FOREKOMST-NF'                              06030000
                                         To    R7918030-In-MessageCode  06040005
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)06050005
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)06060005
                   Perform Z000-Error-Message                           06070000
                 Else                                                   06080000
                   Initialize                  R7918030-ErrorMessage    06090005
                   Move  'DB-LEST-SISTE' To    R7918030-In-MessageCode  06100005
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)06110005
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)06120005
                   Perform Z000-Error-Message                           06130000
               End-If                                                   06140000
      *                                                                 06150000
             When other                                                 06160000
               Move  'E201'              To    R7919999-Paragraph       06170005
               Perform Z900-Abend                                       06180000
      *                                                                 06190000
           End-Evaluate                                                 06200000
      *                                                                 06210000
           .                                                            06220000
      *################################################################.06230000
       F000-Select                       Section.                       06240000
      *                                                                 06250000
           Perform F100-Prepare-Qualification                           06260000
      *                                                                 06270000
      * We will first look through the storage, to see if we have       06280000
      * already got the wanted occurence.                               06290000
      *                                                                 06300000
           Perform L200-Find-DCL                                        06310000
      *                                                                 06320000
      * If we didn't find anything, we need to read. Then we store.     06330000
      *                                                                 06340000
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         06350000
           or  WS-DB2-Not-Read (Ind-WS)                                 06360000
               Perform F200-Select-Row                                  06370000
               Perform L100-Store-DCL                                   06380000
           End-If                                                       06390000
      *                                                                 06400000
      * At last we check what we've got to offer.                       06410000
      *                                                                 06420000
           Evaluate True                                                06430000
             When WS-DB2-Read (Ind-WS)                                  06440000
               Move  WS-DB2-DCL (Ind-WS) To    DCLTF-Contract-Amount    06450000
               Perform J000-Get-Columns                                 06460000
      *                                                                 06470000
             When other                                                 06480000
               Initialize                      R7918030-ErrorMessage    06490005
               Move  'DB-FOREKOMST-NF-Q' To    R7918030-In-MessageCode  06500005
               Move  'VAR1'              To R7918030-In-Variable-Key (1)06510005
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)06520005
               Move  'VAR2'              To R7918030-In-Variable-Key (2)06530005
               Move  FK-OAKO-FinInst-ID  To WD-Fin-Inst-ID              06540000
               Move  FK-TFMC-Contr-No    To WD-Contract-No              06550000
               String WD-Fin-Inst-ID           Delimited by size        06560000
                      '/'                      Delimited by size        06570010
                      FK-TFMC-Contr-Type       Delimited by space       06580000
                      WD-Contract-No           Delimited by space       06590000
                      '/'                      Delimited by size        06600010
                      TFCA-Currency            Delimited by space       06610000
                                       Into R7918030-In-Variable-Data(2)06620005
               End-String                                               06630000
               Perform Z000-Error-Message                               06640000
               Set   R7919999-Return-Error                              06650005
                                         To    True                     06660005
      *                                                                 06670000
           End-Evaluate                                                 06680000
      *                                                                 06690000
           .                                                            06700000
      *################################################################.06710000
       F100-Prepare-Qualification        Section.                       06720000
      *                                                                 06730000
      * We fill in the host variables for the SQL.                      06740000
      *                                                                 06750000
           Initialize                          DCLTF-Contract-Amount    06760000
      *                                                                 06770000
           Move  R115ICA0-In-Fin-Inst-ID To    FK-OAKO-FinInst-ID       06780000
           Move  R115ICA0-In-Contract-Type                              06790000
                                         To    FK-TFMC-Contr-Type       06800000
           Move  R115ICA0-In-Contract-No To    FK-TFMC-Contr-No         06810000
           Move  R115ICA0-In-Currency    To    TFCA-Currency            06820000
      *                                                                 06830000
           If  R115ICA0-In-Fin-Inst-No   Not = Space                    06840008
           and R115ICA0-In-Fin-Inst-ID   =     +0                       06850000
               Move  R115ICA0-In-Fin-Inst-No                            06860000
                                         To    W-Fin-Inst-No            06870000
               Perform N100-Fetch-Fin-Inst-ID                           06880000
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       06890000
           End-If                                                       06900000
      *                                                                 06910000
           .                                                            06920000
      *################################################################.06930000
       F200-Select-Row                   Section.                       06940000
      *                                                                 06950000
           Initialize                          R115ICAS-SQL-Submodules  06960000
           Set   R115ICAS-Version        To    True                     06970000
           Set   R115ICAS-In-Select      To    True                     06980000
           Move  R115ICA0-In-Table-Version                              06990026
                                         To    R115ICAS-In-Table-Version07000026
      *                                                                 07010000
           Call  'F115ICAR'              Using R115ICAS-SQL-Submodules  07020000
                                               DCLTF-Contract-Amount    07030000
                                               R7919999-Error-Area      07040005
           End-Call                                                     07050000
      *                                                                 07060000
           Evaluate True                                                07070000
             When R7919999-Return-OK                                    07080005
               Continue                                                 07090000
      *                                                                 07100000
             When R7919999-Return-Error                                 07110005
               Continue                                                 07120000
      *                                                                 07130000
             When other                                                 07140000
               Move  'F201'              To    R7919999-Paragraph       07150005
               Perform Z900-Abend                                       07160000
      *                                                                 07170000
           End-Evaluate                                                 07180000
      *                                                                 07190000
           .                                                            07200000
      *################################################################.07210000
       G000-Insert                       Section.                       07220000
      *                                                                 07230000
           Perform G100-Move-Input-To-DCL                               07240000
           Perform G200-Insert-Row                                      07250000
      *                                                                 07260000
           Perform L300-Remove-DCL                                      07270000
           Perform L100-Store-DCL                                       07280000
      *                                                                 07290000
           .                                                            07300000
      *################################################################.07310000
       G100-Move-Input-To-DCL            Section.                       07320000
      *                                                                 07330000
      * PLEASE REMEMBER:                                                07340023
      *    When you modify the code in this section, you need to do     07350023
      *    the same modifications in module F115ACA0 - E200-section.    07360023
      *                                                                 07370023
           Initialize                          DCLTF-Contract-Amount    07380000
      *                                                                 07390000
           Move R115ICA0-Fin-Inst-ID     To    FK-OAKO-FinInst-ID       07400000
           If  R115ICA0-Fin-Inst-No      Not = Space                    07410008
           and R115ICA0-Fin-Inst-ID      =     +0                       07420000
               Move  R115ICA0-Fin-Inst-No                               07430011
                                         To    W-Fin-Inst-No            07440000
               Perform N100-Fetch-Fin-Inst-ID                           07450000
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       07460000
           End-If                                                       07470000
      *                                                                 07480000
           Move R115ICA0-Contract-Type   To    FK-TFMC-Contr-Type       07490000
           Move R115ICA0-Contract-No     To    FK-TFMC-Contr-No         07500000
      *                                                                 07510000
           Move R115ICA0-Currency        To    TFCA-Currency            07520000
           Move R115ICA0-Original-Amount To    TFCA-Orig-Amount         07530006
           Move R115ICA0-Remaining-Amount                               07540006
                                         To    TFCA-Remain-Amount       07550006
           Move R115ICA0-Min-Pct-Tolerance                              07560005
                                         To    TFCA-Min-Pct-Toler       07570005
           Move R115ICA0-Max-Pct-Tolerance                              07580005
                                         To    TFCA-Max-Pct-Toler       07590005
           Move R115ICA0-Prev-O-Amount   To    TFCA-Prev-O-Amount       07600030
           Move R115ICA0-Curr-O-Amount   To    TFCA-Curr-O-Amount       07610030
      *                                                                 07620000
           .                                                            07630000
      *################################################################.07640000
       G200-Insert-Row                   Section.                       07650000
      *                                                                 07660000
           Initialize                          R115ICAS-SQL-Submodules  07670000
           Set   R115ICAS-Version        To    True                     07680000
           Set   R115ICAS-In-Insert      To    True                     07690000
           Move  R115ICA0-In-Table-Version                              07700026
                                         To    R115ICAS-In-Table-Version07710026
      *                                                                 07720000
           Call  'F115ICAU'              Using R115ICAS-SQL-Submodules  07730000
                                               DCLTF-Contract-Amount    07740000
                                               R7919999-Error-Area      07750005
           End-Call                                                     07760000
      *                                                                 07770000
           Evaluate True                                                07780000
             When R7919999-Return-OK                                    07790005
               Continue                                                 07800000
      *                                                                 07810000
             When R7919999-Return-Error                                 07820005
               Continue                                                 07830000
      *                                                                 07840000
             When other                                                 07850000
               Move  'G201'              To    R7919999-Paragraph       07860005
               Perform Z900-Abend                                       07870000
      *                                                                 07880000
           End-Evaluate                                                 07890000
      *                                                                 07900000
           .                                                            07910000
      *################################################################.07920000
       H000-Update                       Section.                       07930000
      *                                                                 07940000
           Perform H100-Check-Qualification                             07950000
           Perform G100-Move-Input-To-DCL                               07960000
      *                                                                 07970000
           Perform H200-Update-Row                                      07980000
      *                                                                 07990000
           Perform L300-Remove-DCL                                      08000000
           Perform L100-Store-DCL                                       08010000
      *                                                                 08020000
           .                                                            08030000
      *################################################################.08040000
       H100-Check-Qualification          Section.                       08050000
      *                                                                 08060000
           Evaluate True                                                08070000
             When R115ICA0-Fin-Inst-ID   Not = +0                       08080000
               Continue                                                 08090000
                                                                        08100000
             When R115ICA0-Fin-Inst-No   Not = Space                    08110008
               Move  R115ICA0-Fin-Inst-No                               08120000
                                         To    W-Fin-Inst-No            08130000
               Perform N100-Fetch-Fin-Inst-ID                           08140000
               Move  W-Fin-Inst-ID       To    R115ICA0-Fin-Inst-ID     08150000
                                                                        08160000
             When R115ICA0-In-Fin-Inst-Id Not = +0                      08170000
               Move R115ICA0-In-Fin-Inst-ID                             08180000
                                         To    R115ICA0-Fin-Inst-ID     08190000
                                                                        08200000
             When R115ICA0-In-Fin-Inst-No                               08210008
                                         Not = Space                    08220008
               Move  R115ICA0-In-Fin-Inst-No                            08230000
                                         To    W-Fin-Inst-No            08240000
               Perform N100-Fetch-Fin-Inst-ID                           08250000
               Move  W-Fin-Inst-ID       To    R115ICA0-Fin-Inst-ID     08260000
                                                                        08270000
             When other                                                 08280000
               Initialize                      R7918030-ErrorMessage    08290005
               Move  'TF-FIN-INST-MISSING'                              08300000
                                         To    R7918030-In-MessageCode  08310005
               Perform Z000-Error-Message                               08320000
               Set   R7919999-Return-Error                              08330005
                                         To    True                     08340005
                                                                        08350000
           End-Evaluate                                                 08360000
      *                                                                 08370000
           Evaluate True                                                08380000
             When R115ICA0-Contract-Type Not = Space                    08390000
               Continue                                                 08400000
                                                                        08410000
             When R115ICA0-In-Contract-Type                             08420000
                                         Not = Space                    08430000
               Move R115ICA0-In-Contract-Type                           08440000
                                         To    R115ICA0-Contract-Type   08450000
                                                                        08460000
             When other                                                 08470000
               Initialize                      R7918030-ErrorMessage    08480005
               Move  'TF-CONTRACT-MISSING'                              08490000
                                         To    R7918030-In-MessageCode  08500005
               Perform Z000-Error-Message                               08510000
               Set   R7919999-Return-Error                              08520005
                                         To    True                     08530005
                                                                        08540000
           End-Evaluate                                                 08550000
      *                                                                 08560000
           Evaluate True                                                08570000
             When R115ICA0-Contract-No   Not = +0                       08580000
               Continue                                                 08590000
                                                                        08600000
             When R115ICA0-In-Contract-No                               08610000
                                         Not = +0                       08620000
               Move R115ICA0-In-Contract-No                             08630000
                                         To    R115ICA0-Contract-No     08640000
                                                                        08650000
             When other                                                 08660000
               Initialize                      R7918030-ErrorMessage    08670005
               Move  'TF-CONTRACT-MISSING'                              08680000
                                         To    R7918030-In-MessageCode  08690005
               Perform Z000-Error-Message                               08700000
               Set   R7919999-Return-Error                              08710005
                                         To    True                     08720005
                                                                        08730000
           End-Evaluate                                                 08740000
      *                                                                 08750000
           Evaluate True                                                08760000
             When R115ICA0-Currency      Not = Space                    08770000
               Continue                                                 08780000
                                                                        08790000
             When R115ICA0-In-Currency   Not = Space                    08800000
               Move R115ICA0-In-Currency To    R115ICA0-Currency        08810000
                                                                        08820000
             When other                                                 08830000
               Initialize                      R7918030-ErrorMessage    08840005
               Move  'TF-CURRENCY-MISSING'                              08850012
                                         To    R7918030-In-MessageCode  08860005
               Perform Z000-Error-Message                               08870000
               Set   R7919999-Return-Error                              08880005
                                         To    True                     08890005
                                                                        08900000
           End-Evaluate                                                 08910000
      *                                                                 08920000
           .                                                            08930000
      *################################################################.08940000
       H200-Update-Row                   Section.                       08950000
      *                                                                 08960000
           Initialize                          R115ICAS-SQL-Submodules  08970000
           Set   R115ICAS-Version        To    True                     08980000
           Set   R115ICAS-In-Update      To    True                     08990000
           Move  R115ICA0-In-Table-Version                              09000026
                                         To    R115ICAS-In-Table-Version09010026
      *                                                                 09020000
           Call  'F115ICAU'              Using R115ICAS-SQL-Submodules  09030000
                                               DCLTF-Contract-Amount    09040000
                                               R7919999-Error-Area      09050005
           End-Call                                                     09060000
      *                                                                 09070000
           Evaluate True                                                09080000
             When R7919999-Return-OK                                    09090005
               Continue                                                 09100000
      *                                                                 09110000
             When R7919999-Return-Error                                 09120005
               Continue                                                 09130000
      *                                                                 09140000
             When other                                                 09150000
               Move  'H201'              To    R7919999-Paragraph       09160005
               Perform Z900-Abend                                       09170000
      *                                                                 09180000
           End-Evaluate                                                 09190000
      *                                                                 09200000
           .                                                            09210000
      *################################################################.09220000
       I000-Delete                       Section.                       09230000
      *                                                                 09240000
           Perform F100-Prepare-Qualification                           09250000
           Perform I200-Delete-Row                                      09260000
      *                                                                 09270000
           Perform L300-Remove-DCL                                      09280000
      *                                                                 09290000
           .                                                            09300000
      *################################################################.09310000
       I200-Delete-Row                   Section.                       09320000
      *                                                                 09330000
           Initialize                          R115ICAS-SQL-Submodules  09340000
           Set   R115ICAS-Version        To    True                     09350000
           Set   R115ICAS-In-Delete      To    True                     09360000
           Move  R115ICA0-In-Table-Version                              09370026
                                         To    R115ICAS-In-Table-Version09380026
      *                                                                 09390000
           Call  'F115ICAU'              Using R115ICAS-SQL-Submodules  09400000
                                               DCLTF-Contract-Amount    09410000
                                               R7919999-Error-Area      09420005
           End-Call                                                     09430000
      *                                                                 09440000
           Evaluate True                                                09450000
             When R7919999-Return-OK                                    09460005
               Continue                                                 09470000
      *                                                                 09480000
             When R7919999-Return-Error                                 09490005
               Continue                                                 09500000
      *                                                                 09510000
             When other                                                 09520000
               Move  'I201'              To    R7919999-Paragraph       09530005
               Perform Z900-Abend                                       09540000
      *                                                                 09550000
           End-Evaluate                                                 09560000
      *                                                                 09570000
           .                                                            09580000
      *################################################################.09590000
       J000-Get-Columns                  Section.                       09600000
      *                                                                 09610000
           Perform J100-Move-DCL-To-Output                              09620000
      *                                                                 09630000
           .                                                            09640000
      *################################################################.09650000
       J100-Move-DCL-To-Output           Section.                       09660000
      *                                                                 09670000
      * PLEASE REMEMBER:                                                09680023
      *    When you modify the code in this section, you need to do     09690023
      *    the same modifications in module F115ACA0 - E500-section.    09700023
      *                                                                 09710023
           Move  FK-OAKO-FinInst-ID      To    R115ICA0-Fin-Inst-ID     09720000
           Move  FK-TFMC-Contr-Type      To    R115ICA0-Contract-Type   09730000
           Move  FK-TFMC-Contr-No        To    R115ICA0-Contract-No     09740000
      *                                                                 09750000
           Move  FK-OAKO-FinInst-ID      To    W-Fin-Inst-ID            09760000
           Perform N200-Fetch-Fin-Inst-No                               09770000
           Move  W-Fin-Inst-No           To    R115ICA0-Fin-Inst-No     09780000
      *                                                                 09790000
           Move  TFCA-Currency           To    R115ICA0-Currency        09800000
           Move  TFCA-Orig-Amount        To    R115ICA0-Original-Amount 09810006
           Move  TFCA-Remain-Amount      To    R115ICA0-Remaining-Amount09820006
           Move  TFCA-Min-Pct-Toler      To  R115ICA0-Min-Pct-Tolerance 09830005
           Move  TFCA-Max-Pct-Toler      To  R115ICA0-Max-Pct-Tolerance 09840005
           Move  TFCA-Prev-O-Amount      To  R115ICA0-Prev-O-Amount     09850030
           Move  TFCA-Curr-O-Amount      To  R115ICA0-Curr-O-Amount     09860030
      *                                                                 09870000
           Compute  R115ICA0-Max-Amount                                 09880005
               =    TFCA-Remain-Amount                                  09890006
               +  ( TFCA-Remain-Amount * TFCA-Max-Pct-Toler / 100 )     09900006
      *                                                                 09910005
      * Info about the cursor:                                          09920000
      *                                                                 09930000
           Move  WC-Row-No               To  R115ICA0-Out-Row-No        09940000
           Move  WC-Total-No-Of-Rows     To  R115ICA0-Out-Total-Rows    09950000
      *                                                                 09960000
           .                                                            09970000
      *################################################################.09980000
       L100-Store-DCL                    Section.                       09990000
      *                                                                 10000000
      * We might already have this row in storage.                      10010017
      *                                                                 10020017
           Perform L200-Find-DCL                                        10030017
      *                                                                 10040017
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         10050017
           or  WS-DB2-Not-Read (Ind-WS)                                 10060017
             Then                                                       10070017
      *        If we have reached the end of the storage-table,         10080017
      *        we start on the beginning.                               10090017
      *        This way, we always keep the "newest" occurrences.       10100017
               Add   +1                  To    Ind-WS-Put               10110017
               If  Ind-WS-Put            >     W-Max-Occ-WS-Tab         10120017
                   Move  +1              To    Ind-WS-Put               10130017
               End-If                                                   10140017
               Move  Ind-WS-Put          To    Ind-WS                   10150017
             Else                                                       10160017
               Move  Ind-WS              To    Ind-WS-Put               10170017
           End-If                                                       10180017
      *                                                                 10190017
      * We store the identification.                                    10200000
      *                                                                 10210000
           Move  R115ICA0-In-Table-Version                              10220026
                                         To    WS-DB2-Tbl-Version       10230026
                                                            (Ind-WS-Put)10240000
           Move  FK-OAKO-FinInst-ID      To    WS-DB2-Fin-Inst-ID       10250026
                                                            (Ind-WS-Put)10260026
           Move  FK-TFMC-Contr-Type      To    WS-DB2-Contract-Type     10270000
                                                            (Ind-WS-Put)10280000
           Move  FK-TFMC-Contr-No        To    WS-DB2-Contract-No       10290000
                                                            (Ind-WS-Put)10300000
           Move  TFCA-Currency           To    WS-DB2-Currency          10310000
                                                            (Ind-WS-Put)10320000
      *                                                                 10330000
      * The DCL is stored if found, the status is set.                  10340000
      *                                                                 10350000
           Evaluate True                                                10360000
             When Length                 Of    DCLTF-Contract-Amount    10370000
                > Length                 Of    WS-DB2-DCL               10380000
               Move  Length              Of    DCLTF-Contract-Amount    10390000
                                         To    WD-Length                10400000
               Initialize                      R7918030-ErrorMessage    10410005
               Move  'GL-WL-DCL-UTVIDES' To    R7918030-In-MessageCode  10420005
               Move  'VAR1'              To R7918030-In-Variable-Key (1)10430005
               Move  WD-Length           To R7918030-In-Variable-Data(1)10440005
               Perform Z000-Error-Message                               10450000
               Move  'L101'              To    R7919999-Paragraph       10460005
               Perform Z900-Abend                                       10470000
      *                                                                 10480000
             When R7919999-Return-Error                                 10490005
               Set   WS-DB2-Not-Found (Ind-WS-Put)                      10500000
                                         To    True                     10510000
      *                                                                 10520000
             When other                                                 10530000
               Move  DCLTF-Contract-Amount                              10540000
                                         To    WS-DB2-DCL   (Ind-WS-Put)10550000
               Set   WS-DB2-Read (Ind-WS-Put)                           10560000
                                         To    True                     10570000
      *                                                                 10580000
           End-Evaluate                                                 10590000
      *                                                                 10600000
           .                                                            10610000
      *################################################################.10620000
       L200-Find-DCL                     Section.                       10630000
      *                                                                 10640000
           Perform Varying Ind-WS                                       10650000
                   From  +1              By    +1                       10660000
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         10670000
                   or  ( WS-DB2-Tbl-Version (Ind-WS)                    10680026
                                         =     R115ICA0-In-Table-Version10690026
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    10700026
                                         =     FK-OAKO-FinInst-ID       10710026
                     and WS-DB2-Contract-Type (Ind-WS)                  10720000
                                         =     FK-TFMC-Contr-Type       10730000
                     and WS-DB2-Contract-No (Ind-WS)                    10740000
                                         =     FK-TFMC-Contr-No         10750000
                     and WS-DB2-Currency (Ind-WS)                       10760000
                                         =     TFCA-Currency )          10770018
           End-Perform                                                  10780000
      *                                                                 10790000
           .                                                            10800000
      *################################################################*10810000
       L300-Remove-DCL                   Section.                       10820000
      *                                                                 10830000
           Perform Varying Ind-WS                                       10840000
                   From  +1              By    +1                       10850000
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         10860000
                   or  ( WS-DB2-Tbl-Version (Ind-WS)                    10870026
                                         =     R115ICA0-In-Table-Version10880026
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    10890026
                                         =     FK-OAKO-FinInst-ID       10900000
                     and WS-DB2-Contract-Type (Ind-WS)                  10910000
                                         =     FK-TFMC-Contr-Type       10920000
                     and WS-DB2-Contract-No (Ind-WS)                    10930000
                                         =     FK-TFMC-Contr-No         10940000
                     and WS-DB2-Currency (Ind-WS)                       10950000
                                         =     TFCA-Currency )          10960018
           End-Perform                                                  10970000
      *                                                                 10980000
           Evaluate True                                                10990000
             When Ind-WS                 >     W-Max-Occ-WS-Tab         11000000
               Continue                                                 11010000
      *                                                                 11020000
             When other                                                 11030000
               Initialize                      WS-DB2-Row (Ind-WS)      11040000
      *                                                                 11050000
           End-Evaluate                                                 11060000
      *                                                                 11070000
           .                                                            11080000
      *################################################################*11090000
       N100-Fetch-Fin-Inst-ID            Section.                       11100000
      *                                                                 11110000
           Move  W-Fin-Inst-No (1:4)     To    W-Tmp-Konsern-Nr         11120008
      *                                                                 11130008
           If  Not R5879010-Versjon                                     11140000
           or  R5879010-In-Konsernnr     Not = W-Tmp-Konsern-Nr         11150008
      *                                                                 11160000
               Initialize                      R5879010-Konsern         11170000
               Set   R5879010-Versjon    To    True                     11180000
               Set   R5879010-In-Select  To    True                     11190000
               Move  W-Tmp-Konsern-Nr    To    R5879010-In-Konsernnr    11200008
               Call  'F5879010'          Using R5879010-Konsern         11210000
                                               R7919999-Error-Area      11220005
               End-Call                                                 11230000
               If  Not R7919999-Return-OK                               11240005
                   Move  'N101'          To    R7919999-Paragraph       11250005
                   Perform Z900-Abend                                   11260000
               End-If                                                   11270000
      *                                                                 11280000
           End-If                                                       11290000
      *                                                                 11300000
           Move  R5879010-Ut-KO-Konsern-Id                              11310000
                                         To    W-Fin-Inst-ID            11320000
      *                                                                 11330000
           .                                                            11340000
      *################################################################*11350000
       N200-Fetch-Fin-Inst-No            Section.                       11360000
      *                                                                 11370000
           If  Not R5879010-Versjon                                     11380000
           or  R5879010-In-Konsern-ID    Not = W-Fin-Inst-ID            11390000
      *                                                                 11400000
               Initialize                      R5879010-Konsern         11410000
               Set   R5879010-Versjon    To    True                     11420000
               Set   R5879010-In-Select  To    True                     11430000
               Move  W-Fin-Inst-ID       To    R5879010-In-Konsern-ID   11440000
               Call  'F5879010'          Using R5879010-Konsern         11450000
                                               R7919999-Error-Area      11460005
               End-Call                                                 11470000
               If  Not R7919999-Return-OK                               11480005
                   Move  'N201'          To    R7919999-Paragraph       11490005
                   Perform Z900-Abend                                   11500000
               End-If                                                   11510000
      *                                                                 11520000
           End-If                                                       11530000
      *                                                                 11540000
           Move  R5879010-Ut-KO-Konsernnummer                           11550000
                                         To    W-Tmp-Konsern-Nr         11560008
           Move  W-Tmp-Konsern-Nr        To    W-Fin-Inst-No            11570008
      *                                                                 11580000
           .                                                            11590000
      *################################################################*11600000
       ZI00-Conv-Input-Version           Section.                       11610015
      *                                                                 11620000
      * Version control.                                                11630000
      * If conversion is needed, we call the conversion module.         11640000
      *                                                                 11650000
           Set   R115ICA0-Version        To    True                     11660000
           Move  Length                  Of    R115ICA0-Contract-Amount 11670000
                                         To    W-IO-Length              11680000
      *                                                                 11690000
           Evaluate True                                                11700000
             When L-Ext-IO-Area (1:8)    =     R115ICA0-Version-No      11710000
             and  Length                 Of    L-Ext-IO-Area            11720000
                                         Not < W-IO-Length              11730000
               Move  L-Ext-IO-Area (1:W-IO-Length)                      11740000
                                         To    W-Int-IO-Area            11750000
      *                                                                 11760000
             When Other                                                 11770000
               Call  'F115I999'                                         11780000
                   Using By Content      'F115ICA0 '                    11790000
                                         'INPUT '                       11800000
                         By Reference    L-Ext-IO-Area                  11810000
                                         W-Int-IO-Area                  11820000
                                         R7919999-Error-Area            11830005
               End-Call                                                 11840000
      *                                                                 11850000
               If  R7919999-Return-Abend                                11860005
                   Move  'ZI03'          To    R7919999-Paragraph       11870005
                   Perform Z900-Abend                                   11880000
               End-If                                                   11890000
      *                                                                 11900000
           End-Evaluate                                                 11910000
      *                                                                 11920000
           .                                                            11930000
      *################################################################*11940000
       ZO00-Conv-Output-Version          Section.                       11950015
      *                                                                 11960000
      * Version control.                                                11970000
      * If conversion is needed, we call the conversion module.         11980000
      *                                                                 11990000
           Evaluate True                                                12000000
             When L-Ext-IO-Area (1:8)    =     R115ICA0-Version-No      12010000
             and  Length                 Of    L-Ext-IO-Area            12020000
                                         Not < W-IO-Length              12030000
               Move  W-Int-IO-Area       To    L-Ext-IO-Area            12040000
                                                         (1:W-IO-Length)12050000
      *                                                                 12060000
             When Other                                                 12070000
               Call  'F115I999'                                         12080000
                   Using By Content      'F115ICA0 '                    12090000
                                         'OUTPUT '                      12100000
                         By Reference    L-Ext-IO-Area                  12110000
                                         W-Int-IO-Area                  12120000
                                         R7919999-Error-Area            12130005
               End-Call                                                 12140000
      *                                                                 12150000
               If  R7919999-Return-Abend                                12160005
                   Move  'ZO01'          To    R7919999-Paragraph       12170005
                   Perform Z900-Abend                                   12180000
               End-If                                                   12190000
      *                                                                 12200000
           End-Evaluate                                                 12210000
      *                                                                 12220000
           .                                                            12230000
      *################################################################*12240000
       Z000-Error-Message                Section.                       12250000
      *                                                                 12260000
           Set   R7918030-Version        To    True                     12270005
      *                                                                 12280000
           Move  'TF'                    To    R7918030-In-System-ID    12290005
           Move  R115X000-Fin-Inst-No    To    R7918030-In-Fin-Inst-No  12300007
           Move  R115X000-FI-Language-639-1                             12310007
                                         To    R7918030-In-Language     12320007
           If  R115X000-Trace-On                                        12330009
               Set   R7918030-In-Log-Yes To    True                     12340009
           End-If                                                       12350009
      *                                                                 12360000
           Call  'F7918030'              Using R7918030-ErrorMessage    12370005
           End-Call                                                     12380000
      *                                                                 12390000
           Move  R7918030-Out-MessageText                               12400005
                                         To    R7919999-Message         12410005
      *                                                                 12420000
           .                                                            12430000
      *################################################################*12440000
       Z900-Abend                        Section.                       12450000
      *                                                                 12460000
           If  R7919999-Return-Code      Not   Numeric                  12470005
           or  Not R7919999-Return-Abend                                12480005
               Move  +0                  To    R7919999-Module-Ind      12490005
           End-If                                                       12500000
      *                                                                 12510000
           Add   +1                      To    R7919999-Module-Ind      12520005
      *                                                                 12530000
           If  R7919999-Module-Ind       Not >                          12540005
                             ( Length    Of    R7919999-Module-Tab      12550005
                             / Length    Of    R7919999-Module-Element )12560005
               Move  'F115ICA0'          To    R7919999-Module-Name     12570005
                                                   (R7919999-Module-Ind)12580005
               Move  R7919999-Paragraph  To    R7919999-Module-Para     12590005
                                                   (R7919999-Module-Ind)12600005
           End-If                                                       12610000
      *                                                                 12620000
           Set   R7919999-Return-Abend   To    TRUE                     12630005
      *                                                                 12640000
           Goback.                                                      12650000
