       Identification Division.                                         00010000
       Program-ID. F115IPA0.                                            00020000
       Author.  Henning Langfeldt Rødland.                              00030000
      *################################################################*00040000
      *                                                                 00050000
      * FD Trade Finance                                                00060000
      *                                                                 00070000
      * Interface for all database access on table TF_Part_Amount.      00080000
      *                                                                 00090000
      * The interface kan read one spesific occurence,                  00100000
      * or several occurences, fully or partly qualified with           00110000
      * from- and to- values.                                           00120000
      *                                                                 00130000
      * When reading several occurences, one must always start with     00140000
      * -In-Get-1st, and continue with -In-Get-Next.                    00150000
      *                                                                 00160000
      * NB!  There are several key-fields, which may be used            00170000
      *      differently depending on the need.                         00180000
      *      See seperate description below.                            00190000
      *                                                                 00200000
      *                                                                 00210000
      * An ordinary Select call may look like this:                     00220000
      *                                                                 00230000
      *    Initialize                          R115IPA0-Part-Amount     00240000
      *    Set   R115IPA0-Version        To    True                     00250000
      *    Set   R115IPA0-In-Select      To    True                     00260000
      *                                                                 00270000
      * One of these:                                                   00280010
      * 1) Set   R115IPA0-In-Actual      To    True                     00290010
      * 2) Set   R115IPA0-In-Work        To    True                     00300010
      *                                                                 00310010
      * One of these:                                                   00320000
      * 1) Move  &fin-inst-id            To    R115IPA0-In-Fin-Inst-ID  00330000
      * 2) Move  &fin-inst-no            To    R115IPA0-In-Fin-Inst-No  00340000
      *                                                                 00350000
      *    Move  &contract-type          To    R115IPA0-In-Contract-Type00360000
      *    Move  &contract-no            To    R115IPA0-In-Contract-No  00370000
      *    Move  &currency (ISO 4217)    To    R115IPA0-In-CA-Currency  00380000
      *    Move  &part-amount seq.no     To    R115IPA0-In-PA-Seq-No    00390000
      *                                                                 00400000
      *    Call  'F115IPA0'              Using R115IPA0-Part-Amount     00410000
      *                                        R7919999-Error-Area      00420000
      *    End-Call                                                     00430000
      *                                                                 00440000
      *    Evaluate True                                                00450000
      *      When R7919999-Return-Abend                                 00460000
      *        Move  '&&&&'              To    R7919999-Paragraph       00470000
      *        Perform Z900-Abend                                       00480000
      *                                                                 00490000
      *      When R7919999-Return-Error                                 00500000
      *        ...not found...                                          00510000
      *                                                                 00520000
      *      When R7919999-Return-OK                                    00530000
      *        ...found...                                              00540000
      *                                                                 00550000
      *    End-Evaluate                                                 00560000
      *                                                                 00570000
      *################################################################*00580000
      * Date ! Si! Change description                            ! 3A ! 00590000
      *------+---+-----------------------------------------------+----+ 00600000
      *111006!NDL! Added -IPA0-In-Upd-Status                     !LO18! 00601023
      *170602!NDL! Added -Availability                           !LV07! 00601123
      *230401!NDL! Added -Incom-Swift                            !LT12! 00602022
      *190600!HLR! Removed cursors CT, CT-CN, CT-CN-PA.          !LO18! 00610019
      *      !   ! Removed -In-To-Contr-No.                      !    ! 00620018
      *      !   ! Removed -In-From-Contr-No (kept as redef.).   !    ! 00630018
      *050599!HLR! New module                                    !LG10! 00640000
      *################################################################*00650000
       Environment Division.                                            00660000
       Configuration Section.                                           00670000
       Special-Names.                                                   00680000
           Decimal-Point Is Comma.                                      00690000
      *                                                                 00700000
      *################################################################*00710000
       Data Division.                                                   00720000
       Working-Storage Section.                                         00730000
      *                                                                 00740000
       01  Filler.                                                      00750000
      *                                                                 00760000
           05  W-Table-Name              Pic  X(18) Value               00770000
                                                   'TF_Part_Amount    '.00780000
             88  SW-Table-Actual             Value 'TF_Part_Amount    '.00790013
             88  SW-Table-Work               Value 'TF_Work_PA        '.00800013
      *                                                                 00810000
           05  W-IO-Length               Pic S9(04)              Comp.  00820000
           05  W-Tally                   Pic S9(05)              Comp.  00830006
      *                                                                 00840000
           05  WD-Length                 Pic  Z.ZZ9.                    00850000
      *                                                                 00860000
           05  Ind-WS-Put                Pic S9(04)              Comp.  00870000
           05  Ind-WS                    Pic S9(04)              Comp.  00880000
           05  W-Max-Occ-WS-Tab          Pic S9(04)              Comp.  00890000
      *                                                                 00900000
           05  Filler.                                                  00910000
               10  WD-Fin-Inst-ID        Pic  zzzzzzzzzzzzzzzzz9.       00920000
               10  WD-Contract-No        Pic  9999999.                  00930000
               10  WD-PA-Seq-No          Pic  zzz9.                     00940000
      *                                                                 00950000
           05  Filler.                                                  00960000
               10  W-Fin-Inst-No         Pic  X(18).                    00970000
               10  W-Fin-Inst-ID         Pic S9(18)              Comp-3.00980000
      *                                                                 00990000
           05  W-Input-Action            Pic  X(10).                    01000000
             88  SW-IA-Initialize                   Value 'INITIALIZE'. 01010000
      *                                                                 01020000
      *    This field is needed because of the old interfaces used to   01030000
      *    access Fin-Inst-ID and Customer ID.                          01040000
           05  W-Tmp-Konsern-Nr          Pic  9(04).                    01050000
      *                                                                 01060000
      *----------------------------------------------------------------*01070000
      * Counters, used on cursor read, to return row no. and total      01080000
      * no. of rows.                                                    01090000
      * Total no. of rows is only returned when -In-Count is set on     01100000
      * the Get-1st-call.                                               01110000
      *                                                                 01120000
           05  WC-Counters.                                             01130000
               10  WC-Row-No             Pic S9(11)              Comp-3.01140000
               10  WC-Total-No-Of-Rows   Pic S9(11)              Comp-3.01150000
      *                                                                 01160000
      *----------------------------------------------------------------*01170000
      * Switches used for selecting the correct cursor:                 01180000
      *                                                                 01190000
           05  SW-Cursor-Code.                                          01200000
               10  SW-CC-Fin-Inst        Pic  X(01).                    01210000
                 88  SW-Use-Fin-Inst                Value 'F'.          01220000
               10  SW-CC-Contract-Type   Pic  X(01).                    01230000
                 88  SW-Use-Contract-Type           Value 'T'.          01240000
               10  SW-CC-Contract-No     Pic  X(01).                    01250000
                 88  SW-Use-Contract-No             Value 'N'.          01260000
               10  SW-CC-Part-Amount     Pic  X(01).                    01270000
                 88  SW-Use-Part-Amount             Value 'P'.          01280000
               10  SW-CC-Status          Pic  X(01).                    01290015
                 88  SW-Use-Status                  Value 'S'.          01300015
      *                                                                 01310000
           05  Filler                    Redefines SW-Cursor-Code       01320000
                                         Pic  X(05).                    01330015
             88  SW-Use-Fi-Asc                      Value 'F    '.      01340015
             88  SW-Use-Fi-CT-Asc                   Value 'FT   '.      01350015
             88  SW-Use-Fi-CT-CN-Asc                Value 'FTN  '.      01360015
             88  SW-Use-Fi-CT-CN-PA-Asc             Value 'FTNP '.      01370015
             88  SW-Use-Fi-St-Asc                   Value 'F   S'.      01380015
             88  SW-Use-Fi-CT-St-Asc                Value 'FT  S'.      01390015
      *                                                                 01400000
      *----------------------------------------------------------------*01410000
      * These fields are used for SQL qualification:                    01420000
      *                                                                 01430000
           05  W-DB-Key.                                                01440000
               10  W-DB-Fin-Inst-ID      Pic S9(18)              Comp-3.01450000
               10  W-DB-Contract-Type    Pic  X(03).                    01460000
               10  W-DB-Contract-No      Pic S9(07)              Comp-3.01470018
               10  W-DB-CA-Currency      Pic  X(03).                    01480000
               10  W-DB-From-PA-Seq-No   Pic S9(04)              Comp.  01490000
               10  W-DB-To-PA-Seq-No     Pic S9(04)              Comp.  01500000
               10  W-DB-Status           Pic  X(12).                    01510015
      *                                                                 01520000
      *----------------------------------------------------------------*01530000
      * These fields are used for comparison with the WS-fields.        01540000
      *                                                                 01550000
           05  WE-Cursor-Info.                                          01560000
             07  WE-Key.                                                01570000
               10  WE-Fin-Inst-ID        Pic S9(18)              Comp-3.01580000
               10  WE-Fin-Inst-No        Pic  X(18).                    01590000
               10  WE-Contract-Type      Pic  X(03).                    01600000
               10  WE-Contract-No        Pic S9(07)              Comp-3.01610018
               10  WE-CA-Currency        Pic  X(03).                    01620000
               10  WE-From-PA-Seq-No     Pic S9(04)              Comp.  01630000
               10  WE-To-PA-Seq-No       Pic S9(04)              Comp.  01640000
               10  WE-Status             Pic  X(12).                    01650015
             07  WE-Code-Sequence        Pic  X(01).                    01660000
               88  WE-CS-Ascending                  Value 'A'.          01670000
               88  WE-CS-Descending                 Value 'D'.          01680000
      *                                                                 01690000
      *----------------------------------------------------------------*01700000
      * Storage, and switches for identifying the content:              01710000
      * The cursor info is used to verify that the get-next has the     01720000
      * same qualification as the get-1st.                              01730000
      *                                                                 01740000
       01  W-Storage.                                                   01750000
      *                                                                 01760000
           05  WS-Cursor-Info.                                          01770000
             07  WS-Key.                                                01780000
               10  WS-Fin-Inst-ID        Pic S9(18)              Comp-3.01790000
               10  WS-Fin-Inst-No        Pic  X(18).                    01800000
               10  WS-Contract-Type      Pic  X(03).                    01810000
               10  WS-Contract-No        Pic S9(07)              Comp-3.01820018
               10  WS-CA-Currency        Pic  X(03).                    01830000
               10  WS-From-PA-Seq-No     Pic S9(04)              Comp.  01840000
               10  WS-To-PA-Seq-No       Pic S9(04)              Comp.  01850000
               10  WS-Status             Pic  X(12).                    01860015
             07  WS-Code-Sequence        Pic  X(01).                    01870000
               88  WS-CS-Ascending                  Value 'A'.          01880000
               88  WS-CS-Descending                 Value 'D'.          01890000
             07  WS-Cursor-Status        Pic  X(08).                    01900000
               88  WS-Cursor-OK                     Value 'OK'.         01910000
               88  WS-Cursor-End                    Value 'END'.        01920000
      *                                                                 01930000
      * We store all occurences that are read, also those that we do    01940000
      * not find. This is to reduce the number of DB2 accesses.         01950000
      *                                                                 01960000
           05  WS-DB2-Table.                                            01970000
             07  WS-DB2-Row              Occurs 10 Times.               01980000
               10  WS-DB2-Tbl-Version    Pic  X(16).                    01990011
               10  WS-DB2-Fin-Inst-ID    Pic S9(18)              Comp-3.02000000
               10  WS-DB2-Contract-Type  Pic  X(03).                    02010000
               10  WS-DB2-Contract-No    Pic S9(07)              Comp-3.02020000
               10  WS-DB2-CA-Currency    Pic  X(03).                    02030000
               10  WS-DB2-PA-Seq-No      Pic S9(04)              Comp.  02040000
               10  WS-DB2-Row-Status     Pic S9(01)              Comp-3.02050000
                 88  WS-DB2-Not-Read                Value +0.           02060000
                 88  WS-DB2-Read                    Value +1.           02070000
                 88  WS-DB2-Not-Found               Value +2.           02080000
               10  WS-DB2-DCL            Pic  X(250).                   02090000
      *                                                                 02100000
      *----------------------------------------------------------------*02110000
      * Areas for use when accessing DB2.                               02120000
      *                                                                 02130000
           Exec SQL Include R115TFPA End-Exec.                          02140000
      *                                                                 02150000
      *----------------------------------------------------------------*02160000
      * Internal area:                                                  02170000
      *                                                                 02180000
       01  W-Int-IO-Area.                                               02190000
           Copy R115IPA0.                                               02200000
      *                                                                 02210000
      *----------------------------------------------------------------*02220000
      * Assorted copy-areas:                                            02230000
      *                                                                 02240000
       01  Filler.                                                      02250000
           Copy R115IPAS.                                               02260000
      *                                                                 02270000
       01  Filler.                                                      02280000
           Copy R1781910.                                               02290000
      *                                                                 02300000
       01  Filler.                                                      02310000
           Copy R5879010.                                               02320000
      *                                                                 02330000
       01  Filler.                                                      02340000
           Copy R7918030.                                               02350000
      *                                                                 02360000
       Copy R7919100.                                                   02370001
       Copy R115X000.                                                   02380000
      *                                                                 02390000
      *################################################################.02400000
       Linkage Section.                                                 02410000
      *                                                                 02420000
       01  L-Ext-IO-Area                 Pic  X(560).                   02430000
       Copy R7919999.                                                   02440000
      *                                                                 02450000
      *################################################################.02460000
       Procedure Division                Using L-Ext-IO-Area            02470000
                                               R7919999-Error-Area.     02480000
      *                                                                 02490000
       A000-Main                         Section.                       02500000
      *                                                                 02510000
           Perform B000-Initialize                                      02520000
      *                                                                 02530000
           Evaluate True                                                02540000
             When SW-IA-Initialize                                      02550000
               Continue                                                 02560000
      *                                                                 02570000
             When Other                                                 02580000
               Perform ZI00-Conv-Input-Version                          02590000
               Perform C000-Interface                                   02600000
               Perform ZO00-Conv-Output-Version                         02610000
      *                                                                 02620000
           End-Evaluate                                                 02630000
      *                                                                 02640000
           Goback.                                                      02650000
      *################################################################*02660000
       B000-Initialize                   Section.                       02670000
      *                                                                 02680000
           Set   R7919999-Return-OK      To    True                     02690000
      *                                                                 02700000
           Evaluate True                                                02710000
             When L-Ext-IO-Area (1:10)   =     'INITIALIZE'             02720000
               Set   Sw-IA-Initialize    To    True                     02730000
             When Other                                                 02740000
               Move  Space               To    W-Input-Action           02750000
           End-Evaluate                                                 02760000
      *                                                                 02770000
           Compute  W-Max-Occ-WS-Tab                                    02780000
               =    Length               Of    WS-DB2-Table             02790000
               /    Length               Of    WS-DB2-Row               02800000
      *                                                                 02810000
           If  Sw-IA-Initialize                                         02820000
           or  WS-DB2-Row-Status (1)     Not   Numeric                  02830000
               Initialize                      W-Storage                02840000
               Move  +0                  To    Ind-WS-Put               02850000
           End-If                                                       02860000
      *                                                                 02870000
           If  WC-Row-No                 Not   Numeric                  02880000
           or  WC-Total-No-Of-Rows       Not   Numeric                  02890000
               Initialize                      WC-Counters              02900000
           End-If                                                       02910000
      *                                                                 02920000
           Evaluate True                                                02930000
             When Not R115X000-Is-Initiated                             02940000
               Initialize                      R115X000-External-Data   02950000
             When Not R115X000-Version                                  02960000
               Initialize                      R7918030-ErrorMessage    02970000
               Move  'GL-VERSION-INVALID'                               02980000
                                         To    R7918030-In-MessageCode  02990000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03000000
               Move  R115X000-Version-No To R7918030-In-Variable-Data(1)03010000
               Move  'VAR2'              To R7918030-In-Variable-Key (2)03020000
               Move  'R115X000'          To R7918030-In-Variable-Data(2)03030000
               Perform Z000-Error-Message                               03040000
               Move  'B001'              To    R7919999-Paragraph       03050000
               Perform Z900-Abend                                       03060000
           End-Evaluate                                                 03070000
      *                                                                 03080000
           .                                                            03090000
      *################################################################.03100000
       C000-Interface                    Section.                       03110000
      *                                                                 03120000
           Perform C100-Verify                                          03130011
      *                                                                 03140011
           Evaluate True                                                03150000
             When R115IPA0-In-Get-1st                                   03160000
               Perform C200-Initialize-Output                           03170011
               Perform D000-Get-1st                                     03180000
               Perform E000-Get-Next                                    03190000
      *                                                                 03200000
             When R115IPA0-In-Get-Next                                  03210000
               Perform C200-Initialize-Output                           03220011
               Perform E000-Get-Next                                    03230000
      *                                                                 03240000
             When R115IPA0-In-Select                                    03250000
               Perform C200-Initialize-Output                           03260011
               Perform F000-Select                                      03270000
      *                                                                 03280000
             When R115IPA0-In-Insert                                    03290000
               Perform G000-Insert                                      03300000
      *                                                                 03310000
             When R115IPA0-In-Update                                    03320000
               Perform H000-Update                                      03330000
      *                                                                 03331023
             When R115IPA0-In-Upd-Status                                03332023
               Perform H050-Upd-Status                                  03333023
      *                                                                 03340000
             When R115IPA0-In-Delete                                    03350000
               Perform I000-Delete                                      03360000
      *                                                                 03370000
             When Other                                                 03380000
               Initialize                      R7918030-ErrorMessage    03390000
               Move  'GL-IN-AKSJON-UV'   To    R7918030-In-MessageCode  03400000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03410000
               Move  R115IPA0-In-Action  To R7918030-In-Variable-Data(1)03420000
               Perform Z000-Error-Message                               03430000
               Move  'C001'              To    R7919999-Paragraph       03440000
               Perform Z900-Abend                                       03450000
      *                                                                 03460000
           End-Evaluate                                                 03470000
      *                                                                 03480000
           .                                                            03490000
      *################################################################.03500011
       C100-Verify                       Section.                       03510011
      *                                                                 03520011
           Evaluate True                                                03530013
             When R115IPA0-In-Actual                                    03540013
               Set   SW-Table-Actual     To    True                     03550013
      *                                                                 03560013
             When R115IPA0-In-Work                                      03570013
               Set   SW-Table-Work       To    True                     03580013
      *                                                                 03590013
             When other                                                 03600013
               Initialize                      R7918030-ErrorMessage    03610011
               Move  'GL-IN-TABLE-VERSION-UV'                           03620011
                                         To    R7918030-In-MessageCode  03630011
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03640011
               Move  R115IPA0-In-Table-Version                          03650012
                                         To R7918030-In-Variable-Data(1)03660011
               Perform Z000-Error-Message                               03670011
               Move  'C101'              To    R7919999-Paragraph       03680011
               Perform Z900-Abend                                       03690011
      *                                                                 03700011
           End-Evaluate                                                 03710013
      *                                                                 03720011
           .                                                            03730011
      *################################################################.03740000
       C200-Initialize-Output            Section.                       03750011
      *                                                                 03760000
           Initialize                          R115IPA0-Data            03770000
      *                                                                 03780000
           .                                                            03790000
      *################################################################.03800000
       D000-Get-1st                      Section.                       03810000
      *                                                                 03820000
           Perform D100-Prepare-Input                                   03830000
           Perform D200-Prepare-Qualification                           03840000
           Perform D300-Select-Cursor                                   03850000
           If  R115IPA0-In-CC-Count                                     03860000
               Perform D400-Count-Cursor                                03870000
           End-If                                                       03880000
           Perform D500-Open-Cursor                                     03890000
      *                                                                 03900000
           .                                                            03910000
      *################################################################.03920000
       D100-Prepare-Input                Section.                       03930000
      *                                                                 03940000
      * We create internal from- and to-values, depending on the input. 03950000
      *                                                                 03960000
           Initialize                          WE-Cursor-Info           03970000
      *                                                                 03980000
           Move  R115IPA0-In-Fin-Inst-ID To    WE-Fin-Inst-ID           03990000
           Move  R115IPA0-In-Fin-Inst-No To    WE-Fin-Inst-No           04000000
      *                                                                 04010000
           Move  R115IPA0-In-Contract-Type                              04020000
                                         To    WE-Contract-Type         04030000
           Move  +0                      To    W-Tally                  04040006
           Inspect WE-Contract-Type     Tallying W-Tally for all '*' '%'04050006
           If  W-Tally                   >     +0                       04060006
               Inspect WE-Contract-Type  Converting '* ' to '%%'        04070006
           End-If                                                       04080006
      *                                                                 04090000
           Move  R115IPA0-In-Contract-No To    WE-Contract-No           04100018
      *                                                                 04110000
           Move  R115IPA0-In-CA-Currency To    WE-CA-Currency           04120007
           Move  +0                      To    W-Tally                  04130007
           Inspect WE-CA-Currency       Tallying W-Tally for all '*' '%'04140007
           If  W-Tally                   >     +0                       04150007
               Inspect WE-CA-Currency    Converting '* ' to '%%'        04160007
           End-If                                                       04170007
      *                                                                 04180007
           Evaluate True                                                04190000
             When R115IPA0-In-PA-Seq-No  =     +0                       04200000
               Move  +0001               To    WE-From-PA-Seq-No        04210000
               Move  +9999               To    WE-To-PA-Seq-No          04220000
                                                                        04230000
             When other                                                 04240000
               Move  R115IPA0-In-PA-Seq-No                              04250000
                                         To    WE-From-PA-Seq-No        04260000
               Move  R115IPA0-In-PA-Seq-No                              04270000
                                         To    WE-To-PA-Seq-No          04280000
                                                                        04290000
           End-Evaluate                                                 04300000
      *                                                                 04310000
           Move  R115IPA0-In-Status      To    WE-Status                04320015
           Move  +0                      To    W-Tally                  04330015
           Inspect WE-Status            Tallying W-Tally for all '*' '%'04340015
           If  W-Tally                   >     +0                       04350015
               Inspect WE-Status         Converting '* ' to '%%'        04360015
           End-If                                                       04370015
      *                                                                 04380015
           .                                                            04390000
      *################################################################.04400000
       D200-Prepare-Qualification        Section.                       04410000
      *                                                                 04420000
      * We store the qualification, so that we can check that the       04430000
      * qualification do not change on any following Get-Next.          04440000
      *                                                                 04450000
           Initialize                          WS-Cursor-Info           04460000
           Move  WE-Key                  To    WS-Key                   04470000
           Move  WE-Code-Sequence        To    WS-Code-Sequence         04480000
      *                                                                 04490000
           Initialize WC-Counters                                       04500000
      *                                                                 04510000
      * We check that we do not have any "negative" intervals.          04520000
      * DB2 is not very fond of those...                                04530000
      *                                                                 04540000
      * We fill in the SQL host variables.                              04550000
      *                                                                 04560000
           Initialize                          W-DB-Key                 04570000
      *                                                                 04580000
           Move  WE-Fin-Inst-ID          To    W-DB-Fin-Inst-ID         04590000
           Move  WE-Contract-Type        To    W-DB-Contract-Type       04600000
      *                                                                 04610000
           Move  WE-Contract-No          To    W-DB-Contract-No         04620018
      *                                                                 04630000
           Move  WE-CA-Currency          To    W-DB-CA-Currency         04640000
           Move  WE-From-PA-Seq-No       To    W-DB-From-PA-Seq-No      04650000
           Move  WE-To-PA-Seq-No         To    W-DB-To-PA-Seq-No        04660000
      *                                                                 04670000
           If  WE-Fin-Inst-No            Not = Space                    04680000
           and W-DB-Fin-Inst-ID          =     +0                       04690000
               Move  WE-Fin-Inst-No      To    W-Fin-Inst-No            04700000
               Perform N100-Fetch-Fin-Inst-ID                           04710000
               Move  W-Fin-Inst-ID       To    W-DB-Fin-Inst-ID         04720000
           End-If                                                       04730000
      *                                                                 04740000
           Move  WE-Status               To    W-DB-Status              04750015
      *                                                                 04760015
           .                                                            04770000
      *################################################################.04780000
       D300-Select-Cursor                Section.                       04790000
      *                                                                 04800000
      * We choose which cursor to use, depending on the qualification.  04810000
      *                                                                 04820000
           Move  Space                   To    SW-Cursor-Code           04830000
      *                                                                 04840000
           If  W-DB-Fin-Inst-ID          Not = +0                       04850000
               Set  Sw-Use-Fin-Inst      To    True                     04860000
           End-If                                                       04870000
      *                                                                 04880000
           If  W-DB-Contract-Type        Not = Space                    04890004
           and W-DB-Contract-Type (1:1)  Not = '%'                      04900004
               Set   SW-Use-Contract-Type                               04910000
                                         To    True                     04920000
           End-If                                                       04930004
      *                                                                 04940000
           If  W-DB-Contract-No          Not = +0                       04950018
               Set   SW-Use-Contract-No  To    True                     04960000
           End-If                                                       04970018
      *                                                                 04980000
           If  R115IPA0-In-CA-Currency   Not = Space                    04990004
           or  R115IPA0-In-PA-Seq-No     Not = +0                       05000004
               Set  Sw-Use-Part-Amount   To    True                     05010000
           End-If                                                       05020000
      *                                                                 05030000
           If  W-DB-Status               Not = Space                    05040015
           and W-DB-Status (1:1)         Not = '%'                      05050015
               Set   SW-Use-Status       To    True                     05060015
           End-If                                                       05070015
      *                                                                 05080015
           Evaluate True                                                05090000
             When SW-Use-Fi-Asc                                         05100000
             or   SW-Use-Fi-CT-Asc                                      05110000
             or   SW-Use-Fi-CT-CN-Asc                                   05120000
             or   SW-Use-Fi-CT-CN-PA-Asc                                05130000
             or   SW-Use-Fi-St-Asc                                      05140015
             or   SW-Use-Fi-CT-St-Asc                                   05150015
               Continue                                                 05160000
      *                                                                 05170000
             When other                                                 05180000
               Initialize                      R7918030-ErrorMessage    05190000
               Move  'GL-CURSOR-UV'      To    R7918030-In-MessageCode  05200000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)05210000
               Move  SW-Cursor-Code      To R7918030-In-Variable-Data(1)05220000
               Perform Z000-Error-Message                               05230000
               Move  'D302'              To    R7919999-Paragraph       05240000
               Perform Z900-Abend                                       05250000
      *                                                                 05260000
           End-Evaluate                                                 05270000
      *                                                                 05280000
           .                                                            05290000
      *################################################################.05300000
       D400-Count-Cursor                 Section.                       05310000
      *                                                                 05320000
           Initialize                          R115IPAS-SQL-Submodules  05330000
           Set   R115IPAS-Version        To    True                     05340000
           Set   R115IPAS-In-Count-Cursor                               05350000
                                         To    True                     05360000
           Move  R115IPA0-In-Table-Version                              05370011
                                         To    R115IPAS-In-Table-Version05380011
           Move  Sw-Cursor-Code          To    R115IPAS-Cursor-Code     05390000
           Move  W-DB-Key                To    R115IPAS-DB-Key          05400000
      *                                                                 05410000
           Call  'F115IPAR'              Using R115IPAS-SQL-Submodules  05420000
                                               DCLTF-Part-Amount        05430000
                                               R7919999-Error-Area      05440000
           End-Call                                                     05450000
      *                                                                 05460000
           Evaluate True                                                05470000
             When R7919999-Return-OK                                    05480000
               Move  R115IPAS-Out-Total-Rows                            05490000
                                         To    WC-Total-No-Of-Rows      05500000
      *                                                                 05510000
             When other                                                 05520000
               Move  'D401'              To    R7919999-Paragraph       05530000
               Perform Z900-Abend                                       05540000
      *                                                                 05550000
           End-Evaluate                                                 05560000
      *                                                                 05570000
           .                                                            05580000
      *################################################################.05590000
       D500-Open-Cursor                  Section.                       05600000
      *                                                                 05610000
           Initialize                          R115IPAS-SQL-Submodules  05620000
           Set   R115IPAS-Version        To    True                     05630000
           Set   R115IPAS-In-Open-Cursor To    True                     05640000
           Move  R115IPA0-In-Table-Version                              05650011
                                         To    R115IPAS-In-Table-Version05660011
           Move  Sw-Cursor-Code          To    R115IPAS-Cursor-Code     05670000
           Move  W-DB-Key                To    R115IPAS-DB-Key          05680000
      *                                                                 05690000
           Call  'F115IPAR'              Using R115IPAS-SQL-Submodules  05700000
                                               DCLTF-Part-Amount        05710000
                                               R7919999-Error-Area      05720000
           End-Call                                                     05730000
      *                                                                 05740000
           Evaluate True                                                05750000
             When R7919999-Return-OK                                    05760000
               Set   WS-Cursor-OK        To    True                     05770000
      *                                                                 05780000
             When other                                                 05790000
               Move  'D501'              To    R7919999-Paragraph       05800000
               Perform Z900-Abend                                       05810000
      *                                                                 05820000
           End-Evaluate                                                 05830000
      *                                                                 05840000
           .                                                            05850000
      *################################################################.05860000
       E000-Get-Next                     Section.                       05870000
      *                                                                 05880000
           Perform D100-Prepare-Input                                   05890000
           Perform E100-Check-Qualification                             05900000
           Perform E200-Fetch-Cursor                                    05910000
      *                                                                 05920000
           If  R7919999-Return-OK                                       05930000
               Perform L100-Store-DCL                                   05940000
               Perform J000-Get-Columns                                 05950000
           End-If                                                       05960000
      *                                                                 05970000
           .                                                            05980000
      *################################################################.05990000
       E100-Check-Qualification          Section.                       06000000
      *                                                                 06010000
      * We use the WE-fields for comparison with the WS-fields.         06020000
      * This to verify that the qualification has not changes since     06030000
      * the Get-1st.                                                    06040000
      *                                                                 06050000
           Evaluate True                                                06060000
             When WE-Key                 =     WS-Key                   06070000
             and  WE-Code-Sequence       =     WS-Code-Sequence         06080000
             and  WS-Cursor-OK                                          06090000
               Continue                                                 06100000
      *                                                                 06110000
             When WE-Key                 =     WS-Key                   06120000
             and  WE-Code-Sequence       =     WS-Code-Sequence         06130000
             and  WS-Cursor-End                                         06140000
               Initialize                      R7918030-ErrorMessage    06150000
               Move  'DB-LEST-SISTE'     To    R7918030-In-MessageCode  06160000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)06170000
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)06180000
               Perform Z000-Error-Message                               06190000
               Move  'E101'              To    R7919999-Paragraph       06200000
               Perform Z900-Abend                                       06210000
      *                                                                 06220000
             When Other                                                 06230000
               Initialize                      R7918030-ErrorMessage    06240000
               Move  'GL-BRUK-GET-1ST'   To    R7918030-In-MessageCode  06250000
               Perform Z000-Error-Message                               06260000
               Move  'E102'              To    R7919999-Paragraph       06270000
               Perform Z900-Abend                                       06280000
      *                                                                 06290000
           End-Evaluate                                                 06300000
      *                                                                 06310000
           .                                                            06320000
      *################################################################.06330000
       E200-Fetch-Cursor                 Section.                       06340000
      *                                                                 06350000
           Initialize                          R115IPAS-SQL-Submodules  06360000
           Set   R115IPAS-Version        To    True                     06370000
           Set   R115IPAS-In-Fetch-Cursor                               06380000
                                         To    True                     06390000
           Move  R115IPA0-In-Table-Version                              06400011
                                         To    R115IPAS-In-Table-Version06410011
           Move  Sw-Cursor-Code          To    R115IPAS-Cursor-Code     06420000
           Move  W-DB-Key                To    R115IPAS-DB-Key          06430000
      *                                                                 06440000
           Call  'F115IPAR'              Using R115IPAS-SQL-Submodules  06450000
                                               DCLTF-Part-Amount        06460000
                                               R7919999-Error-Area      06470000
           End-Call                                                     06480000
      *                                                                 06490000
           Evaluate True                                                06500000
             When R7919999-Return-OK                                    06510000
               Add   +1                  To    WC-Row-No                06520000
      *                                                                 06530000
             When R7919999-Return-Error                                 06540000
               Set   WS-Cursor-End       To    True                     06550000
               If  WC-Row-No             =     +0                       06560000
                 Then                                                   06570000
                   Initialize                  R7918030-ErrorMessage    06580000
                   Move  'DB-FOREKOMST-NF'                              06590000
                                         To    R7918030-In-MessageCode  06600000
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)06610000
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)06620000
                   Perform Z000-Error-Message                           06630000
                 Else                                                   06640000
                   Initialize                  R7918030-ErrorMessage    06650000
                   Move  'DB-LEST-SISTE' To    R7918030-In-MessageCode  06660000
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)06670000
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)06680000
                   Perform Z000-Error-Message                           06690000
               End-If                                                   06700000
      *                                                                 06710000
             When other                                                 06720000
               Move  'E201'              To    R7919999-Paragraph       06730000
               Perform Z900-Abend                                       06740000
      *                                                                 06750000
           End-Evaluate                                                 06760000
      *                                                                 06770000
           .                                                            06780000
      *################################################################.06790000
       F000-Select                       Section.                       06800000
      *                                                                 06810000
           Perform F100-Prepare-Qualification                           06820000
      *                                                                 06830000
      * We will first look through the storage, to see if we have       06840000
      * already got the wanted occurence.                               06850000
      *                                                                 06860000
           Perform L200-Find-DCL                                        06870000
      *                                                                 06880000
      * If we didn't find anything, we need to read. Then we store.     06890000
      *                                                                 06900000
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         06910000
           or  WS-DB2-Not-Read (Ind-WS)                                 06920000
               Perform F200-Select-Row                                  06930000
               Perform L100-Store-DCL                                   06940000
           End-If                                                       06950000
      *                                                                 06960000
      * At last we check what we've got to offer.                       06970000
      *                                                                 06980000
           Evaluate True                                                06990000
             When WS-DB2-Read (Ind-WS)                                  07000000
               Move  WS-DB2-DCL (Ind-WS) To    DCLTF-Part-Amount        07010000
               Perform J000-Get-Columns                                 07020000
      *                                                                 07030000
             When other                                                 07040000
               Initialize                      R7918030-ErrorMessage    07050000
               Move  'DB-FOREKOMST-NF-Q' To    R7918030-In-MessageCode  07060000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)07070000
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)07080000
               Move  'VAR2'              To R7918030-In-Variable-Key (2)07090000
               Move  FK-OAKO-FinInst-ID  To WD-Fin-Inst-ID              07100000
               Move  FK-TFMC-Contr-No    To WD-Contract-No              07110000
               Move  TFPA-Seq-No         To WD-PA-Seq-No                07120000
               String WD-Fin-Inst-ID           Delimited by size        07130000
                      '/'                      Delimited by size        07140000
                      FK-TFMC-Contr-Type       Delimited by space       07150000
                      WD-Contract-No           Delimited by size        07160000
                      '/'                      Delimited by size        07170000
                      FK-TFCA-Currency         Delimited by space       07180000
                      WD-PA-Seq-No             Delimited by size        07190000
                                       Into R7918030-In-Variable-Data(2)07200000
               End-String                                               07210000
               Perform Z000-Error-Message                               07220000
               Set   R7919999-Return-Error                              07230000
                                         To    True                     07240000
      *                                                                 07250000
           End-Evaluate                                                 07260000
      *                                                                 07270000
           .                                                            07280000
      *################################################################.07290000
       F100-Prepare-Qualification        Section.                       07300000
      *                                                                 07310000
      * We fill in the host variables for the SQL.                      07320000
      *                                                                 07330000
           Initialize                          DCLTF-Part-Amount        07340000
      *                                                                 07350000
           Move  R115IPA0-In-Fin-Inst-ID To    FK-OAKO-FinInst-ID       07360000
           Move  R115IPA0-In-Contract-Type                              07370000
                                         To    FK-TFMC-Contr-Type       07380000
           Move  R115IPA0-In-Contract-No To    FK-TFMC-Contr-No         07390000
      *                                                                 07400000
           Move  R115IPA0-In-CA-Currency To    FK-TFCA-Currency         07410000
           Move  R115IPA0-In-PA-Seq-No   To    TFPA-Seq-No              07420000
      *                                                                 07430000
           If  R115IPA0-In-Fin-Inst-No   Not = Space                    07440000
           and R115IPA0-In-Fin-Inst-ID   =     +0                       07450000
               Move  R115IPA0-In-Fin-Inst-No                            07460000
                                         To    W-Fin-Inst-No            07470000
               Perform N100-Fetch-Fin-Inst-ID                           07480000
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       07490000
           End-If                                                       07500000
      *                                                                 07510000
           .                                                            07520000
      *################################################################.07530000
       F200-Select-Row                   Section.                       07540000
      *                                                                 07550000
           Initialize                          R115IPAS-SQL-Submodules  07560000
           Set   R115IPAS-Version        To    True                     07570000
           Set   R115IPAS-In-Select      To    True                     07580000
           Move  R115IPA0-In-Table-Version                              07590011
                                         To    R115IPAS-In-Table-Version07600011
      *                                                                 07610000
           Call  'F115IPAR'              Using R115IPAS-SQL-Submodules  07620000
                                               DCLTF-Part-Amount        07630000
                                               R7919999-Error-Area      07640000
           End-Call                                                     07650000
      *                                                                 07660000
           Evaluate True                                                07670000
             When R7919999-Return-OK                                    07680000
               Continue                                                 07690000
      *                                                                 07700000
             When R7919999-Return-Error                                 07710000
               Continue                                                 07720000
      *                                                                 07730000
             When other                                                 07740000
               Move  'F201'              To    R7919999-Paragraph       07750000
               Perform Z900-Abend                                       07760000
      *                                                                 07770000
           End-Evaluate                                                 07780000
      *                                                                 07790000
           .                                                            07800000
      *################################################################.07810000
       G000-Insert                       Section.                       07820000
      *                                                                 07830000
           Perform G100-Move-Input-To-DCL                               07840000
           Perform G200-Insert-Row                                      07850000
      *                                                                 07860000
           Perform L300-Remove-DCL                                      07870000
           Perform L100-Store-DCL                                       07880000
      *                                                                 07890000
           .                                                            07900000
      *################################################################.07910000
       G100-Move-Input-To-DCL            Section.                       07920000
      *                                                                 07930000
      * PLEASE REMEMBER:                                                07940008
      *    When you modify the code in this section, you need to do     07950008
      *    the same modifications in module F115APA0 - E200-section.    07960008
      *                                                                 07970008
           Initialize                          DCLTF-Part-Amount        07980000
      *                                                                 07990000
           Move R115IPA0-Fin-Inst-ID     To    FK-OAKO-FinInst-ID       08000000
           If  R115IPA0-Fin-Inst-No      Not = Space                    08010000
           and R115IPA0-Fin-Inst-ID      =     +0                       08020000
               Move  R115IPA0-Fin-Inst-No                               08030000
                                         To    W-Fin-Inst-No            08040000
               Perform N100-Fetch-Fin-Inst-ID                           08050000
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       08060000
           End-If                                                       08070000
      *                                                                 08080000
           Move R115IPA0-Contract-Type   To    FK-TFMC-Contr-Type       08090000
           Move R115IPA0-Contract-No     To    FK-TFMC-Contr-No         08100000
      *                                                                 08110000
           Move R115IPA0-CA-Currency     To    FK-TFCA-Currency         08120000
           Move R115IPA0-PA-Seq-No       To    TFPA-Seq-No              08130000
      *                                                                 08140000
           Move R115IPA0-Status          To    TFPA-Status              08150000
           Move R115IPA0-In-Progress     To    TFPA-In-Progress         08160000
      *                                                                 08170001
           Initialize                          R7919100-Konverter-Dato  08180001
           Set   R7919100-Versjon        To    True                     08190001
           Move  R115IPA0-Register-Date  To    R7919100-In-Dato-AMD9    08200001
           Set   R7919100-In-Konv-Fra-AMD9                              08210001
                                         To    True                     08220001
           Set   R7919100-In-Konv-Til-DB2                               08230001
                                         To    True                     08240001
           Call  'F7919100'              Using R7919100-Konverter-Dato  08250001
                                               R7919999-Error           08260001
           End-Call                                                     08270001
           If  Not R7919999-Retur-OK                                    08280001
               Move  'G101'              To    R7919999-Paragraf        08290001
               Perform Z900-Abend                                       08300001
           End-If                                                       08310001
           Move  R7919100-Ut-Dato-DB2    To    TFPA-Register-Date       08320001
      *                                                                 08330001
           Move R115IPA0-User-ID         To    TFPA-User-ID             08340000
           Move R115IPA0-Amount          To    TFPA-Part-Amount         08350002
           Move R115IPA0-Prev-Amount     To    TFPA-Prev-P-Amount       08360014
           Move R115IPA0-Curr-Amount     To    TFPA-Curr-P-Amount       08370014
           Move R115IPA0-Excess-Amount   To    TFPA-Excess-Amount       08380016
           Move R115IPA0-Incom-Swift     To    TFPA-Incom-Swift         08381020
           Move R115IPA0-Availability    To    TFPA-Availability        08382022
      *                                                                 08390014
           Initialize                          R7919100-Konverter-Dato  08400014
           Set   R7919100-Versjon        To    True                     08410014
           Move  R115IPA0-Accept-Date    To    R7919100-In-Dato-AMD9    08420014
           Set   R7919100-In-Konv-Fra-AMD9                              08430014
                                         To    True                     08440014
           Set   R7919100-In-Konv-Til-DB2                               08450014
                                         To    True                     08460014
           Call  'F7919100'              Using R7919100-Konverter-Dato  08470014
                                               R7919999-Error           08480014
           End-Call                                                     08490014
           If  Not R7919999-Retur-OK                                    08500014
               Move  'G102'              To    R7919999-Paragraf        08510014
               Perform Z900-Abend                                       08520014
           End-If                                                       08530014
           Move  R7919100-Ut-Dato-DB2    To    TFPA-Accept-Date         08540014
      *                                                                 08550000
           .                                                            08560000
      *################################################################.08570000
       G200-Insert-Row                   Section.                       08580000
      *                                                                 08590000
           Initialize                          R115IPAS-SQL-Submodules  08600000
           Set   R115IPAS-Version        To    True                     08610000
           Set   R115IPAS-In-Insert      To    True                     08620000
           Move  R115IPA0-In-Table-Version                              08630011
                                         To    R115IPAS-In-Table-Version08640011
      *                                                                 08650000
           Call  'F115IPAU'              Using R115IPAS-SQL-Submodules  08660000
                                               DCLTF-Part-Amount        08670000
                                               R7919999-Error-Area      08680000
           End-Call                                                     08690000
      *                                                                 08700000
           Evaluate True                                                08710000
             When R7919999-Return-OK                                    08720000
               Move  TFPA-Seq-No         To    R115IPA0-PA-Seq-No       08730005
      *                                                                 08740000
             When R7919999-Return-Error                                 08750000
               Continue                                                 08760000
      *                                                                 08770000
             When other                                                 08780000
               Move  'G201'              To    R7919999-Paragraph       08790000
               Perform Z900-Abend                                       08800000
      *                                                                 08810000
           End-Evaluate                                                 08820000
      *                                                                 08830000
           .                                                            08840000
      *################################################################.08850000
       H000-Update                       Section.                       08860000
      *                                                                 08870000
           Perform H100-Check-Qualification                             08880000
           Perform G100-Move-Input-To-DCL                               08890000
      *                                                                 08900000
           Perform H200-Update-Row                                      08910000
      *                                                                 08920000
           Perform L300-Remove-DCL                                      08930000
           Perform L100-Store-DCL                                       08940000
      *                                                                 08950000
           .                                                            08960000
      *################################################################.08970000
       H050-Upd-Status                   Section.                       08972023
      *                                                                 08973023
           Perform H100-Check-Qualification                             08974023
           Perform G100-Move-Input-To-DCL                               08975023
      *                                                                 08976023
           Perform H300-Update-Status                                   08977023
      *                                                                 08978023
           Perform L300-Remove-DCL                                      08979023
           Perform L100-Store-DCL                                       08979123
      *                                                                 08979223
           .                                                            08979323
      *################################################################.08979423
       H100-Check-Qualification          Section.                       08980000
      *                                                                 08990000
           Evaluate True                                                09000000
             When R115IPA0-Fin-Inst-ID   Not = +0                       09010000
               Continue                                                 09020000
                                                                        09030000
             When R115IPA0-Fin-Inst-No   Not = Space                    09040000
               Move  R115IPA0-Fin-Inst-No                               09050000
                                         To    W-Fin-Inst-No            09060000
               Perform N100-Fetch-Fin-Inst-ID                           09070000
               Move  W-Fin-Inst-ID       To    R115IPA0-Fin-Inst-ID     09080000
                                                                        09090000
             When R115IPA0-In-Fin-Inst-Id Not = +0                      09100000
               Move R115IPA0-In-Fin-Inst-ID                             09110000
                                         To    R115IPA0-Fin-Inst-ID     09120000
                                                                        09130000
             When R115IPA0-In-Fin-Inst-No                               09140000
                                         Not = Space                    09150000
               Move  R115IPA0-In-Fin-Inst-No                            09160000
                                         To    W-Fin-Inst-No            09170000
               Perform N100-Fetch-Fin-Inst-ID                           09180000
               Move  W-Fin-Inst-ID       To    R115IPA0-Fin-Inst-ID     09190000
                                                                        09200000
             When other                                                 09210000
               Initialize                      R7918030-ErrorMessage    09220000
               Move  'TF-FIN-INST-MISSING'                              09230000
                                         To    R7918030-In-MessageCode  09240000
               Perform Z000-Error-Message                               09250000
               Set   R7919999-Return-Error                              09260000
                                         To    True                     09270000
                                                                        09280000
           End-Evaluate                                                 09290000
      *                                                                 09300000
           Evaluate True                                                09310000
             When R115IPA0-Contract-Type Not = Space                    09320000
               Continue                                                 09330000
                                                                        09340000
             When R115IPA0-In-Contract-Type                             09350000
                                         Not = Space                    09360000
               Move R115IPA0-In-Contract-Type                           09370000
                                         To    R115IPA0-Contract-Type   09380000
                                                                        09390000
             When other                                                 09400000
               Initialize                      R7918030-ErrorMessage    09410000
               Move  'TF-CONTRACT-MISSING'                              09420000
                                         To    R7918030-In-MessageCode  09430000
               Perform Z000-Error-Message                               09440000
               Set   R7919999-Return-Error                              09450000
                                         To    True                     09460000
                                                                        09470000
           End-Evaluate                                                 09480000
      *                                                                 09490000
           Evaluate True                                                09500000
             When R115IPA0-Contract-No   Not = +0                       09510000
               Continue                                                 09520000
                                                                        09530000
             When R115IPA0-In-Contract-No                               09540000
                                         Not = +0                       09550000
               Move R115IPA0-In-Contract-No                             09560000
                                         To    R115IPA0-Contract-No     09570000
                                                                        09580000
             When other                                                 09590000
               Initialize                      R7918030-ErrorMessage    09600000
               Move  'TF-CONTRACT-MISSING'                              09610000
                                         To    R7918030-In-MessageCode  09620000
               Perform Z000-Error-Message                               09630000
               Set   R7919999-Return-Error                              09640000
                                         To    True                     09650000
                                                                        09660000
           End-Evaluate                                                 09670000
      *                                                                 09680000
           Evaluate True                                                09690000
             When R115IPA0-CA-Currency   Not = Space                    09700000
               Continue                                                 09710000
                                                                        09720000
             When R115IPA0-In-CA-Currency                               09730000
                                         Not = Space                    09740000
               Move R115IPA0-In-CA-Currency                             09750000
                                         To    R115IPA0-CA-Currency     09760000
                                                                        09770000
             When other                                                 09780000
               Initialize                      R7918030-ErrorMessage    09790000
               Move  'TF-PART-AMOUNT-MISSING'                           09800000
                                         To    R7918030-In-MessageCode  09810000
               Perform Z000-Error-Message                               09820000
               Set   R7919999-Return-Error                              09830000
                                         To    True                     09840000
                                                                        09850000
           End-Evaluate                                                 09860000
      *                                                                 09870000
           Evaluate True                                                09880000
             When R115IPA0-PA-Seq-No     Not = +0                       09890000
               Continue                                                 09900000
                                                                        09910000
             When R115IPA0-In-PA-Seq-No  Not = +0                       09920000
               Move R115IPA0-In-PA-Seq-No                               09930000
                                         To    R115IPA0-PA-Seq-No       09940000
                                                                        09950000
             When other                                                 09960000
               Initialize                      R7918030-ErrorMessage    09970000
               Move  'TF-PART-AMOUNT-MISSING'                           09980000
                                         To    R7918030-In-MessageCode  09990000
               Perform Z000-Error-Message                               10000000
               Set   R7919999-Return-Error                              10010000
                                         To    True                     10020000
                                                                        10030000
           End-Evaluate                                                 10040000
      *                                                                 10050000
           .                                                            10060000
      *################################################################.10070000
       H200-Update-Row                   Section.                       10080000
      *                                                                 10090000
           Initialize                          R115IPAS-SQL-Submodules  10100000
           Set   R115IPAS-Version        To    True                     10110000
           Set   R115IPAS-In-Update      To    True                     10120000
           Move  R115IPA0-In-Table-Version                              10130011
                                         To    R115IPAS-In-Table-Version10140011
      *                                                                 10150000
           Call  'F115IPAU'              Using R115IPAS-SQL-Submodules  10160000
                                               DCLTF-Part-Amount        10170000
                                               R7919999-Error-Area      10180000
           End-Call                                                     10190000
      *                                                                 10200000
           Evaluate True                                                10210000
             When R7919999-Return-OK                                    10220000
               Continue                                                 10230000
      *                                                                 10240000
             When R7919999-Return-Error                                 10250000
               Continue                                                 10260000
      *                                                                 10270000
             When other                                                 10280000
               Move  'H201'              To    R7919999-Paragraph       10290000
               Perform Z900-Abend                                       10300000
      *                                                                 10310000
           End-Evaluate                                                 10320000
      *                                                                 10330000
           .                                                            10340000
      *################################################################.10341023
       H300-Update-status                Section.                       10342023
      *                                                                 10343023
           Initialize                          R115IPAS-SQL-Submodules  10344023
           Set   R115IPAS-Version        To    True                     10345023
           Set   R115IPAS-In-Upd-Status  To    True                     10346023
           Move  R115IPA0-In-Table-Version                              10347023
                                         To    R115IPAS-In-Table-Version10348023
      *                                                                 10349023
           Call  'F115IPAU'              Using R115IPAS-SQL-Submodules  10349123
                                               DCLTF-Part-Amount        10349223
                                               R7919999-Error-Area      10349323
           End-Call                                                     10349423
      *                                                                 10349523
           Evaluate True                                                10349623
             When R7919999-Return-OK                                    10349723
               Continue                                                 10349823
      *                                                                 10349923
             When R7919999-Return-Error                                 10350023
               Continue                                                 10350123
      *                                                                 10350223
             When other                                                 10350323
               Move  'H201'              To    R7919999-Paragraph       10350423
               Perform Z900-Abend                                       10350523
      *                                                                 10350623
           End-Evaluate                                                 10350723
      *                                                                 10350823
           .                                                            10350923
      *################################################################.10351023
       I000-Delete                       Section.                       10360000
      *                                                                 10370000
           Perform F100-Prepare-Qualification                           10380000
           Perform I200-Delete-Row                                      10390000
      *                                                                 10400000
           Perform L300-Remove-DCL                                      10410000
      *                                                                 10420000
           .                                                            10430000
      *################################################################.10440000
       I200-Delete-Row                   Section.                       10450000
      *                                                                 10460000
           Initialize                          R115IPAS-SQL-Submodules  10470000
           Set   R115IPAS-Version        To    True                     10480000
           Set   R115IPAS-In-Delete      To    True                     10490000
           Move  R115IPA0-In-Table-Version                              10500011
                                         To    R115IPAS-In-Table-Version10510011
      *                                                                 10520000
           Call  'F115IPAU'              Using R115IPAS-SQL-Submodules  10530000
                                               DCLTF-Part-Amount        10540000
                                               R7919999-Error-Area      10550000
           End-Call                                                     10560000
      *                                                                 10570000
           Evaluate True                                                10580000
             When R7919999-Return-OK                                    10590000
               Continue                                                 10600000
      *                                                                 10610000
             When R7919999-Return-Error                                 10620000
               Continue                                                 10630000
      *                                                                 10640000
             When other                                                 10650000
               Move  'I201'              To    R7919999-Paragraph       10660000
               Perform Z900-Abend                                       10670000
      *                                                                 10680000
           End-Evaluate                                                 10690000
      *                                                                 10700000
           .                                                            10710000
      *################################################################.10720000
       J000-Get-Columns                  Section.                       10730000
      *                                                                 10740000
           Perform J100-Move-DCL-To-Output                              10750000
      *                                                                 10760000
           .                                                            10770000
      *################################################################.10780000
       J100-Move-DCL-To-Output           Section.                       10790000
      *                                                                 10800000
           Move  FK-OAKO-FinInst-ID      To    R115IPA0-Fin-Inst-ID     10810000
           Move  FK-TFMC-Contr-Type      To    R115IPA0-Contract-Type   10820000
           Move  FK-TFMC-Contr-No        To    R115IPA0-Contract-No     10830000
           Move  FK-TFCA-Currency        To    R115IPA0-CA-Currency     10840000
           Move  TFPA-Seq-No             To    R115IPA0-PA-Seq-No       10850000
      *                                                                 10860000
           Move  TFPA-Status             To    R115IPA0-Status          10870000
           Move  TFPA-In-Progress        To    R115IPA0-In-Progress     10880000
      *                                                                 10890001
           Initialize                          R7919100-Konverter-Dato  10900001
           Set   R7919100-Versjon        To    True                     10910001
           Move  TFPA-Register-Date      To    R7919100-In-Dato-DB2     10920001
           Set   R7919100-In-Konv-Fra-DB2                               10930001
                                         To    True                     10940001
           Set   R7919100-In-Konv-Til-AMD9                              10950001
                                         To    True                     10960001
           Call  'F7919100'              Using R7919100-Konverter-Dato  10970001
                                               R7919999-Error           10980001
           End-Call                                                     10990001
           If  Not R7919999-Retur-OK                                    11000001
               Move  'J101'              To    R7919999-Paragraf        11010001
               Perform Z900-Abend                                       11020001
           End-If                                                       11030001
           Move  R7919100-Ut-Dato-AMD9   To    R115IPA0-Register-Date   11040001
      *                                                                 11050001
           Move  TFPA-User-ID            To    R115IPA0-User-ID         11060000
           Move  TFPA-Part-Amount        To    R115IPA0-Amount          11070002
           Move  TFPA-Prev-P-Amount      To    R115IPA0-Prev-Amount     11080014
           Move  TFPA-Curr-P-Amount      To    R115IPA0-Curr-Amount     11090014
           Move  TFPA-Excess-Amount      To    R115IPA0-Excess-Amount   11100016
           Move  TFPA-Incom-Swift        To    R115IPA0-Incom-Swift     11101020
           Move  TFPA-Availability       To    R115IPA0-Availability    11102022
      *                                                                 11110000
           Initialize                          R7919100-Konverter-Dato  11120014
           Set   R7919100-Versjon        To    True                     11130014
           Move  TFPA-Accept-Date        To    R7919100-In-Dato-DB2     11140014
           Set   R7919100-In-Konv-Fra-DB2                               11150014
                                         To    True                     11160014
           Set   R7919100-In-Konv-Til-AMD9                              11170014
                                         To    True                     11180014
           Call  'F7919100'              Using R7919100-Konverter-Dato  11190014
                                               R7919999-Error           11200014
           End-Call                                                     11210014
           If  Not R7919999-Retur-OK                                    11220014
               Move  'J102'              To    R7919999-Paragraf        11230014
               Perform Z900-Abend                                       11240014
           End-If                                                       11250014
           Move  R7919100-Ut-Dato-AMD9   To    R115IPA0-Accept-Date     11260014
      *                                                                 11270014
           Move  FK-OAKO-FinInst-ID      To    W-Fin-Inst-ID            11280000
           Perform N200-Fetch-Fin-Inst-No                               11290000
           Move  W-Fin-Inst-No           To    R115IPA0-Fin-Inst-No     11300000
      *                                                                 11310000
      * Info about the cursor:                                          11320000
      *                                                                 11330000
           Move  WC-Row-No               To  R115IPA0-Out-Row-No        11340000
           Move  WC-Total-No-Of-Rows     To  R115IPA0-Out-Total-Rows    11350000
      *                                                                 11360000
           .                                                            11370000
      *################################################################.11380000
       L100-Store-DCL                    Section.                       11390000
      *                                                                 11400000
      * We might already have this row in storage.                      11410000
      *                                                                 11420000
           Perform L200-Find-DCL                                        11430000
      *                                                                 11440000
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         11450000
           or  WS-DB2-Not-Read (Ind-WS)                                 11460000
             Then                                                       11470000
      *        If we have reached the end of the storage-table,         11480000
      *        we start on the beginning.                               11490000
      *        This way, we always keep the "newest" occurrences.       11500000
               Add   +1                  To    Ind-WS-Put               11510000
               If  Ind-WS-Put            >     W-Max-Occ-WS-Tab         11520000
                   Move  +1              To    Ind-WS-Put               11530000
               End-If                                                   11540000
               Move  Ind-WS-Put          To    Ind-WS                   11550000
             Else                                                       11560000
               Move  Ind-WS              To    Ind-WS-Put               11570000
           End-If                                                       11580000
      *                                                                 11590000
      * We store the identification.                                    11600000
      *                                                                 11610000
           Move  R115IPA0-In-Table-Version                              11620011
                                         To    WS-DB2-Tbl-Version       11630011
                                                            (Ind-WS-Put)11640011
           Move  FK-OAKO-FinInst-ID      To    WS-DB2-Fin-Inst-ID       11650000
                                                            (Ind-WS-Put)11660000
           Move  FK-TFMC-Contr-Type      To    WS-DB2-Contract-Type     11670000
                                                            (Ind-WS-Put)11680000
           Move  FK-TFMC-Contr-No        To    WS-DB2-Contract-No       11690000
                                                            (Ind-WS-Put)11700000
           Move  FK-TFCA-Currency        To    WS-DB2-CA-Currency       11710000
                                                            (Ind-WS-Put)11720000
           Move  TFPA-Seq-No             To    WS-DB2-PA-Seq-No         11730000
                                                            (Ind-WS-Put)11740000
      *                                                                 11750000
      * The DCL is stored if found, the status is set.                  11760000
      *                                                                 11770000
           Evaluate True                                                11780000
             When Length                 Of    DCLTF-Part-Amount        11790000
                > Length                 Of    WS-DB2-DCL               11800000
               Move  Length              Of    DCLTF-Part-Amount        11810000
                                         To    WD-Length                11820000
               Initialize                      R7918030-ErrorMessage    11830000
               Move  'GL-WL-DCL-UTVIDES' To    R7918030-In-MessageCode  11840000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)11850000
               Move  WD-Length           To R7918030-In-Variable-Data(1)11860000
               Perform Z000-Error-Message                               11870000
               Move  'L101'              To    R7919999-Paragraph       11880000
               Perform Z900-Abend                                       11890000
      *                                                                 11900000
             When R7919999-Return-Error                                 11910000
               Set   WS-DB2-Not-Found (Ind-WS-Put)                      11920000
                                         To    True                     11930000
      *                                                                 11940000
             When other                                                 11950000
               Move  DCLTF-Part-Amount                                  11960000
                                         To    WS-DB2-DCL   (Ind-WS-Put)11970000
               Set   WS-DB2-Read (Ind-WS-Put)                           11980000
                                         To    True                     11990000
      *                                                                 12000000
           End-Evaluate                                                 12010000
      *                                                                 12020000
           .                                                            12030000
      *################################################################.12040000
       L200-Find-DCL                     Section.                       12050000
      *                                                                 12060000
           Perform Varying Ind-WS                                       12070000
                   From  +1              By    +1                       12080000
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         12090000
                   or  ( WS-DB2-Tbl-Version (Ind-WS)                    12100011
                                         =     R115IPA0-In-Table-Version12110011
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    12120011
                                         =     FK-OAKO-FinInst-ID       12130000
                     and WS-DB2-Contract-Type (Ind-WS)                  12140000
                                         =     FK-TFMC-Contr-Type       12150000
                     and WS-DB2-Contract-No (Ind-WS)                    12160000
                                         =     FK-TFMC-Contr-No         12170000
                     and WS-DB2-CA-Currency (Ind-WS)                    12180000
                                         =     FK-TFCA-Currency         12190000
                     and WS-DB2-PA-Seq-No (Ind-WS)                      12200000
                                         =     TFPA-Seq-No )            12210000
           End-Perform                                                  12220000
      *                                                                 12230000
           .                                                            12240000
      *################################################################*12250000
       L300-Remove-DCL                   Section.                       12260000
      *                                                                 12270000
           Perform Varying Ind-WS                                       12280000
                   From  +1              By    +1                       12290000
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         12300000
                   or  ( WS-DB2-Tbl-Version (Ind-WS)                    12310011
                                         =     R115IPA0-In-Table-Version12320011
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    12330011
                                         =     FK-OAKO-FinInst-ID       12340000
                     and WS-DB2-Contract-Type (Ind-WS)                  12350000
                                         =     FK-TFMC-Contr-Type       12360000
                     and WS-DB2-Contract-No (Ind-WS)                    12370000
                                         =     FK-TFMC-Contr-No         12380000
                     and WS-DB2-CA-Currency (Ind-WS)                    12390000
                                         =     FK-TFCA-Currency         12400000
                     and WS-DB2-PA-Seq-No (Ind-WS)                      12410000
                                         =     TFPA-Seq-No )            12420000
           End-Perform                                                  12430000
      *                                                                 12440000
           Evaluate True                                                12450000
             When Ind-WS                 >     W-Max-Occ-WS-Tab         12460000
               Continue                                                 12470000
      *                                                                 12480000
             When other                                                 12490000
               Initialize                      WS-DB2-Row (Ind-WS)      12500000
      *                                                                 12510000
           End-Evaluate                                                 12520000
      *                                                                 12530000
           .                                                            12540000
      *################################################################*12550000
       N100-Fetch-Fin-Inst-ID            Section.                       12560000
      *                                                                 12570000
           Move  W-Fin-Inst-No (1:4)     To    W-Tmp-Konsern-Nr         12580000
      *                                                                 12590000
           If  Not R5879010-Versjon                                     12600000
           or  R5879010-In-Konsernnr     Not = W-Tmp-Konsern-Nr         12610000
      *                                                                 12620000
               Initialize                      R5879010-Konsern         12630000
               Set   R5879010-Versjon    To    True                     12640000
               Set   R5879010-In-Select  To    True                     12650000
               Move  W-Tmp-Konsern-Nr    To    R5879010-In-Konsernnr    12660000
               Call  'F5879010'          Using R5879010-Konsern         12670000
                                               R7919999-Error-Area      12680000
               End-Call                                                 12690000
               If  Not R7919999-Return-OK                               12700000
                   Move  'N101'          To    R7919999-Paragraph       12710000
                   Perform Z900-Abend                                   12720000
               End-If                                                   12730000
      *                                                                 12740000
           End-If                                                       12750000
      *                                                                 12760000
           Move  R5879010-Ut-KO-Konsern-Id                              12770000
                                         To    W-Fin-Inst-ID            12780000
      *                                                                 12790000
           .                                                            12800000
      *################################################################*12810000
       N200-Fetch-Fin-Inst-No            Section.                       12820000
      *                                                                 12830000
           If  Not R5879010-Versjon                                     12840000
           or  R5879010-In-Konsern-ID    Not = W-Fin-Inst-ID            12850000
      *                                                                 12860000
               Initialize                      R5879010-Konsern         12870000
               Set   R5879010-Versjon    To    True                     12880000
               Set   R5879010-In-Select  To    True                     12890000
               Move  W-Fin-Inst-ID       To    R5879010-In-Konsern-ID   12900000
               Call  'F5879010'          Using R5879010-Konsern         12910000
                                               R7919999-Error-Area      12920000
               End-Call                                                 12930000
               If  Not R7919999-Return-OK                               12940000
                   Move  'N201'          To    R7919999-Paragraph       12950000
                   Perform Z900-Abend                                   12960000
               End-If                                                   12970000
      *                                                                 12980000
           End-If                                                       12990000
      *                                                                 13000000
           Move  R5879010-Ut-KO-Konsernnummer                           13010000
                                         To    W-Tmp-Konsern-Nr         13020000
           Move  W-Tmp-Konsern-Nr        To    W-Fin-Inst-No            13030000
      *                                                                 13040000
           .                                                            13050000
      *################################################################*13060000
       ZI00-Conv-Input-Version           Section.                       13070000
      *                                                                 13080000
      * Version control.                                                13090000
      * If conversion is needed, we call the conversion module.         13100000
      *                                                                 13110000
           Set   R115IPA0-Version        To    True                     13120000
           Move  Length                  Of    R115IPA0-Part-Amount     13130000
                                         To    W-IO-Length              13140000
      *                                                                 13150000
           Evaluate True                                                13160000
             When L-Ext-IO-Area (1:8)    =     R115IPA0-Version-No      13170000
             and  Length                 Of    L-Ext-IO-Area            13180000
                                         Not < W-IO-Length              13190000
               Move  L-Ext-IO-Area (1:W-IO-Length)                      13200000
                                         To    W-Int-IO-Area            13210000
      *                                                                 13220000
             When Other                                                 13230000
               Call  'F115I999'                                         13240000
                   Using By Content      'F115IPA0 '                    13250000
                                         'INPUT '                       13260000
                         By Reference    L-Ext-IO-Area                  13270000
                                         W-Int-IO-Area                  13280000
                                         R7919999-Error-Area            13290000
               End-Call                                                 13300000
      *                                                                 13310000
               If  R7919999-Return-Abend                                13320000
                   Move  'ZI03'          To    R7919999-Paragraph       13330000
                   Perform Z900-Abend                                   13340000
               End-If                                                   13350000
      *                                                                 13360000
           End-Evaluate                                                 13370000
      *                                                                 13380000
           .                                                            13390000
      *################################################################*13400000
       ZO00-Conv-Output-Version          Section.                       13410000
      *                                                                 13420000
      * Version control.                                                13430000
      * If conversion is needed, we call the conversion module.         13440000
      *                                                                 13450000
           Evaluate True                                                13460000
             When L-Ext-IO-Area (1:8)    =     R115IPA0-Version-No      13470000
             and  Length                 Of    L-Ext-IO-Area            13480000
                                         Not < W-IO-Length              13490000
               Move  W-Int-IO-Area       To    L-Ext-IO-Area            13500000
                                                         (1:W-IO-Length)13510000
      *                                                                 13520000
             When Other                                                 13530000
               Call  'F115I999'                                         13540000
                   Using By Content      'F115IPA0 '                    13550000
                                         'OUTPUT '                      13560000
                         By Reference    L-Ext-IO-Area                  13570000
                                         W-Int-IO-Area                  13580000
                                         R7919999-Error-Area            13590000
               End-Call                                                 13600000
      *                                                                 13610000
               If  R7919999-Return-Abend                                13620000
                   Move  'ZO01'          To    R7919999-Paragraph       13630000
                   Perform Z900-Abend                                   13640000
               End-If                                                   13650000
      *                                                                 13660000
           End-Evaluate                                                 13670000
      *                                                                 13680000
           .                                                            13690000
      *################################################################*13700000
       Z000-Error-Message                Section.                       13710000
      *                                                                 13720000
           Set   R7918030-Version        To    True                     13730000
      *                                                                 13740000
           Move  'TF'                    To    R7918030-In-System-ID    13750000
           Move  R115X000-Fin-Inst-No    To    R7918030-In-Fin-Inst-No  13760000
           Move  R115X000-FI-Language-639-1                             13770000
                                         To    R7918030-In-Language     13780000
           If  R115X000-Trace-On                                        13790000
               Set   R7918030-In-Log-Yes To    True                     13800000
           End-If                                                       13810000
      *                                                                 13820000
           Call  'F7918030'              Using R7918030-ErrorMessage    13830000
           End-Call                                                     13840000
      *                                                                 13850000
           Move  R7918030-Out-MessageText                               13860000
                                         To    R7919999-Message         13870000
      *                                                                 13880000
           .                                                            13890000
      *################################################################*13900000
       Z900-Abend                        Section.                       13910000
      *                                                                 13920000
           If  R7919999-Return-Code      Not   Numeric                  13930000
           or  Not R7919999-Return-Abend                                13940000
               Move  +0                  To    R7919999-Module-Ind      13950000
           End-If                                                       13960000
      *                                                                 13970000
           Add   +1                      To    R7919999-Module-Ind      13980000
      *                                                                 13990000
           If  R7919999-Module-Ind       Not >                          14000000
                             ( Length    Of    R7919999-Module-Tab      14010000
                             / Length    Of    R7919999-Module-Element )14020000
               Move  'F115IPA0'          To    R7919999-Module-Name     14030000
                                                   (R7919999-Module-Ind)14040000
               Move  R7919999-Paragraph  To    R7919999-Module-Para     14050000
                                                   (R7919999-Module-Ind)14060000
           End-If                                                       14070000
      *                                                                 14080000
           Set   R7919999-Return-Abend   To    TRUE                     14090000
      *                                                                 14100000
           Goback.                                                      14110000
