       Identification Division.                                         00010031
       Program-ID. F115ICU0.                                            00020031
       Author.  Nina Dahl Larsen.                                       00030031
      *################################################################*00040031
      *                                                                 00050031
      * FD International Services                                       00060031
      *                                                                 00070031
      * Interface for all database access on table TF_Customer.         00080031
      *                                                                 00090031
      * The interface kan read one spesific occurence,                  00100031
      * or several occurences, fully or partly qualified.               00110031
      *                                                                 00120031
      * When reading several occurences, one must always start with     00130031
      * -In-Get-1st, and continue with -In-Get-Next.                    00140031
      *                                                                 00150031
      * NB!  There are several key-fields, which may be used            00160031
      *      differently depending on the need.                         00170031
      *      See seperate description below.                            00180031
      *                                                                 00190031
      *                                                                 00200031
      * An ordinary call may look like this:                            00210031
      *                                                                 00220031
      *    Initialize                          R115ICU0-Customer        00230031
      *    Set   R115ICU0-Version        To    True                     00240031
      *    Set   R115ICU0-In-Select      To    True                     00250031
      *                                                                 00260031
      *    Move  &fin-inst-id            To    R115iCU0-In-Fin-Inst-ID  00270031
      *    Move  &customer-id            To    R115iCU0-In-Customer-ID  00280031
      *                                                                 00290031
      *    Call  'F115ICU0'              Using R115ICU0-Customer        00300031
      *                                        R7919999-Error           00310031
      *    End-Call                                                     00320031
      *                                                                 00330031
      *    Evaluate True                                                00340031
      *      When R7919999-Retur-Abend                                  00350031
      *        Move  '&&&&'              To    R7919999-Paragraf        00360031
      *        Perform Z900-Abend                                       00370031
      *                                                                 00380031
      *      When R7919999-Retur-Feil                                   00390031
      *        ...not found...                                          00400031
      *                                                                 00410031
      *      When R7919999-Retur-OK                                     00420031
      *        ...found...                                              00430031
      *                                                                 00440031
      *    End-Evaluate                                                 00450031
      *                                                                 00460031
      *################################################################*00470031
      * Date ! Si! Change description                            ! 3A ! 00480031
      *------+---+-----------------------------------------------+----+ 00490031
      *071211!NDL! New  Cursor,  all                             !LT12! 00500033
      *160101!NDL! New module                                    !LT12! 00501033
      *################################################################*00510031
       Environment Division.                                            00520031
       Configuration Section.                                           00530031
       Special-Names.                                                   00540031
           Decimal-Point Is Comma.                                      00550031
      *                                                                 00560031
      *################################################################*00570031
       Data Division.                                                   00580031
       Working-Storage Section.                                         00590031
      *                                                                 00600031
       01  Filler.                                                      00610031
      *                                                                 00620031
           05  W-Table-Name              Pic  X(18) Value               00630031
                                                   'TF_Customer     '.  00640031
      *                                                                 00650031
           05  W-IO-Length               Pic S9(04)              Comp.  00660031
      *                                                                 00670031
           05  WD-Length                 Pic  Z.ZZ9.                    00680031
           05  WD-SQLCode                Pic -9(03).                    00690031
      *                                                                 00700031
           05  Ind-WS-Put                Pic S9(04)              Comp.  00710031
           05  Ind-WS                    Pic S9(04)              Comp.  00720031
           05  W-Max-Occ-WS-Tab          Pic S9(04)              Comp.  00730031
      *                                                                 00740031
           05  Filler.                                                  00750031
               10  WD-Fin-Inst-ID        Pic  zzzzzzzzzzzzzzzzz9.       00760031
               10  WD-Customer-No        Pic  99999999999.              00770031
      *                                                                 00780031
      *                                                                 00790031
           05  W-Max-Navn                Pic  X(35).                    00800031
           05  Filler REDEFINES W-Max-Navn.                             00810031
                 10  Navn-Char           Pic X(01)   Occurs 35.         00820031
           05  W-Ind                     Pic S9(04)              Comp.  00830031
      *                                                                 00840031
           05  Filler.                                                  00850031
               10  W-Fin-Inst-No         Pic  X(18).                    00860031
               10  W-Fin-Inst-ID         Pic  9(18)              Comp-3.00870031
               10  W-Customer-No         Pic  9(11)              Comp-3.00880031
               10  W-Customer-ID         Pic  9(11)              Comp-3.00890031
      *                                                                 00900031
           05  W-Input-Action            Pic  X(10).                    00910031
             88  SW-IA-Initialize                   Value 'INITIALIZE'. 00920031
      *                                                                 00930031
      *    This field is needed because of the old interfaces used to   00940031
      *    access Fin-Inst-ID and Customer ID.                          00950031
           05  W-Tmp-Konsern-Nr          Pic  9(04).                    00960031
      *----------------------------------------------------------------*00970031
      * Counters, used on cursor read, to return row no. and total      00980031
      * no. of rows.                                                    00990031
      * Total no. of rows is only returned when -In-Count is set on     01000031
      * the Get-1st-call.                                               01010031
      *                                                                 01020031
           05  WC-Counters.                                             01030031
               10  WC-Row-No             Pic S9(11)              Comp-3.01040031
               10  WC-Total-No-Of-Rows   Pic S9(11)              Comp-3.01050031
      *                                                                 01060031
      *----------------------------------------------------------------*01070031
      * Switches used for selecting the correct cursor:                 01080031
      *                                                                 01090031
           05  SW-Cursor-Code.                                          01100031
               10  SW-CC-Fin-Inst        Pic  X(01).                    01110031
                 88  Sw-Use-Fin-Inst                Value 'F'.          01120031
               10  SW-CC-Bank            Pic  X(01).                    01130031
                 88  Sw-Use-Bic-Bank                Value 'B'.          01140031
               10  SW-CC-Country         Pic  X(01).                    01150031
                 88  Sw-Use-Bic-Country             Value 'C'.          01160031
               10  SW-CC-Location        Pic  X(01).                    01170031
                 88  Sw-Use-Bic-Location            Value 'L'.          01180031
               10  SW-CC-Branch          Pic  X(01).                    01190031
                 88  Sw-Use-Bic-Branch              Value 'R'.          01200031
               10  SW-CC-Surname         Pic  X(01).                    01210031
                 88  Sw-Use-Surname                 Value 'S'.          01220031
               10  SW-CC-Countrycode     Pic  X(01).                    01230031
                 88  Sw-Use-Countrycode             Value 'O'.          01240031
      *                                                                 01250031
           05  Filler                    Redefines SW-Cursor-Code       01260031
                                         Pic  X(07).                    01270031
             88  Sw-Use-Fi-Asc                      Value 'F      '.    01281032
             88  Sw-Use-Fi-Ba-Asc                   Value 'FB     '.    01290031
             88  Sw-Use-Fi-Ba-CC-Asc                Value 'FBC    '.    01300031
             88  Sw-Use-Fi-Ba-CC-Lo-Asc             Value 'FBCL   '.    01310031
             88  Sw-Use-Fi-Ba-CC-Lo-Br-A            Value 'FBCLR  '.    01320031
             88  Sw-Use-Fi-Su-Asc                   Value 'F    S '.    01330031
             88  Sw-Use-Fi-Co-Asc                   Value 'F     O'.    01340031
             88  Sw-Use-Fi-Su-Co-Asc                Value 'F    SO'.    01350031
             88  Sw-Use-All                         Value '       '.    01351033
      *                                                                 01360031
      *----------------------------------------------------------------*01370031
      * These fields are used for SQL qualification:                    01380031
      *                                                                 01390031
           05  W-DB-Key.                                                01400031
               10  W-DB-Fin-Inst-ID      Pic S9(18)              Comp-3.01410031
               10  W-DB-Customer-ID      Pic S9(11)              Comp-3.01420031
               10  W-DB-From-Name        Pic  X(15).                    01430031
               10  W-DB-To-Name          Pic  X(15).                    01440031
               10  W-DB-Country-Code     Pic  X(02).                    01450031
               10  W-DB-Bic-Code         Pic  X(11).                    01460031
      *                                                                 01470031
      *----------------------------------------------------------------*01480031
      * These fields are used for comparison with the WS-fields.        01490031
      *                                                                 01500031
           05  WE-Cursor-Info.                                          01510031
             07  WE-Key.                                                01520031
               10  WE-Fin-Inst-ID        Pic S9(18)              Comp-3.01530031
               10  WE-Fin-Inst-No        Pic  X(18).                    01540031
               10  WE-Customer-ID        Pic S9(11)              Comp-3.01550031
               10  WE-Customer-No        Pic S9(11)              Comp-3.01560031
               10  WE-From-Name          Pic  X(15).                    01570031
               10  WE-To-Name            Pic  X(15).                    01580031
               10  WE-Country-Code       Pic  X(02).                    01590031
               10  WE-Bic-Code           Pic  X(11).                    01600031
             07  WE-Code-Sequence        Pic  X(01).                    01610031
               88  WE-CS-Ascending                  Value 'A'.          01620031
               88  WE-CS-Descending                 Value 'D'.          01630031
      *                                                                 01640031
      *----------------------------------------------------------------*01650031
      * Storage, and switches for identifying the content:              01660031
      * The cursor info is used to verify that the get-next has the     01670031
      * same qualification as the get-1st.                              01680031
      *                                                                 01690031
       01  W-Storage.                                                   01700031
      *                                                                 01710031
           05  WS-Cursor-Info.                                          01720031
             07  WS-Key.                                                01730031
               10  WS-Fin-Inst-ID        Pic S9(18)              Comp-3.01740031
               10  WS-Fin-Inst-No        Pic  X(18).                    01750031
               10  WS-Customer-ID        Pic S9(11)              Comp-3.01760031
               10  WS-Customer-No        Pic S9(11)              Comp-3.01770031
               10  WS-From-Name          Pic  X(15).                    01780031
               10  WS-To-Name            Pic  X(15).                    01790031
               10  WS-Country-Code       Pic  X(02).                    01800031
               10  WS-Bic-Code           Pic  X(11).                    01810031
             07  WS-Code-Sequence        Pic  X(01).                    01820031
               88  WS-CS-Ascending                  Value 'A'.          01830031
               88  WS-CS-Descending                 Value 'D'.          01840031
             07  WS-Cursor-Status        Pic  X(08).                    01850031
               88  WS-Cursor-OK                     Value 'OK'.         01860031
               88  WS-Cursor-End                    Value 'END'.        01870031
      *                                                                 01880031
      * We store all occurences that are read, also those that we do    01890031
      * not find. This is to reduce the number of DB2 accesses.         01900031
      *                                                                 01910031
           05  WS-DB2-Table.                                            01920031
             07  WS-DB2-Row              Occurs 10 Times.               01930031
               10  WS-DB2-Fin-Inst-ID    Pic S9(18)              Comp-3.01940031
               10  WS-DB2-Customer-Id    Pic s9(11)              Comp-3.01950031
               10  WS-DB2-Code           Pic S9(01)              Comp-3.01960031
                 88  WS-DB2-Not-Read                Value +0.           01970031
                 88  WS-DB2-Read                    Value +1.           01980031
                 88  WS-DB2-Not-Found               Value +2.           01990031
               10  WS-DB2-DCL            Pic  X(350).                   02000031
      *                                                                 02010031
      *----------------------------------------------------------------*02020031
      * Areas for use when accessing DB2.                               02030031
      *                                                                 02040031
           Exec SQL Include R115TFCU End-Exec.                          02050031
      *                                                                 02060031
      *----------------------------------------------------------------*02070031
      * Internal area:                                                  02080031
      *                                                                 02090031
       01  W-Int-IO-Area.                                               02100031
           Copy R115ICU0.                                               02110031
      *                                                                 02120031
      *----------------------------------------------------------------*02130031
      * Assorted copy-areas:                                            02140031
      *                                                                 02150031
       01  Filler.                                                      02160031
           Copy R115ICUS.                                               02170031
      *                                                                 02180031
       01  Filler.                                                      02190031
           Copy R1781910.                                               02200031
      *                                                                 02210031
       01  Filler.                                                      02220031
           Copy R5879010.                                               02230031
      *                                                                 02240031
       01  Filler.                                                      02250031
           Copy R7918030.                                               02260031
      *                                                                 02270031
       Copy R7919100.                                                   02280031
       Copy R115X000.                                                   02290031
      *COPY R115L990.                                                   02300031
      *                                                                 02310031
      *################################################################.02320031
       Linkage Section.                                                 02330031
      *                                                                 02340031
       01  L-Ext-IO-Area                 Pic  X(560).                   02350031
       Copy R7919999.                                                   02360031
      *                                                                 02370031
      *################################################################.02380031
       Procedure Division                Using L-Ext-IO-Area            02390031
                                               R7919999-Error-Area.     02400031
      *                                                                 02410031
       A000-Main                         Section.                       02420031
      *                                                                 02430031
           Perform B000-Initialize                                      02440031
      *                                                                 02450031
           Evaluate True                                                02460031
             When SW-IA-Initialize                                      02470031
               Continue                                                 02480031
      *                                                                 02490031
             When Other                                                 02500031
               Perform ZI00-Conv-Input-Version                          02510031
               Perform C000-Interface                                   02520031
               Perform ZO00-Conv-Output-Version                         02530031
      *                                                                 02540031
           End-Evaluate                                                 02550031
      *                                                                 02560031
           Goback.                                                      02570031
      *################################################################*02580031
       B000-Initialize                   Section.                       02590031
      *                                                                 02600031
           Set   R7919999-Return-OK      To    True                     02610031
      *                                                                 02620031
           Evaluate True                                                02630031
             When L-Ext-IO-Area (1:10)   =     'INITIALIZE'             02640031
               Set   Sw-IA-Initialize    To    True                     02650031
             When Other                                                 02660031
               Move  Space               To    W-Input-Action           02670031
           End-Evaluate                                                 02680031
      *                                                                 02690031
           Compute  W-Max-Occ-WS-Tab                                    02700031
               =    Length               Of    WS-DB2-Table             02710031
               /    Length               Of    WS-DB2-Row               02720031
      *                                                                 02730031
           If  Sw-IA-Initialize                                         02740031
           or  WS-DB2-Code (1)           Not   Numeric                  02750031
               Initialize                      W-Storage                02760031
               Move  +0                  To    Ind-WS-Put               02770031
           End-If                                                       02780031
      *                                                                 02790031
           If  WC-Row-No                 Not   Numeric                  02800031
           or  WC-Total-No-Of-Rows       Not   Numeric                  02810031
               Initialize                      WC-Counters              02820031
           End-If                                                       02830031
      *                                                                 02840031
           .                                                            02850031
      *################################################################.02860031
       C000-Interface                    Section.                       02870031
      *                                                                 02880031
           Evaluate True                                                02890031
             When R115ICU0-In-Get-1st                                   02900031
               Perform C100-Initialize-Output                           02910031
               Perform D000-Get-1st                                     02920031
               Perform E000-Get-Next                                    02930031
      *                                                                 02940031
             When R115ICU0-In-Get-Next                                  02950031
               Perform C100-Initialize-Output                           02960031
               Perform E000-Get-Next                                    02970031
      *                                                                 02980031
             When R115ICU0-In-Select                                    02990031
               Perform C100-Initialize-Output                           03000031
               Perform F000-Select                                      03010031
      *                                                                 03020031
             When R115ICU0-In-Insert                                    03030031
               Perform G000-Insert                                      03040031
      *                                                                 03050031
             When R115ICU0-In-Update                                    03060031
               Perform H000-Update                                      03070031
      *                                                                 03080031
             When R115ICU0-In-Delete                                    03090031
               Perform I000-Delete                                      03100031
      *                                                                 03110031
             When Other                                                 03120031
               Initialize                      R7918030-ErrorMessage    03130031
               Move  'GL-IN-AKSJON-UV'   To    R7918030-In-MessageCode  03140031
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03150031
               Move  R115ICU0-In-Action  To R7918030-In-Variable-Data(1)03160031
               Perform Z000-Error-Message                               03170031
               Move  'C001'              To    R7919999-Paragraph       03180031
               Perform Z900-Abend                                       03190031
      *                                                                 03200031
           End-Evaluate                                                 03210031
      *                                                                 03220031
           .                                                            03230031
      *################################################################.03240031
       C100-Initialize-Output            Section.                       03250031
      *                                                                 03260031
           Initialize                          R115ICU0-Data            03270031
      *                                                                 03280031
           .                                                            03290031
      *################################################################.03300031
       D000-Get-1st                      Section.                       03310031
      *                                                                 03320031
           Perform D100-Prepare-Input                                   03330031
           Perform D200-Prepare-Qualification                           03340031
           Perform D300-Select-Cursor                                   03350031
           If  R115ICU0-In-CC-Count                                     03360031
               Perform D400-Count-Cursor                                03370031
           End-If                                                       03380031
           Perform D500-Open-Cursor                                     03390031
      *                                                                 03400031
           .                                                            03410031
      *################################################################.03420031
       D100-Prepare-Input                Section.                       03430031
      *                                                                 03440031
      * We create internal from- and to-values, depending on the input. 03450031
      *                                                                 03460031
           Initialize                          WE-Cursor-Info           03470031
      *                                                                 03480031
           Move  R115iCU0-In-Fin-Inst-ID To    WE-Fin-Inst-ID           03490031
           Move  R115iCU0-In-Fin-Inst-No To    WE-Fin-Inst-No           03500031
      *                                                                 03510031
           Move  R115iCU0-In-Customer-ID To    WE-Customer-ID           03520031
           Move  R115iCU0-In-Customer-No To    WE-Customer-No           03530031
      *                                                                 03540031
           Move  R115ICU0-In-Bic-Code    To    WE-Bic-Code              03550031
           Inspect WE-Bic-Code           Converting '* ' To '%%'        03560031
      *                                                                 03570031
           Move  R115ICU0-In-ID-Surname  To    WE-From-Name             03580031
      *    Inspect WE-From-Name          Converting '* ' To '%%'        03590031
      *                                                                 03600031
           Move  R115ICU0-In-Country-Code To    WE-Country-Code         03610031
      *    Inspect WE-Country-Code       Converting '* ' To '%%'        03620031
      *                                                                 03630031
           .                                                            03640031
      *################################################################.03650031
       D200-Prepare-Qualification        Section.                       03660031
      *                                                                 03670031
      * We store the qualification, so that we can check that the       03680031
      * qualification do not change on any following Get-Next.          03690031
      *                                                                 03700031
           Initialize                          WS-Cursor-Info           03710031
           Move  WE-Key                  To    WS-Key                   03720031
           Move  WE-Code-Sequence        To    WS-Code-Sequence         03730031
      *                                                                 03740031
           Initialize WC-Counters                                       03750031
      *                                                                 03760031
      * We fill in the SQL host variables.                              03770031
      *                                                                 03780031
           Initialize                          W-DB-Key                 03790031
      *                                                                 03800031
           Move  WS-Bic-Code             To    W-DB-Bic-Code            03810031
           Move  WS-Country-Code         To    W-DB-Country-Code        03820031
      *                                                                 03830031
      *    Move  WS-ID-Surname           To    W-DB-ID-Surname          03840031
           Move  WE-From-Name            To    W-Max-Navn               03850031
                                               W-DB-From-Name           03860031
           Move Length of WE-From-Name   To    W-Ind                    03870031
           Perform N500-Navn-Intervall                                  03880031
           Move  W-Max-Navn              To    W-DB-To-Name             03890031
      *                                                                 03900031
           Move  WE-Fin-Inst-ID          To    W-DB-Fin-Inst-ID         03910031
           Move  WE-Customer-ID          To    W-DB-Customer-ID         03920031
      *                                                                 03930031
           If  WE-Fin-Inst-No            Not = Space                    03940031
           and W-DB-Fin-Inst-ID          =     +0                       03950031
               Move  WE-Fin-Inst-No      To    W-Fin-Inst-No            03960031
               Perform N100-Fetch-Fin-Inst-ID                           03970031
               Move  W-Fin-Inst-ID       To    W-DB-Fin-Inst-ID         03980031
           End-If                                                       03990031
      *                                                                 04000031
           If  WE-Customer-No            Not = +0                       04010031
           and W-DB-Customer-ID          =     +0                       04020031
               Move  WE-Fin-Inst-No      To    W-Fin-Inst-No            04030031
               Move  WE-Fin-Inst-ID      To    W-Fin-Inst-ID            04040031
               Move  WE-Customer-No      To    W-Customer-No            04050031
               Perform N300-Fetch-Customer-ID                           04060031
               Move  W-Customer-ID       To    W-DB-Customer-ID         04070031
           End-If                                                       04080031
      *                                                                 04090031
      *                                                                 04100031
      * Check Country-Code ?????                                        04110031
      *                                                                 04120031
           .                                                            04130031
      *################################################################.04140031
       D300-Select-Cursor                Section.                       04150031
      *                                                                 04160031
      * We choose which cursor to use, depending on the qualification.  04170031
      *                                                                 04180031
           Move  Space                   To    SW-Cursor-Code           04190031
      *                                                                 04200031
           If  W-DB-Fin-Inst-ID          Not = +0                       04210031
               Set  Sw-Use-Fin-Inst      To    True                     04220031
           End-If                                                       04230031
      *                                                                 04240031
           If  W-DB-From-Name            Not = Space                    04250031
      *    and W-DB-ID-Surname (1:1)     Not = '%'                      04260031
               Set   SW-Use-Surname                                     04270031
                                         To    True                     04280031
           End-If                                                       04290031
      *                                                                 04300031
           If  W-DB-Country-Code         Not = Space                    04310031
               Set   SW-Use-CountryCode                                 04320031
                                         To    True                     04330031
           End-If                                                       04340031
      *                                                                 04350031
           If  W-DB-Bic-Code             Not = Space                    04360031
           and W-DB-Bic-Code (1:1)       Not = '%'                      04370031
               Set   SW-Use-Bic-Bank     To    True                     04380031
      *                                                                 04390031
               If  W-DB-Bic-Code(5:1)    Not = Space                    04400031
               and W-DB-Bic-Code (5:1)   Not = '%'                      04410031
                   Set   SW-Use-Bic-Country  To    True                 04420031
               End-If                                                   04430031
      *                                                                 04440031
               If  W-DB-Bic-Code(7:1)    Not = Space                    04450031
               and W-DB-Bic-Code(7:1)    Not = '%'                      04460031
                   Set   SW-Use-Bic-Location To    True                 04470031
               End-If                                                   04480031
      *                                                                 04490031
               If  W-DB-Bic-Code(9:1)    Not = Space                    04500031
               and W-DB-Bic-Code(9:1)    Not = '%'                      04510031
                   Set   SW-Use-Bic-Branch To    True                   04520031
               End-If                                                   04530031
      *                                                                 04540031
           End-If                                                       04550031
      *                                                                 04560031
           Evaluate True                                                04570031
             When Sw-Use-Fi-Asc                                         04580031
             or   Sw-Use-Fi-Ba-Asc                                      04590031
             or   Sw-Use-Fi-Ba-CC-Asc                                   04600031
             or   Sw-Use-Fi-Ba-CC-Lo-Asc                                04610031
             or   Sw-Use-Fi-Ba-CC-Lo-Br-A                               04620031
             or   Sw-Use-Fi-Su-Asc                                      04630031
             or   Sw-Use-Fi-Co-Asc                                      04640031
             or   Sw-Use-Fi-Su-Co-Asc                                   04650031
             or   Sw-Use-All                                            04651033
               Continue                                                 04660031
      *                                                                 04670031
             When other                                                 04680031
               Initialize                      R7918030-ErrorMessage    04690031
               Move  'GL-CURSOR-UV'      To    R7918030-In-MessageCode  04700031
               Move  'VAR1'              To R7918030-In-Variable-Key (1)04710031
               Move  SW-Cursor-Code      To R7918030-In-Variable-Data(1)04720031
               Perform Z000-Error-Message                               04730031
               Move  'D302'              To    R7919999-Paragraph       04740031
               Perform Z900-Abend                                       04750031
      *                                                                 04760031
           End-Evaluate                                                 04770031
      *                                                                 04780031
           .                                                            04790031
      *################################################################.04800031
       D400-Count-Cursor                 Section.                       04810031
      *                                                                 04820031
           Initialize                          R115iCUS-SQL-Submodules  04830031
           Set   R115iCUS-Version        To    True                     04840031
           Set   R115iCUS-In-Count-Cursor                               04850031
                                         To    True                     04860031
           Move  Sw-Cursor-Code          To    R115iCUS-Cursor-Code     04870031
           Move  W-DB-Key                To    R115iCUS-DB-Key          04880031
      *                                                                 04890031
           Call  'F115iCUR'              Using R115iCUS-SQL-Submodules  04900031
                                               DCLTF-Customer           04910031
                                               R7919999-Error-Area      04920031
           End-Call                                                     04930031
      *                                                                 04940031
           Evaluate True                                                04950031
             When R7919999-Return-OK                                    04960031
               Move  R115iCUS-Out-Total-Rows                            04970031
                                         To    WC-Total-No-Of-Rows      04980031
      *                                                                 04990031
             When other                                                 05000031
               Move  'D401'              To    R7919999-Paragraph       05010031
               Perform Z900-Abend                                       05020031
      *                                                                 05030031
           End-Evaluate                                                 05040031
      *                                                                 05050031
           .                                                            05060031
      *################################################################.05070031
       D500-Open-Cursor                  Section.                       05080031
      *                                                                 05090031
           Initialize                          R115iCUS-SQL-Submodules  05100031
           Set   R115iCUS-Version        To    True                     05110031
           Set   R115iCUS-In-Open-Cursor To    True                     05120031
           Move  Sw-Cursor-Code          To    R115iCUS-Cursor-Code     05130031
           Move  W-DB-Key                To    R115iCUS-DB-Key          05140031
      *                                                                 05150031
           Call  'F115iCUR'              Using R115iCUS-SQL-Submodules  05160031
                                               DCLTF-Customer           05170031
                                               R7919999-Error-Area      05180031
           End-Call                                                     05190031
      *                                                                 05200031
           Evaluate True                                                05210031
             When R7919999-Return-OK                                    05220031
               Set   WS-Cursor-OK        To    True                     05230031
      *                                                                 05240031
             When other                                                 05250031
               Move  'D501'              To    R7919999-Paragraph       05260031
               Perform Z900-Abend                                       05270031
      *                                                                 05280031
           End-Evaluate                                                 05290031
      *                                                                 05300031
           .                                                            05310031
      *################################################################.05320031
       E000-Get-Next                     Section.                       05330031
      *                                                                 05340031
           Perform D100-Prepare-Input                                   05350031
           Perform E100-Check-Qualification                             05360031
           Perform E200-Fetch-Cursor                                    05370031
      *                                                                 05380031
           If  R7919999-Return-OK                                       05390031
               Perform L100-Store-DCL                                   05400031
               Perform J000-Get-Columns                                 05410031
           End-If                                                       05420031
      *                                                                 05430031
           .                                                            05440031
      *################################################################.05450031
       E100-Check-Qualification          Section.                       05460031
      *                                                                 05470031
      * We use the WE-fields for comparison with the WS-fields.         05480031
      * This to verify that the qualification has not changes since     05490031
      * the Get-1st.                                                    05500031
      *                                                                 05510031
           Evaluate True                                                05520031
             When WE-Key                 =     WS-Key                   05530031
             and  WE-Code-Sequence       =     WS-Code-Sequence         05540031
             and  WS-Cursor-OK                                          05550031
               Continue                                                 05560031
      *                                                                 05570031
             When WE-Key                 =     WS-Key                   05580031
             and  WE-Code-Sequence       =     WS-Code-Sequence         05590031
             and  WS-Cursor-End                                         05600031
               Initialize                      R7918030-ErrorMessage    05610031
               Move  'DB-LEST-SISTE'     To    R7918030-In-MessageCode  05620031
               Move  'VAR1'              To R7918030-In-Variable-Key (1)05630031
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)05640031
               Perform Z000-Error-Message                               05650031
               Move  'E101'              To    R7919999-Paragraph       05660031
               Perform Z900-Abend                                       05670031
      *                                                                 05680031
             When Other                                                 05690031
               Initialize                      R7918030-ErrorMessage    05700031
               Move  'GL-BRUK-GET-1ST'   To    R7918030-In-MessageCode  05710031
               Perform Z000-Error-Message                               05720031
               Move  'E102'              To    R7919999-Paragraph       05730031
               Perform Z900-Abend                                       05740031
      *                                                                 05750031
           End-Evaluate                                                 05760031
      *                                                                 05770031
           .                                                            05780031
      *################################################################.05790031
       E200-Fetch-Cursor                 Section.                       05800031
      *                                                                 05810031
           Initialize                          R115iCUS-SQL-Submodules  05820031
           Set   R115iCUS-Version        To    True                     05830031
           Set   R115iCUS-In-Fetch-Cursor                               05840031
                                         To    True                     05850031
           Move  Sw-Cursor-Code          To    R115iCUS-Cursor-Code     05860031
           Move  W-DB-Key                To    R115iCUS-DB-Key          05870031
      *                                                                 05880031
           Call  'F115iCUR'              Using R115iCUS-SQL-Submodules  05890031
                                               DCLTF-Customer           05900031
                                               R7919999-Error-Area      05910031
           End-Call                                                     05920031
      *                                                                 05930031
           Evaluate True                                                05940031
             When R7919999-Return-OK                                    05950031
               Add   +1                  To    WC-Row-No                05960031
      *                                                                 05970031
             When R7919999-Return-Error                                 05980031
               Set   WS-Cursor-End       To    True                     05990031
               If  WC-Row-No             =     +0                       06000031
                 Then                                                   06010031
                   Initialize                  R7918030-ErrorMessage    06020031
                   Move  'DB-FOREKOMST-NF'                              06030031
                                         To    R7918030-In-MessageCode  06040031
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)06050031
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)06060031
                   Perform Z000-Error-Message                           06070031
                 Else                                                   06080031
                   Initialize                  R7918030-ErrorMessage    06090031
                   Move  'DB-LEST-SISTE' To    R7918030-In-MessageCode  06100031
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)06110031
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)06120031
                   Perform Z000-Error-Message                           06130031
               End-If                                                   06140031
      *                                                                 06150031
             When other                                                 06160031
               Move  'E201'              To    R7919999-Paragraph       06170031
               Perform Z900-Abend                                       06180031
      *                                                                 06190031
           End-Evaluate                                                 06200031
      *                                                                 06210031
           .                                                            06220031
      *################################################################.06230031
       F000-Select                       Section.                       06240031
      *                                                                 06250031
           Perform F100-Prepare-Qualification                           06260031
      *                                                                 06270031
      * We will first look through the storage, to see if we have       06280031
      * already got the wanted occurence.                               06290031
      *                                                                 06300031
           Perform L200-Find-DCL                                        06310031
      *                                                                 06320031
      * If we didn't find anything, we need to read. Then we store.     06330031
      *                                                                 06340031
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         06350031
           or  WS-DB2-Not-Read (Ind-WS)                                 06360031
               Perform F200-Select-Row                                  06370031
               Perform L100-Store-DCL                                   06380031
           End-If                                                       06390031
      *                                                                 06400031
      * At last we check what we've got to offer.                       06410031
      *                                                                 06420031
           Evaluate True                                                06430031
             When WS-DB2-Read (Ind-WS)                                  06440031
               Move  WS-DB2-DCL (Ind-WS) To    DCLTF-Customer           06450031
               Perform J000-Get-Columns                                 06460031
      *                                                                 06470031
             When other                                                 06480031
               Initialize                      R7918030-ErrorMessage    06490031
               Move  'DB-FOREKOMST-NF-Q' To    R7918030-In-MessageCode  06500031
               Move  'VAR1'              To R7918030-In-Variable-Key (1)06510031
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)06520031
               Move  'VAR2'              To R7918030-In-Variable-Key (2)06530031
               Move  FK-OAKO-FinInst-ID  To WD-Fin-Inst-ID              06540031
               Move  TFCU-Cust-NO        To WD-Customer-No              06550031
               String WD-Fin-Inst-ID           Delimited by size        06560031
                      '/'                      Delimited by size        06570031
                      WD-Customer-No           Delimited by space       06580031
                                       Into R7918030-In-Variable-Data(2)06590031
               End-String                                               06600031
               Perform Z000-Error-Message                               06610031
               Set   R7919999-Return-Error                              06620031
                                         To    True                     06630031
      *                                                                 06640031
           End-Evaluate                                                 06650031
      *                                                                 06660031
           .                                                            06670031
      *################################################################.06680031
       F100-Prepare-Qualification        Section.                       06690031
      *                                                                 06700031
      * We fill in the host variables for the SQL.                      06710031
      *                                                                 06720031
           Initialize                          DCLTF-Customer           06730031
      *                                                                 06740031
           Move  R115iCU0-In-Fin-Inst-ID To    FK-OAKO-FinInst-ID       06750031
           Move  R115iCU0-In-Customer-ID To    FK-KLID-Cust-ID          06760031
      *                                                                 06770031
           If  R115iCU0-In-Fin-Inst-No   Not = Space                    06780031
           and R115iCU0-In-Fin-Inst-ID   =     +0                       06790031
               Move  R115iCU0-In-Fin-Inst-No                            06800031
                                         To    W-Fin-Inst-No            06810031
               Perform N100-Fetch-Fin-Inst-ID                           06820031
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       06830031
           End-If                                                       06840031
      *                                                                 06850031
           If  R115iCU0-In-Customer-No   Not = +0                       06860031
           and R115iCU0-In-Customer-ID   =     +0                       06870031
               Move  W-Fin-Inst-No       To    W-Fin-Inst-No            06880031
               Move  W-Fin-Inst-ID       To    W-Fin-Inst-ID            06890031
               Move  R115iCU0-In-Customer-No                            06900031
                                         To    W-Customer-No            06910031
               Perform N300-Fetch-Customer-ID                           06920031
               Move  W-Customer-ID       To    FK-KLID-Cust-ID          06930031
           End-If                                                       06940031
      *                                                                 06950031
           .                                                            06960031
      *################################################################.06970031
       F200-Select-Row                   Section.                       06980031
      *                                                                 06990031
           Initialize                          R115iCUS-SQL-Submodules  07000031
           Set   R115iCUS-Version        To    True                     07010031
           Set   R115iCUS-In-Select      To    True                     07020031
      *                                                                 07030031
           Call  'F115iCUR'              Using R115iCUS-SQL-Submodules  07040031
                                               DCLTF-Customer           07050031
                                               R7919999-Error-Area      07060031
           End-Call                                                     07070031
      *                                                                 07080031
           Evaluate True                                                07090031
             When R7919999-Return-OK                                    07100031
               Continue                                                 07110031
      *                                                                 07120031
             When R7919999-Return-Error                                 07130031
               Continue                                                 07140031
      *                                                                 07150031
             When other                                                 07160031
               Move  'F201'              To    R7919999-Paragraph       07170031
               Perform Z900-Abend                                       07180031
      *                                                                 07190031
           End-Evaluate                                                 07200031
      *                                                                 07210031
           .                                                            07220031
      *################################################################.07230031
       G000-Insert                       Section.                       07240031
      *                                                                 07250031
           Perform G100-Move-Input-To-DCL                               07260031
           Perform G200-Insert-Row                                      07270031
      *                                                                 07280031
           Perform L300-Remove-DCL                                      07290031
           Perform L100-Store-DCL                                       07300031
      *                                                                 07310031
           .                                                            07320031
      *################################################################.07330031
       G100-Move-Input-To-DCL            Section.                       07340031
      *                                                                 07350031
      * PLEASE REMEMBER:                                                07360031
      *    When you modify the code in this section, you need to do     07370031
      *    the same modifications in module F115AMC0 - E200-section.    07380031
      *                                                                 07390031
           Initialize                          DCLTF-Customer           07400031
      *                                                                 07410031
           Move R115iCU0-Fin-Inst-ID     To    FK-OAKO-FinInst-ID       07420031
           If  R115iCU0-Fin-Inst-No      Not = Space                    07430031
           and R115iCU0-Fin-Inst-ID      =     +0                       07440031
               Move  R115iCU0-Fin-Inst-No                               07450031
                                         To    W-Fin-Inst-No            07460031
               Perform N100-Fetch-Fin-Inst-ID                           07470031
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       07480031
           End-If                                                       07490031
      *                                                                 07500031
           Move R115iCU0-Customer-ID     To    FK-KLID-Cust-ID          07510031
           Move R115iCU0-Customer-No     To    TFCU-Cust-No             07520031
      *                                                                 07530031
           If  R115iCU0-Customer-No      Not = +0                       07540031
           and R115iCU0-Customer-ID      =     +0                       07550031
               Move  R115iCU0-Fin-Inst-No                               07560031
                                         To    W-Fin-Inst-No            07570031
               Move  R115iCU0-Fin-Inst-ID                               07580031
                                         To    W-Fin-Inst-ID            07590031
               Move  R115iCU0-Customer-No                               07600031
                                         To    W-Customer-No            07610031
               Perform N300-Fetch-Customer-ID                           07620031
               Move  W-Customer-ID       To    FK-KLID-Cust-ID          07630031
           End-If                                                       07640031
      *                                                                 07650031
           If  R115iCU0-Customer-No      = +0                           07660031
           and R115iCU0-Customer-ID  Not =     +0                       07670031
               Move  R115iCU0-Fin-Inst-No                               07680031
                                         To    W-Fin-Inst-No            07690031
               Move  R115iCU0-Fin-Inst-ID                               07700031
                                         To    W-Fin-Inst-ID            07710031
               Move  FK-KLID-Cust-ID     To    W-Customer-ID            07720031
               Perform N400-Fetch-Customer-No                           07730031
               Move W-Customer-No        To    TFCU-Cust-No             07740031
           End-If                                                       07750031
      *                                                                 07760031
           Move R115iCU0-Bic-Bank        To    TFCU-Bic-Bank            07770031
           Move R115iCU0-Bic-Country     To    TFCU-Bic-Countr          07780031
           Move R115iCU0-Bic-Location    To    TFCU-Bic-Loct            07790031
           Move R115iCU0-Bic-Branch      To    TFCU-Bic-Branch          07800031
      *                                                                 07810031
           Move R115iCU0-Surname         To    TFCU-Surname             07820031
           Move R115iCU0-ID-Surname      To    TFCU-ID-Surname          07830031
           Move R115iCU0-Firstname       To    TFCU-First-name          07840031
           Move R115iCU0-Address-1       To    TFCU-Address-1           07850031
           Move R115iCU0-Address-2       To    TFCU-Address-2           07860031
           Move R115iCU0-Address-3       To    TFCU-Address-3           07870031
           Move R115iCU0-Address-4       To    TFCU-Address-4           07880031
      *                                                                 07890031
           Move R115iCU0-Sector-Code     To    TFCU-Sector-Code         07900031
           Move R115iCU0-Postal-Code     To    TFCU-Postal-Code         07910031
           Move R115iCU0-Destination     To    TFCU-Destination         07920031
           Move R115iCU0-Country-Code    To    TFCU-Country-Code        07930031
           Move R115iCU0-Geo-Code        To    TFCU-Geo-Code            07940031
      *                                                                 07950031
           Initialize                          R7919100-Konverter-Dato  07960031
           Set   R7919100-Versjon        To    True                     07970031
           Move  R115iCU0-Terminated-Date                               07980031
                                         To    R7919100-In-Dato-AMD9    07990031
           Set   R7919100-In-Konv-Til-DB2                               08000031
                                         To    True                     08010031
           Call  'F7919100'              Using R7919100-Konverter-Dato  08020031
                                               R7919999-Error-Area      08030031
           End-Call                                                     08040031
           If  Not R7919999-Return-OK                                   08050031
               Move  'G101'              To    R7919999-Paragraph       08060031
               Perform Z900-Abend                                       08070031
           End-If                                                       08080031
           Move  R7919100-Ut-Dato-DB2    To    TFCU-Terminated          08090031
      *                                                                 08100031
      *                                                                 08110031
           .                                                            08120031
      *################################################################.08130031
       G200-Insert-Row                   Section.                       08140031
      *                                                                 08150031
           Initialize                          R115iCUS-SQL-Submodules  08160031
           Set   R115iCUS-Version        To    True                     08170031
           Set   R115iCUS-In-Insert      To    True                     08180031
      *                                                                 08190031
           Call  'F115iCUU'              Using R115iCUS-SQL-Submodules  08200031
                                               DCLTF-Customer           08210031
                                               R7919999-Error-Area      08220031
           End-Call                                                     08230031
      *                                                                 08240031
           Evaluate True                                                08250031
             When R7919999-Return-OK                                    08260031
               Continue                                                 08270031
      *                                                                 08280031
             When R7919999-Return-Error                                 08290031
               Continue                                                 08300031
      *                                                                 08310031
             When other                                                 08320031
               Move  'G201'              To    R7919999-Paragraph       08330031
               Perform Z900-Abend                                       08340031
      *                                                                 08350031
           End-Evaluate                                                 08360031
      *                                                                 08370031
           .                                                            08380031
      *################################################################.08390031
       H000-Update                       Section.                       08400031
      *                                                                 08410031
           Perform H100-Check-Qualification                             08420031
           Perform G100-Move-Input-To-DCL                               08430031
      *                                                                 08440031
           Perform H200-Update-Row                                      08450031
      *                                                                 08460031
           Perform L300-Remove-DCL                                      08470031
           Perform L100-Store-DCL                                       08480031
      *                                                                 08490031
           .                                                            08500031
      *################################################################.08510031
       H100-Check-Qualification          Section.                       08520031
      *                                                                 08530031
           Evaluate True                                                08540031
                                                                        08550031
             When R115ICU0-Fin-Inst-ID   Not = +0                       08560031
               Continue                                                 08570031
                                                                        08580031
             When R115ICU0-Fin-Inst-No   Not = Space                    08590031
               Move  R115ICU0-Fin-Inst-No                               08600031
                                         To    W-Fin-Inst-No            08610031
               Perform N100-Fetch-Fin-Inst-ID                           08620031
               Move  W-Fin-Inst-ID       To    R115ICU0-Fin-Inst-ID     08630031
                                                                        08640031
             When R115ICU0-In-Fin-Inst-Id                               08650031
                                         Not = +0                       08660031
               Move R115ICU0-In-Fin-Inst-ID                             08670031
                                         To    R115ICU0-Fin-Inst-ID     08680031
                                                                        08690031
             When R115ICU0-In-Fin-Inst-No                               08700031
                                         Not = Space                    08710031
               Move  R115ICU0-In-Fin-Inst-No                            08720031
                                         To    W-Fin-Inst-No            08730031
               Perform N100-Fetch-Fin-Inst-ID                           08740031
               Move  W-Fin-Inst-ID       To    R115ICU0-Fin-Inst-ID     08750031
                                                                        08760031
             When other                                                 08770031
               Initialize                      R7918030-ErrorMessage    08780031
               Move  'TF-FIN-INST-MISSING'                              08790031
                                         To    R7918030-In-MessageCode  08800031
               Perform Z000-Error-Message                               08810031
               Set   R7919999-Return-Error                              08820031
                                         To    True                     08830031
           End-Evaluate                                                 08840031
      *                                                                 08850031
           Evaluate True                                                08860031
             When R115iCU0-Customer-ID   Not = +0                       08870031
               Continue                                                 08880031
                                                                        08890031
             When R115iCU0-Customer-No  Not = +0                        08900031
               Move R115iCU0-Customer-No                                08910031
                                         To    W-Customer-No            08920031
               Move  W-Fin-Inst-No       To    W-Fin-Inst-No            08930031
               Move  R115ICU0-Fin-Inst-ID                               08940031
                                         To    W-Fin-Inst-ID            08950031
               Perform N300-Fetch-Customer-ID                           08960031
               Move  W-Customer-ID       To    R115ICU0-Customer-Id     08970031
                                                                        08980031
             When R115iCU0-In-Customer-Id                               08990031
                                         Not = +0                       09000031
               Move R115iCU0-In-Customer-ID                             09010031
                                         To    R115iCU0-Customer-ID     09020031
                                                                        09030031
             When R115iCU0-In-Customer-No  Not = +0                     09040031
               Move R115iCU0-In-Customer-No                             09050031
                                         To    W-Customer-No            09060031
               Move  W-Fin-Inst-No       To    W-Fin-Inst-No            09070031
               Move  R115ICU0-Fin-Inst-ID                               09080031
                                         To    W-Fin-Inst-ID            09090031
               Perform N300-Fetch-Customer-ID                           09100031
               Move  W-Customer-ID       To    R115ICU0-Customer-Id     09110031
                                                                        09120031
             When other                                                 09130031
               Initialize                      R7918030-ErrorMessage    09140031
               Move  'TF-SY-CUST-ID-MISSING'                            09150031
                                         To    R7918030-In-MessageCode  09160031
               Perform Z000-Error-Message                               09170031
               Set   R7919999-Return-Error                              09180031
                                         To    True                     09190031
                                                                        09200031
           End-Evaluate                                                 09210031
      *                                                                 09220031
           .                                                            09230031
      *################################################################.09240031
       H200-Update-Row                   Section.                       09250031
      *                                                                 09260031
           Initialize                          R115iCUS-SQL-Submodules  09270031
           Set   R115iCUS-Version        To    True                     09280031
           Set   R115iCUS-In-Update      To    True                     09290031
      *                                                                 09300031
           Call  'F115iCUU'              Using R115iCUS-SQL-Submodules  09310031
                                               DCLTF-Customer           09320031
                                               R7919999-Error-Area      09330031
           End-Call                                                     09340031
      *                                                                 09350031
           Evaluate True                                                09360031
             When R7919999-Return-OK                                    09370031
               Continue                                                 09380031
      *                                                                 09390031
             When R7919999-Return-Error                                 09400031
               Continue                                                 09410031
      *                                                                 09420031
             When other                                                 09430031
               Move  'H201'              To    R7919999-Paragraph       09440031
               Perform Z900-Abend                                       09450031
      *                                                                 09460031
           End-Evaluate                                                 09470031
      *                                                                 09480031
           .                                                            09490031
      *################################################################.09500031
       I000-Delete                       Section.                       09510031
      *                                                                 09520031
           Perform F100-Prepare-Qualification                           09530031
           Perform I200-Delete-Row                                      09540031
      *                                                                 09550031
           Perform L300-Remove-DCL                                      09560031
      *                                                                 09570031
           .                                                            09580031
      *################################################################.09590031
       I200-Delete-Row                   Section.                       09600031
      *                                                                 09610031
           Initialize                          R115iCUS-SQL-Submodules  09620031
           Set   R115iCUS-Version        To    True                     09630031
           Set   R115iCUS-In-Delete      To    True                     09640031
      *                                                                 09650031
           Call  'F115iCUU'              Using R115iCUS-SQL-Submodules  09660031
                                               DCLTF-Customer           09670031
                                               R7919999-Error-Area      09680031
           End-Call                                                     09690031
      *                                                                 09700031
           Evaluate True                                                09710031
             When R7919999-Return-OK                                    09720031
               Continue                                                 09730031
      *                                                                 09740031
             When R7919999-Return-Error                                 09750031
               Continue                                                 09760031
      *                                                                 09770031
             When other                                                 09780031
               Move  'I201'              To    R7919999-Paragraph       09790031
               Perform Z900-Abend                                       09800031
      *                                                                 09810031
           End-Evaluate                                                 09820031
      *                                                                 09830031
           .                                                            09840031
      *################################################################.09850031
       J000-Get-Columns                  Section.                       09860031
      *                                                                 09870031
           Perform J100-Move-DCL-To-Output                              09880031
      *                                                                 09890031
           .                                                            09900031
      *################################################################.09910031
       J100-Move-DCL-To-Output           Section.                       09920031
      *                                                                 09930031
      * PLEASE REMEMBER:                                                09940031
      *    When you modify the code in this section, you need to do     09950031
      *    the same modifications in module F115AMC0 - E500-section.    09960031
      *                                                                 09970031
           Move  FK-OAKO-FinInst-ID      To    R115iCU0-Fin-Inst-ID     09980031
           Move  FK-KLID-Cust-ID         To    R115iCU0-Customer-ID     09990031
           Move  TFCU-Cust-No            To    R115iCU0-Customer-No     10000031
      *                                                                 10010031
           Move  TFCU-Bic-Bank           To    R115iCU0-Bic-Bank        10020031
           Move  TFCU-Bic-Countr         To    R115iCU0-Bic-Country     10030031
           Move  TFCU-Bic-Loct           To    R115iCU0-Bic-Location    10040031
           Move  TFCU-Bic-Branch         To    R115iCU0-Bic-Branch      10050031
      *                                                                 10060031
           Move  TFCU-Surname            To    R115iCU0-Surname         10070031
           Move  TFCU-ID-Surname         To    R115iCU0-ID-Surname      10080031
           Move  TFCU-First-Name         To    R115iCU0-Firstname       10090031
           Move  TFCU-Address-1          To    R115iCU0-Address-1       10100031
           Move  TFCU-Address-2          To    R115iCU0-Address-2       10110031
           Move  TFCU-Address-3          To    R115iCU0-Address-3       10120031
           Move  TFCU-Address-4          To    R115iCU0-Address-4       10130031
           Move  TFCU-Sector-Code        To    R115iCU0-Sector-Code     10140031
           Move  TFCU-Postal-Code        To    R115iCU0-Postal-Code     10150031
           Move  TFCU-Destination        To    R115iCU0-Destination     10160031
           Move  TFCU-Country-Code       To    R115iCU0-Country-Code    10170031
           Move  TFCU-Geo-Code           To    R115iCU0-Geo-Code        10180031
      *                                                                 10190031
           Move  FK-OAKO-FinInst-ID      To    W-Fin-Inst-ID            10200031
           Perform N200-Fetch-Fin-Inst-No                               10210031
           Move  W-Fin-Inst-No           To    R115iCU0-Fin-Inst-No     10220031
      *                                                                 10230031
           Initialize                          R7919100-Konverter-Dato  10240031
           Set   R7919100-Versjon        To    True                     10250031
           Move  TFCU-Terminated         To    R7919100-In-Dato-DB2     10260031
           Set   R7919100-In-Konv-Til-AMD9                              10270031
                                         To    True                     10280031
           Call  'F7919100'              Using R7919100-Konverter-Dato  10290031
                                               R7919999-Error-Area      10300031
           End-Call                                                     10310031
           If  Not R7919999-Return-OK                                   10320031
               Move  'J101'              To    R7919999-Paragraph       10330031
               Perform Z900-Abend                                       10340031
           End-If                                                       10350031
           Move  R7919100-Ut-Dato-AMD9   To    R115iCU0-Terminated-Date 10360031
      *                                                                 10370031
      * Info about the cursor:                                          10380031
      *                                                                 10390031
           Move  WC-Row-No               To  R115iCU0-Out-Row-No        10400031
           Move  WC-Total-No-Of-Rows     To  R115iCU0-Out-Total-Rows    10410031
      *                                                                 10420031
           .                                                            10430031
      *################################################################.10440031
       L100-Store-DCL                    Section.                       10450031
      *                                                                 10460031
      * We might already have this row in storage.                      10470031
      *                                                                 10480031
           Perform L200-Find-DCL                                        10490031
      *                                                                 10500031
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         10510031
           or  WS-DB2-Not-Read (Ind-WS)                                 10520031
             Then                                                       10530031
      *        If we have reached the end of the storage-table,         10540031
      *        we start on the beginning.                               10550031
      *        This way, we always keep the "newest" occurrences.       10560031
               Add   +1                  To    Ind-WS-Put               10570031
               If  Ind-WS-Put            >     W-Max-Occ-WS-Tab         10580031
                   Move  +1              To    Ind-WS-Put               10590031
               End-If                                                   10600031
               Move  Ind-WS-Put          To    Ind-WS                   10610031
             Else                                                       10620031
               Move  Ind-WS              To    Ind-WS-Put               10630031
           End-If                                                       10640031
      *                                                                 10650031
      * We store the identification.                                    10660031
      *                                                                 10670031
           Move  FK-OAKO-FinInst-ID      To    WS-DB2-Fin-Inst-ID       10680031
                                                            (Ind-WS-Put)10690031
           Move  FK-KLID-Cust-ID         To    WS-DB2-Customer-ID       10700031
                                                            (Ind-WS-Put)10710031
      *                                                                 10720031
      * The DCL is stored if found, the status is set.                  10730031
      *                                                                 10740031
           Evaluate True                                                10750031
             When Length                 Of    DCLTF-Customer           10760031
                > Length                 Of    WS-DB2-DCL               10770031
               Move  Length              Of    DCLTF-Customer           10780031
                                         To    WD-Length                10790031
               Initialize                      R7918030-ErrorMessage    10800031
               Move  'GL-WL-DCL-UTVIDES' To    R7918030-In-MessageCode  10810031
               Move  'VAR1'              To R7918030-In-Variable-Key (1)10820031
               Move  WD-Length           To R7918030-In-Variable-Data(1)10830031
               Perform Z000-Error-Message                               10840031
               Move  'L101'              To    R7919999-Paragraph       10850031
               Perform Z900-Abend                                       10860031
      *                                                                 10870031
             When R7919999-Return-Error                                 10880031
               Set   WS-DB2-Not-Found (Ind-WS-Put)                      10890031
                                         To    True                     10900031
      *                                                                 10910031
             When other                                                 10920031
               Move  DCLTF-Customer To         WS-DB2-DCL   (Ind-WS-Put)10930031
               Set   WS-DB2-Read (Ind-WS-Put)                           10940031
                                         To    True                     10950031
      *                                                                 10960031
           End-Evaluate                                                 10970031
      *                                                                 10980031
           .                                                            10990031
      *################################################################.11000031
       L200-Find-DCL                     Section.                       11010031
      *                                                                 11020031
           Perform Varying Ind-WS                                       11030031
                   From  +1              By    +1                       11040031
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         11050031
                   or  ( WS-DB2-Customer-ID (Ind-WS)                    11060031
                                         =     FK-KLID-Cust-ID          11070031
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    11080031
                                         =     FK-OAKO-FinInst-ID)      11090031
           End-Perform                                                  11100031
      *                                                                 11110031
           .                                                            11120031
      *################################################################*11130031
       L300-Remove-DCL                   Section.                       11140031
      *                                                                 11150031
           Perform Varying Ind-WS                                       11160031
                   From  +1              By    +1                       11170031
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         11180031
                   or  ( WS-DB2-Customer-ID (Ind-WS)                    11190031
                                         =     FK-KLID-Cust-ID          11200031
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    11210031
                                         =     FK-OAKO-FinInst-ID )     11220031
           End-Perform                                                  11230031
      *                                                                 11240031
           Evaluate True                                                11250031
             When Ind-WS                 >     W-Max-Occ-WS-Tab         11260031
               Continue                                                 11270031
      *                                                                 11280031
             When other                                                 11290031
               Initialize                      WS-DB2-Row (Ind-WS)      11300031
      *                                                                 11310031
           End-Evaluate                                                 11320031
      *                                                                 11330031
           .                                                            11340031
      *################################################################*11350031
       N100-Fetch-Fin-Inst-ID            Section.                       11360031
      *                                                                 11370031
           Move  W-Fin-Inst-No (1:4)     To    W-Tmp-Konsern-Nr         11380031
      *                                                                 11390031
           If  Not R5879010-Versjon                                     11400031
           or  R5879010-In-Konsernnr     Not = W-Tmp-Konsern-Nr         11410031
      *                                                                 11420031
               Initialize                      R5879010-Konsern         11430031
               Set   R5879010-Versjon    To    True                     11440031
               Set   R5879010-In-Select  To    True                     11450031
               Move  W-Tmp-Konsern-Nr    To    R5879010-In-Konsernnr    11460031
               Call  'F5879010'          Using R5879010-Konsern         11470031
                                               R7919999-Error-Area      11480031
               End-Call                                                 11490031
               If  Not R7919999-Return-OK                               11500031
                   Move  'N101'          To    R7919999-Paragraph       11510031
                   Perform Z900-Abend                                   11520031
               End-If                                                   11530031
      *                                                                 11540031
           End-If                                                       11550031
      *                                                                 11560031
           Move  R5879010-Ut-KO-Konsern-Id                              11570031
                                         To    W-Fin-Inst-ID            11580031
      *                                                                 11590031
           .                                                            11600031
      *################################################################*11610031
       N200-Fetch-Fin-Inst-No            Section.                       11620031
      *                                                                 11630031
           If  Not R5879010-Versjon                                     11640031
           or  R5879010-In-Konsern-ID    Not = W-Fin-Inst-ID            11650031
      *                                                                 11660031
               Initialize                      R5879010-Konsern         11670031
               Set   R5879010-Versjon    To    True                     11680031
               Set   R5879010-In-Select  To    True                     11690031
               Move  W-Fin-Inst-ID       To    R5879010-In-Konsern-ID   11700031
               Call  'F5879010'          Using R5879010-Konsern         11710031
                                               R7919999-Error-Area      11720031
               End-Call                                                 11730031
               If  Not R7919999-Return-OK                               11740031
                   Move  'N201'          To    R7919999-Paragraph       11750031
                   Perform Z900-Abend                                   11760031
               End-If                                                   11770031
      *                                                                 11780031
           End-If                                                       11790031
      *                                                                 11800031
           Move  R5879010-Ut-KO-Konsernnummer                           11810031
                                         To    W-Tmp-Konsern-Nr         11820031
           Move  W-Tmp-Konsern-Nr        To    W-Fin-Inst-No            11830031
      *                                                                 11840031
           .                                                            11850031
      *################################################################*11860031
       N300-Fetch-Customer-ID            Section.                       11870031
      *                                                                 11880031
           If  W-Fin-Inst-No             =     Space                    11890031
           and W-Fin-Inst-ID             Not = +0                       11900031
               Perform N200-Fetch-Fin-Inst-No                           11910031
           End-If                                                       11920031
      *                                                                 11930031
           Move  W-Fin-Inst-No (1:4)     To    W-Tmp-Konsern-Nr         11940031
      *                                                                 11950031
           If  Not R1781910-Versjon                                     11960031
           or  R1781910-In-Konsern-Nr    Not = W-Tmp-Konsern-Nr         11970031
           or  R1781910-In-Kunde-Nr      Not = W-Customer-No            11980031
      *                                                                 11990031
               Initialize                      R1781910-Kunde-ID        12000031
               Set   R1781910-Versjon    To    True                     12010031
               Set   R1781910-In-Select  To    True                     12020031
               Move  W-Tmp-Konsern-Nr    To    R1781910-In-Konsern-Nr   12030031
               Move  W-Customer-No       To    R1781910-In-Kunde-Nr     12040031
               Call  'F1781910'          Using R1781910-Kunde-ID        12050031
                                               R7919999-Error-Area      12060031
               End-Call                                                 12070031
      *                                                                 12080031
               If  Not R7919999-Return-OK                               12090031
                   Move  'N301'          To    R7919999-Paragraph       12100031
                   Perform Z900-Abend                                   12110031
               End-If                                                   12120031
      *                                                                 12130031
           End-If                                                       12140031
      *                                                                 12150031
           Move  R1781910-Ut-Kunde-ID    To    W-Customer-ID            12160031
      *                                                                 12170031
           .                                                            12180031
      *################################################################*12190031
       N400-Fetch-Customer-No            Section.                       12200031
      *                                                                 12210031
           If  Not R1781910-Versjon                                     12220031
           or  R1781910-In-Kunde-ID      Not = W-Customer-ID            12230031
      *                                                                 12240031
               Initialize                      R1781910-Kunde-ID        12250031
               Set   R1781910-Versjon    To    True                     12260031
               Set   R1781910-In-Select  To    True                     12270031
               Move  W-Customer-ID       To    R1781910-In-Kunde-ID     12280031
               Call  'F1781910'          Using R1781910-Kunde-ID        12290031
                                               R7919999-Error-Area      12300031
               End-Call                                                 12310031
      *                                                                 12320031
               If  Not R7919999-Return-OK                               12330031
                   Move  'N401'          To    R7919999-Paragraph       12340031
                   Perform Z900-Abend                                   12350031
               End-If                                                   12360031
      *                                                                 12370031
           End-If                                                       12380031
      *                                                                 12390031
           Move  R1781910-Ut-Kunde-Nr    To    W-Customer-No            12400031
      *                                                                 12410031
           .                                                            12420031
      *################################################################*12430031
       N500-Navn-Intervall                Section.                      12440031
      *                                                                 12450031
           Perform With Test Before Until (Navn-Char(W-Ind) Not = Space 12460031
                                        and Low-Values or W-ind = 0)    12470031
              Move High-Value            To Navn-Char(W-Ind)            12480031
              Subtract 1                 From  W-Ind                    12490031
           End-Perform                                                  12500031
      *                                                                 12510031
           .                                                            12520031
      *################################################################*12530031
       ZI00-Conv-Input-Version           Section.                       12540031
      *                                                                 12550031
      * Version control.                                                12560031
      * If conversion is needed, we call the conversion module.         12570031
      *                                                                 12580031
           Set   R115iCU0-Version        To    True                     12590031
           Move  Length                  Of    R115iCU0-Customer        12600031
                                         To    W-IO-Length              12610031
      *                                                                 12620031
           Evaluate True                                                12630031
             When L-Ext-IO-Area (1:8)    =     R115iCU0-Version-No      12640031
             and  Length                 Of    L-Ext-IO-Area            12650031
                                         Not < W-IO-Length              12660031
               Move  L-Ext-IO-Area (1:W-IO-Length)                      12670031
                                         To    W-Int-IO-Area            12680031
      *                                                                 12690031
             When Other                                                 12700031
               Call  'F115I999'                                         12710031
                   Using By Content      'F115ICU0 '                    12720031
                                         'INPUT '                       12730031
                         By Reference    L-Ext-IO-Area                  12740031
                                         W-Int-IO-Area                  12750031
                                         R7919999-Error-Area            12760031
               End-Call                                                 12770031
      *                                                                 12780031
               If  R7919999-Return-Abend                                12790031
                   Move  'ZI03'          To    R7919999-Paragraph       12800031
                   Perform Z900-Abend                                   12810031
               End-If                                                   12820031
      *                                                                 12830031
           End-Evaluate                                                 12840031
      *                                                                 12850031
           .                                                            12860031
      *################################################################*12870031
       ZO00-Conv-Output-Version          Section.                       12880031
      *                                                                 12890031
      * Version control.                                                12900031
      * If conversion is needed, we call the conversion module.         12910031
      *                                                                 12920031
           Evaluate True                                                12930031
             When L-Ext-IO-Area (1:8)    =     R115iCU0-Version-No      12940031
             and  Length                 Of    L-Ext-IO-Area            12950031
                                         Not < W-IO-Length              12960031
               Move  W-Int-IO-Area       To    L-Ext-IO-Area            12970031
                                                         (1:W-IO-Length)12980031
      *                                                                 12990031
             When Other                                                 13000031
               Call  'F115I999'                                         13010031
                   Using By Content      'F115ICU0 '                    13020031
                                         'OUTPUT '                      13030031
                         By Reference    L-Ext-IO-Area                  13040031
                                         W-Int-IO-Area                  13050031
                                         R7919999-Error-Area            13060031
               End-Call                                                 13070031
      *                                                                 13080031
               If  R7919999-Return-Abend                                13090031
                   Move  'ZO01'          To    R7919999-Paragraph       13100031
                   Perform Z900-Abend                                   13110031
               End-If                                                   13120031
      *                                                                 13130031
           End-Evaluate                                                 13140031
      *                                                                 13150031
           .                                                            13160031
      *################################################################*13170031
       Z000-Error-Message                Section.                       13180031
      *                                                                 13190031
           Set   R7918030-Version        To    True                     13200031
      *                                                                 13210031
           Move  'TF'                    To    R7918030-In-System-ID    13220031
           Move  R115X000-Fin-Inst-No    To    R7918030-In-Fin-Inst-No  13230031
           Move  R115X000-FI-Language-639-1                             13240031
                                         To    R7918030-In-Language     13250031
           If  R115X000-Trace-On                                        13260031
               Set   R7918030-In-Log-Yes To    True                     13270031
           End-If                                                       13280031
      *                                                                 13290031
           Call  'F7918030'              Using R7918030-ErrorMessage    13300031
           End-Call                                                     13310031
      *                                                                 13320031
           Move  R7918030-Out-MessageText                               13330031
                                         To    R7919999-Message         13340031
      *                                                                 13350031
           .                                                            13360031
      *################################################################*13370031
       Z900-Abend                        Section.                       13380031
      *                                                                 13390031
           If  R7919999-Return-Code      Not   Numeric                  13400031
           or  Not R7919999-Return-Abend                                13410031
               Move  +0                  To    R7919999-Module-Ind      13420031
           End-If                                                       13430031
      *                                                                 13440031
           Add   +1                      To    R7919999-Module-Ind      13450031
      *                                                                 13460031
           If  R7919999-Module-Ind       Not >                          13470031
                             ( Length    Of    R7919999-Module-Tab      13480031
                             / Length    Of    R7919999-Module-Element )13490031
               Move  'F115ICU0'          To    R7919999-Module-Name     13500031
                                                   (R7919999-Module-Ind)13510031
               Move  R7919999-Paragraph  To    R7919999-Module-Para     13520031
                                                   (R7919999-Module-Ind)13530031
           End-If                                                       13540031
      *                                                                 13550031
           Set   R7919999-Return-Abend   To    TRUE                     13560031
      *                                                                 13570031
           Goback.                                                      13580031
