000100 Identification Division.                                         00010001
000200 Program-ID. F115L140.                                            00020001
000300 Author.  Rune Mesel.                                             00030001
000400*################################################################*00040001
000500*                                                                 00050001
000600* FD Trade Finance                                                00060001
000700*                                                                 00070001
000800*    This module will generate a shadow for all tables            00080001
000900*    or accept a shadow                                           00090001
001000*                                                                 00100001
001100*################################################################*00110001
001200* Date ! Si! Change description                            ! 3A ! 00120001
001300*------+---+-----------------------------------------------+----+ 00130001
001400*060901!NDL! Keep charges with type % of PA on main charge !LO18! 00140052
001500*      !   ! when Charge-Action = 'y'                      !    ! 00150053
001600*211200!NDL! Move to History instead of Actual on table EI !LT12! 00160052
001700*260900!NDL! Update statuslist                             !LR02! 00170044
001800*010399!RM ! New module                                    !LG10! 00180036
001900*################################################################*00190001
002000 Environment Division.                                            00200001
002100 Configuration Section.                                           00210001
002200 Special-Names.                                                   00220001
002300     Decimal-Point Is Comma.                                      00230001
002400*                                                                 00240001
002500*################################################################*00250001
002600 Data Division.                                                   00260001
002700 Working-Storage Section.                                         00270001
002800*                                                                 00280001
002900 01  Filler.                                                      00290001
003000*                                                                 00300001
003100     05  W-IO-Length               Pic S9(04)              Comp.  00310001
003200     05  Ws-Code-Count             Pic S9(05)              Comp.  00320001
003300     05  Ws-Sys-Type               Pic  X(20).                    00330001
003400     05  Ws-Status                 Pic  X(20).                    00340001
003500*                                                                 00350001
003600     05  WD-Length                 Pic  Z.ZZ9.                    00360001
003700*                                                                 00370001
003800     05  Ws-Table-Source           Pic  X(16).                    00380016
003900     05  Ws-Table-Dest             Pic  X(16).                    00390016
004000*                                                                 00400016
004100*----------------------------------------------------------------*00410001
004200* Internal area:                                                  00420001
004300*                                                                 00430001
004400 01  W-Int-IO-Area.                                               00440001
004500     Copy R115L140.                                               00450001
004600*                                                                 00460001
004700*----------------------------------------------------------------*00470001
004800* Assorted copy-areas:                                            00480001
004900*                                                                 00490001
005000 01  Filler.                                                      00500011
005100     COPY R115IMC0.                                               00510011
005200 01  Filler.                                                      00520001
005300     COPY R115ICC0.                                               00530003
005400 01  Filler.                                                      00540001
005500     COPY R115IRP0.                                               00550008
005600 01  Filler.                                                      00560033
005700     COPY R115ITP0.                                               00570033
005800 01  Filler.                                                      00580001
005900     COPY R115IEI0.                                               00590008
006000 01  Filler.                                                      00600001
006100     COPY R115ICA0.                                               00610011
006200 01  Filler.                                                      00620011
006300     COPY R115IPA0.                                               00630011
006400 01  Filler.                                                      00640014
006500     COPY R115IPC0.                                               00650014
006600 01  Filler.                                                      00660014
006700     COPY R115ISE0.                                               00670014
006800 01  Filler.                                                      00680014
006900     COPY R115ICH0.                                               00690014
007000 01  Filler.                                                      00700016
007100     COPY R115ILM0.                                               00710016
007200 01  Filler.                                                      00720016
007300     COPY R115ILL0.                                               00730016
007400 01  Filler.                                                      00740032
007500     COPY R115IWM0.                                               00750032
007600 01  Filler.                                                      00760032
007700     COPY R115IWF0.                                               00770032
007800 01  Filler.                                                      00780055
007900     COPY R115ICT0.                                               00790055
008000*                                                                 00800001
008100     Copy R7918030.                                               00810001
008200     Copy R115L040.                                               00820035
008300     COPY R115X000.                                               00830001
008400*################################################################.00840001
008500 Linkage Section.                                                 00850001
008600*                                                                 00860001
008700 01  L-Ext-IO-Area                 Pic  X(560).                   00870001
008800 Copy R7919999.                                                   00880001
008900*                                                                 00890001
009000*################################################################.00900001
009100 Procedure Division                Using L-Ext-IO-Area            00910001
009200                                         R7919999-Error-Area.     00920001
009300*                                                                 00930001
009400 A000-Main                         Section.                       00940001
009500*                                                                 00950001
009600     Perform B000-Initialize                                      00960001
009700*                                                                 00970001
009800     Perform ZI00-Konv-Input-Version                              00980001
009900     Perform C000-Interface                                       00990001
010000     Perform ZO00-Konv-Output-Version                             01000001
010100*                                                                 01010001
010200     Goback.                                                      01020001
010300*################################################################*01030001
010400 B000-Initialize                   Section.                       01040001
010500*                                                                 01050001
010600     Set   R7919999-Return-OK      To    True                     01060001
010700*                                                                 01070001
010800     .                                                            01080001
010900*################################################################.01090001
011000 C000-Interface                    Section.                       01100001
011100*                                                                 01110001
011200     Initialize                          R115IMC0-Main-Contract   01120025
011300     Set   R115IMC0-In-Actual      To    True                     01130025
011400     Perform E100-Read-MC                                         01140006
011500*                                                                 01150025
011600     Perform C100-Check-Shadow-Action                             01160006
011700*                                                                 01170003
011800     If  R115L140-Delete-Shadow                                   01180046
011900         Perform H000-Delete-Shadow                               01190046
012000     Else                                                         01200046
012100         Perform D000-Shadow                                      01210046
012200     End-If                                                       01220046
012300*                                                                 01230046
012400*                                                                 01240046
012500*    26.09.00  (Update statuslist)                                01250046
012600*                                                                 01260046
012700     Perform C200-Update-Statuslist                               01270047
012800*                                                                 01280002
012900     .                                                            01290001
013000*################################################################.01300001
013100 C100-Check-Shadow-Action          Section.                       01310003
013200*                                                                 01320001
013300     If   R115L140-Function          = Spaces                     01330002
013400       or R115L140-Medium            = Spaces                     01340002
013500*                                                                 01350002
013600         Initialize                   R7918030-ErrorMessage       01360002
013700         Move  'TF-SY-FUNC-AND-MEDIUM'                            01370002
013800                                   To R7918030-In-MessageCode     01380002
013900         Perform Z000-Error-Message                               01390002
014000*                                                                 01400002
014100         Move  'C102'              To R7919999-Paragraph          01410002
014200         Perform Z900-Abend                                       01420002
014300*                                                                 01430002
014400     End-If                                                       01440002
014500*                                                                 01450002
014600     If    Not R115L140-Create-Shadow                             01460003
014700       and Not R115L140-Accept-Shadow                             01470002
014800       and Not R115L140-Delete-Shadow                             01480028
014900*                                                                 01490002
015000         Initialize                   R7918030-ErrorMessage       01500002
015100         Move  'TF-SY-INV-SHADOW-ACTION'                          01510002
015200                                   To R7918030-In-MessageCode     01520002
015300         Move  'VAR1'                                             01530002
015400                                   To R7918030-In-Variable-Key (1)01540002
015500         Move  R115L140-Shadow-Action                             01550002
015600                                   To R7918030-In-Variable-Data(1)01560002
015700         Perform Z000-Error-Message                               01570002
015800*                                                                 01580002
015900         Move  'C103'              To R7919999-Paragraph          01590002
016000         Perform Z700-Error-AE                                    01600007
016100*                                                                 01610002
016200     End-If                                                       01620002
016300*                                                                 01630002
016400     If   R115IMC0-In-Progress-Yes                                01640002
016500      and R115L140-Create-Shadow                                  01650002
016600         Initialize                   R7918030-ErrorMessage       01660002
016700         Move  'TF-SY-SHADOW-AE'                                  01670002
016800                                   To R7918030-In-MessageCode     01680002
016900         Perform Z000-Error-Message                               01690002
017000*                                                                 01700002
017100         Move  'C104'              To R7919999-Paragraph          01710031
017200         Perform Z700-Error-AE                                    01720007
017300*                                                                 01730002
017400     End-If                                                       01740002
017500*                                                                 01750002
017600     If     R115IMC0-In-Progress-No                               01760028
017700      and ( R115L140-Accept-Shadow                                01770028
017800        or  R115L140-Delete-Shadow  )                             01780050
017900         Initialize                   R7918030-ErrorMessage       01790002
018000         Move  'TF-SY-SHADOW-NF'                                  01800002
018100                                   To R7918030-In-MessageCode     01810002
018200         Perform Z000-Error-Message                               01820002
018300*                                                                 01830002
018400         Move  'C105'              To R7919999-Paragraph          01840031
018500         Perform Z700-Error-AE                                    01850007
018600*                                                                 01860002
018700     End-If                                                       01870002
018800*                                                                 01880002
018900     Evaluate True                                                01890028
019000      When    R115L140-Create-Shadow                              01900028
019100         Move 'ACTUAL'             To Ws-Table-Source             01910016
019200         Move 'WORK  '             To Ws-Table-Dest               01920016
019300*                                                                 01930028
019400      When    R115L140-Accept-Shadow                              01940028
019500         Move 'WORK  '             To Ws-Table-Source             01950016
019600         Move 'ACTUAL'             To Ws-Table-Dest               01960016
019700*                                                                 01970028
019800      When    R115L140-Delete-Shadow                              01980028
019900         Move 'WORK  '             To Ws-Table-Source             01990028
020000         Move '      '             To Ws-Table-Dest               02000029
020100*                                                                 02010028
020200     End-Evaluate                                                 02020030
020300*                                                                 02030016
020400     .                                                            02040002
020500*################################################################*02050037
020600 C200-Update-Statuslist            Section.                       02060037
020700*                                                                 02070037
020800     Initialize                          R115L040-Count-Statuslist02080040
020900     Set   R115L040-Version        To    True                     02090040
021000*                                                                 02100040
021100     Move  R115L140-Fin-Inst-No    To    R115L040-In-Fin-Inst-No  02110038
021200     Move  R115L140-Contract-Type  To    R115L040-In-Contract-Type02120038
021300     Move  R115L140-Shadow-Action  To    R115L040-In-Operationtype02130042
021400*                                                                 02140037
021500     Call  'F115L040'              Using R115L040-Count-Statuslist02150037
021600                                         R7919999-Error-Area      02160037
021700     End-Call                                                     02170037
021800*                                                                 02180037
021900     Evaluate True                                                02190037
022000       When R7919999-Return-Abend                                 02200037
022100         Move  'C201'              To    R7919999-Paragraph       02210037
022200         Perform Z900-Abend                                       02220037
022300*                                                                 02230037
022400       When R7919999-Return-Error                                 02240037
022500         Move  'C202'              To R7919999-Paragraph          02250037
022600         Perform Z700-Error-AE                                    02260037
022700*                                                                 02270037
022800     End-Evaluate                                                 02280037
022900*                                                                 02290037
023000     .                                                            02300037
023100*                                                                 02310037
023200*################################################################.02320003
023300 D000-Shadow                         Section.                     02330017
023400*                                                                 02340003
023500     Perform E110-Handle-MC                                       02350025
023600*                                                                 02360013
023700     Perform E200-Handle-CC                                       02370003
023800     Perform E300-Handle-RP                                       02380024
023900     Perform E400-Handle-EI                                       02390024
024000     Perform E500-Handle-CA                                       02400024
024100     Perform E600-Handle-PA                                       02410024
024200     Perform E700-Handle-SE                                       02420024
024300     Perform E800-Handle-PC                                       02430024
024400     Perform E900-Handle-CH                                       02440024
024500     Perform F000-Handle-LM                                       02450024
024600     Perform F100-Handle-LL                                       02460024
024700     Perform F200-Handle-WM                                       02470032
024800     Perform F300-Handle-WF                                       02480032
024900     Perform F400-Handle-TP                                       02490033
025000*                                                                 02500003
025100     .                                                            02510003
025200*################################################################*02520002
025300 E100-Read-MC                    Section.                         02530003
025400*                                                                 02540002
025500     Set   R115IMC0-In-Select      To    True                     02550002
025600*                                                                 02560002
025700     Set   R115IMC0-Version        To    True                     02570002
025800     Move  R115L140-Fin-Inst-No    To    R115IMC0-In-Fin-Inst-No  02580002
025900     Move  R115L140-Contract-Type  To    R115IMC0-In-Contract-Type02590002
026000     Move  R115L140-Contract-No    To    R115IMC0-In-Contract-No  02600002
026100*                                                                 02610002
026200     Call  'F115IMC0'              Using R115IMC0-Main-Contract   02620002
026300                                         R7919999-Error-Area      02630002
026400     End-Call                                                     02640002
026500*                                                                 02650002
026600     Evaluate True                                                02660002
026700       When R7919999-Return-Abend                                 02670002
026800         Move  'E101'              To    R7919999-Paragraph       02680013
026900         Perform Z900-Abend                                       02690002
027000*                                                                 02700002
027100       When R7919999-Return-Error                                 02710002
027200         Move  'E102'              To    R7919999-Paragraph       02720013
027300         Perform Z700-Error-AE                                    02730002
027400*                                                                 02740002
027500     End-Evaluate                                                 02750002
027600*                                                                 02760002
027700     .                                                            02770002
027800*################################################################*02780013
027900 E110-Handle-MC                  Section.                         02790025
028000*                                                                 02800013
028100     Initialize                          R115IMC0-Main-Contract   02810025
028200     Move  Ws-Table-Source         To    R115IMC0-In-Table-Version02820026
028300     Perform E100-Read-MC                                         02830025
028400*                                                                 02840025
028500     If R115L140-Accept-Shadow                                    02850025
028600        Move  Ws-Table-Dest        To    R115IMC0-In-Table-Version02860026
028700        Perform E140-Delete-MC                                    02870025
028800     End-If                                                       02880025
028900                                                                  02890025
029000     If R115L140-Accept-Shadow                                    02900025
029100        Set  R115IMC0-In-Progress-No                              02910025
029200                                   To    True                     02920025
029300     Else                                                         02930025
029400        Set  R115IMC0-In-Progress-Yes                             02940025
029500                                   To    True                     02950025
029600     End-If                                                       02960025
029700*                                                                 02970025
029800     Move  Ws-Table-Dest           To    R115IMC0-In-Table-Version02980026
029900     Perform E130-Create-MC                                       02990025
030000*                                                                 03000025
030100     If R115L140-Accept-Shadow                                    03010025
030200        Move  Ws-Table-Source      To    R115IMC0-In-Table-Version03020026
030300        Perform E140-Delete-MC                                    03030025
030400     Else                                                         03040025
030500        Move  Ws-Table-Source      To    R115IMC0-In-Table-Version03050026
030600        Perform E120-Update-MC                                    03060025
030700     End-If                                                       03070025
030800*                                                                 03080013
030900     .                                                            03090013
031000*################################################################*03100025
031100 E120-Update-MC                    Section.                       03110026
031200*                                                                 03120025
031300     Set   R115IMC0-In-Update      To    True                     03130025
031400*                                                                 03140025
031500     Call  'F115IMC0'              Using R115IMC0-Main-Contract   03150025
031600                                         R7919999-Error-Area      03160025
031700     End-Call                                                     03170025
031800*                                                                 03180025
031900     Evaluate True                                                03190025
032000       When R7919999-Return-Abend                                 03200025
032100         Move  'E121'              To    R7919999-Paragraph       03210025
032200         Perform Z900-Abend                                       03220025
032300*                                                                 03230025
032400       When R7919999-Return-Error                                 03240025
032500         Move  'E122'              To    R7919999-Paragraph       03250025
032600         Perform Z900-Abend                                       03260025
032700*                                                                 03270025
032800     End-Evaluate                                                 03280025
032900*                                                                 03290025
033000     .                                                            03300025
033100*################################################################*03310025
033200 E130-Create-MC                  Section.                         03320025
033300*                                                                 03330025
033400     Set   R115IMC0-In-Insert      To    True                     03340025
033500*                                                                 03350025
033600     Call  'F115IMC0'              Using R115IMC0-Main-Contract   03360025
033700                                         R7919999-Error-Area      03370025
033800     End-Call                                                     03380025
033900*                                                                 03390025
034000     Evaluate True                                                03400025
034100       When R7919999-Return-Abend                                 03410025
034200         Move  'E131'              To    R7919999-Paragraph       03420025
034300         Perform Z900-Abend                                       03430025
034400*                                                                 03440025
034500       When R7919999-Return-Error                                 03450025
034600         Move  'E132'              To    R7919999-Paragraph       03460025
034700         Perform Z900-Abend                                       03470025
034800*                                                                 03480025
034900     End-Evaluate                                                 03490025
035000*                                                                 03500025
035100     .                                                            03510025
035200*################################################################*03520025
035300 E140-Delete-MC                  Section.                         03530025
035400*                                                                 03540025
035500     Set   R115IMC0-In-Delete      To    True                     03550025
035600*                                                                 03560025
035700     Call  'F115IMC0'              Using R115IMC0-Main-Contract   03570025
035800                                         R7919999-Error-Area      03580025
035900     End-Call                                                     03590025
036000*                                                                 03600025
036100     Evaluate True                                                03610025
036200       When R7919999-Return-Abend                                 03620025
036300         Move  'E141'              To    R7919999-Paragraph       03630025
036400         Perform Z900-Abend                                       03640025
036500*                                                                 03650025
036600       When R7919999-Return-Error                                 03660025
036700         Move  'E142'              To    R7919999-Paragraph       03670025
036800         Perform Z900-Abend                                       03680025
036900*                                                                 03690025
037000     End-Evaluate                                                 03700025
037100*                                                                 03710025
037200     .                                                            03720025
037300*################################################################*03730025
037400 E200-Handle-CC                  Section.                         03740003
037500*                                                                 03750003
037600     If  R115L140-Accept-Shadow                                   03760020
037700*                                                                 03770020
037800         Perform E211-Find-First-CC-Dest                          03780020
037900         Perform Until R7919999-Return-Error                      03790020
038000*                                                                 03800020
038100            Perform E260-Delete-CC-Dest                           03810020
038200*                                                                 03820020
038300            Perform E221-Find-Next-CC-Dest                        03830020
038400         End-Perform                                              03840020
038500     End-If                                                       03850020
038600*                                                                 03860020
038700     Perform E210-Find-First-CC-Source                            03870021
038800     Perform Until R7919999-Return-Error                          03880001
038900*                                                                 03890017
039000        Perform E240-Create-CC                                    03900003
039100*                                                                 03910016
039200        If  R115L140-Accept-Shadow                                03920016
039300            Perform E250-Delete-CC-Source                         03930017
039400        End-If                                                    03940016
039500*                                                                 03950001
039600        Perform E220-Find-Next-CC-Source                          03960021
039700     End-Perform                                                  03970001
039800*                                                                 03980001
039900     Initialize       R7919999-Error                              03990005
040000*                                                                 04000005
040100     .                                                            04010001
040200*################################################################*04020001
040300 E210-Find-First-CC-Source         Section.                       04030020
040400*                                                                 04040001
040500     Initialize                          R115ICC0-Contract-Code   04050003
040600     Set   R115ICC0-In-Get-1st     To    True                     04060003
040700     Move  Ws-Table-Source         To    R115ICC0-In-Table-Version04070020
040800     Perform E230-Find-CC                                         04080003
040900*                                                                 04090001
041000     .                                                            04100001
041100*################################################################*04110020
041200 E211-Find-First-CC-Dest           Section.                       04120020
041300*                                                                 04130020
041400     Initialize                          R115ICC0-Contract-Code   04140020
041500     Set   R115ICC0-In-Get-1st     To    True                     04150020
041600     Move  Ws-Table-Dest           To    R115ICC0-In-Table-Version04160020
041700     Perform E230-Find-CC                                         04170020
041800*                                                                 04180020
041900     .                                                            04190020
042000*################################################################*04200001
042100 E220-Find-Next-CC-Source          Section.                       04210020
042200*                                                                 04220001
042300     Initialize                          R115ICC0-Contract-Code   04230003
042400     Set   R115ICC0-In-Get-Next    To    True                     04240003
042500     Move  Ws-Table-Source         To    R115ICC0-In-Table-Version04250020
042600     Perform E230-Find-CC                                         04260020
042700*                                                                 04270001
042800     .                                                            04280001
042900*################################################################*04290020
043000 E221-Find-Next-CC-Dest            Section.                       04300020
043100*                                                                 04310020
043200     Initialize                          R115ICC0-Contract-Code   04320020
043300     Set   R115ICC0-In-Get-Next    To    True                     04330020
043400     Move  Ws-Table-Dest           To    R115ICC0-In-Table-Version04340020
043500     Perform E230-Find-CC                                         04350020
043600*                                                                 04360020
043700     .                                                            04370020
043800*################################################################*04380001
043900 E230-Find-CC                      Section.                       04390003
044000*                                                                 04400001
044100     Set   R115ICC0-Version        To    True                     04410003
044200     Move  R115L140-Fin-Inst-No    To    R115ICC0-In-Fin-Inst-No  04420003
044300     Move  R115L140-Contract-Type  To    R115ICC0-In-Contract-Type04430003
044400     Move  R115L140-Contract-No    To    R115ICC0-In-Contract-No  04440003
044500*                                                                 04450001
044600     Set   R115ICC0-In-Rel-Any     To    True                     04460004
044700*                                                                 04470003
044800     Call  'F115ICC0'              Using R115ICC0-Contract-Code   04480003
044900                                         R7919999-Error-Area      04490001
045000     End-Call                                                     04500001
045100*                                                                 04510001
045200     Evaluate True                                                04520001
045300       When R7919999-Return-Abend                                 04530001
045400         Move  'E231'              To    R7919999-Paragraph       04540003
045500         Perform Z900-Abend                                       04550001
045600*                                                                 04560001
045700     End-Evaluate                                                 04570001
045800*                                                                 04580001
045900     .                                                            04590001
046000*################################################################*04600003
046100 E240-Create-CC                    Section.                       04610003
046200*                                                                 04620003
046300     Move  Ws-Table-Dest           To    R115ICC0-In-Table-Version04630016
046400     Set   R115ICC0-In-Insert      To    True                     04640003
046500*                                                                 04650003
046600     Call  'F115ICC0'              Using R115ICC0-Contract-Code   04660003
046700                                         R7919999-Error-Area      04670003
046800     End-Call                                                     04680003
046900*                                                                 04690003
047000     Evaluate True                                                04700003
047100       When R7919999-Return-Abend                                 04710003
047200         Move  'E241'              To    R7919999-Paragraph       04720003
047300         Perform Z900-Abend                                       04730003
047400*                                                                 04740003
047500       When R7919999-Return-Error                                 04750003
047600         Move  'E242'              To    R7919999-Paragraph       04760003
047700         Perform Z700-Error-AE                                    04770003
047800*                                                                 04780003
047900     End-Evaluate                                                 04790003
048000*                                                                 04800003
048100     .                                                            04810003
048200*################################################################*04820016
048300 E250-Delete-CC-Source             Section.                       04830017
048400*                                                                 04840016
048500     Move  R115ICC0-CA-Currency    To    R115ICC0-In-CA-Currency  04850022
048600     Move  R115ICC0-PA-Seq-No      To    R115ICC0-In-PA-Seq-No    04860022
048700     Move  R115ICC0-ST-Type        To    R115ICC0-In-ST-Type      04870022
048800     Move  R115ICC0-SC-Contr-Type  To    R115ICC0-In-SC-Contr-Type04880022
048900     Move  R115ICC0-SC-Code        To    R115ICC0-In-SC-Code      04890022
049000     Move  R115ICC0-Operation-Type To   R115ICC0-In-Operation-Type04900022
049100*                                                                 04910022
049200     Move  Ws-Table-Source         To    R115ICC0-In-Table-Version04920022
049300     Set   R115ICC0-In-Delete      To    True                     04930016
049400*                                                                 04940016
049500     Call  'F115ICC0'              Using R115ICC0-Contract-Code   04950016
049600                                         R7919999-Error-Area      04960016
049700     End-Call                                                     04970016
049800*                                                                 04980016
049900     Evaluate True                                                04990016
050000       When R7919999-Return-Abend                                 05000016
050100         Move  'E251'              To    R7919999-Paragraph       05010016
050200         Perform Z900-Abend                                       05020016
050300*                                                                 05030016
050400       When R7919999-Return-Error                                 05040016
050500         Move  'E252'              To    R7919999-Paragraph       05050016
050600         Perform Z700-Error-AE                                    05060016
050700*                                                                 05070016
050800     End-Evaluate                                                 05080016
050900*                                                                 05090016
051000     .                                                            05100016
051100*################################################################*05110017
051200 E260-Delete-CC-Dest               Section.                       05120017
051300*                                                                 05130017
051400     Move  R115ICC0-CA-Currency    To    R115ICC0-In-CA-Currency  05140019
051500     Move  R115ICC0-PA-Seq-No      To    R115ICC0-In-PA-Seq-No    05150019
051600     Move  R115ICC0-ST-Type        To    R115ICC0-In-ST-Type      05160019
051700     Move  R115ICC0-SC-Contr-Type  To    R115ICC0-In-SC-Contr-Type05170019
051800     Move  R115ICC0-SC-Code        To    R115ICC0-In-SC-Code      05180019
051900     Move  R115ICC0-Operation-Type To   R115ICC0-In-Operation-Type05190019
052000*                                                                 05200018
052100     Move  Ws-Table-Dest           To    R115ICC0-In-Table-Version05210017
052200     Set   R115ICC0-In-Delete      To    True                     05220017
052300*                                                                 05230017
052400     Call  'F115ICC0'              Using R115ICC0-Contract-Code   05240017
052500                                         R7919999-Error-Area      05250017
052600     End-Call                                                     05260017
052700*                                                                 05270017
052800     Evaluate True                                                05280017
052900       When R7919999-Return-Abend                                 05290017
053000         Move  'E251'              To    R7919999-Paragraph       05300017
053100         Perform Z900-Abend                                       05310017
053200*                                                                 05320017
053300       When R7919999-Return-Error                                 05330017
053400         Move  'E252'              To    R7919999-Paragraph       05340017
053500         Perform Z700-Error-AE                                    05350017
053600*                                                                 05360017
053700     End-Evaluate                                                 05370017
053800*                                                                 05380017
053900     .                                                            05390017
054000*################################################################*05400017
054100 E300-Handle-RP                  Section.                         05410008
054200*                                                                 05420008
054300     If  R115L140-Accept-Shadow                                   05430023
054400*                                                                 05440023
054500         Perform E311-Find-First-RP-Dest                          05450023
054600         Perform Until R7919999-Return-Error                      05460023
054700*                                                                 05470023
054800            Perform E360-Delete-RP-Dest                           05480023
054900*                                                                 05490023
055000            Perform E321-Find-Next-RP-Dest                        05500023
055100         End-Perform                                              05510023
055200     End-If                                                       05520023
055300*                                                                 05530023
055400     Perform E310-Find-First-RP-Source                            05540023
055500     Perform Until R7919999-Return-Error                          05550008
055600*                                                                 05560008
055700        Perform E340-Create-RP                                    05570008
055800*                                                                 05580008
055900        If  R115L140-Accept-Shadow                                05590016
056000            Perform E350-Delete-RP-Source                         05600023
056100        End-If                                                    05610016
056200*                                                                 05620016
056300        Perform E320-Find-Next-RP-Source                          05630023
056400     End-Perform                                                  05640008
056500*                                                                 05650008
056600     Initialize       R7919999-Error                              05660008
056700*                                                                 05670008
056800     .                                                            05680008
056900*################################################################*05690008
057000 E310-Find-First-RP-Source         Section.                       05700023
057100*                                                                 05710008
057200     Initialize                          R115IRP0-Related-Party   05720008
057300     Set   R115IRP0-In-Get-1st     To    True                     05730008
057400     Move  Ws-Table-Source         To    R115IRP0-In-Table-Version05740023
057500     Perform E330-Find-RP                                         05750008
057600*                                                                 05760008
057700     .                                                            05770008
057800*################################################################*05780023
057900 E311-Find-First-RP-Dest           Section.                       05790023
058000*                                                                 05800023
058100     Initialize                          R115IRP0-Related-Party   05810023
058200     Set   R115IRP0-In-Get-1st     To    True                     05820023
058300     Move  Ws-Table-Dest           To    R115IRP0-In-Table-Version05830023
058400     Perform E330-Find-RP                                         05840023
058500*                                                                 05850023
058600     .                                                            05860023
058700*################################################################*05870008
058800 E320-Find-Next-RP-Source          Section.                       05880023
058900*                                                                 05890008
059000     Initialize                          R115IRP0-Related-Party   05900008
059100     Set   R115IRP0-In-Get-Next    To    True                     05910008
059200     Move  Ws-Table-Source         To    R115IRP0-In-Table-Version05920023
059300     Perform E330-Find-RP                                         05930008
059400*                                                                 05940008
059500     .                                                            05950008
059600*################################################################*05960023
059700 E321-Find-Next-RP-Dest            Section.                       05970023
059800*                                                                 05980023
059900     Initialize                          R115IRP0-Related-Party   05990023
060000     Set   R115IRP0-In-Get-Next    To    True                     06000023
060100     Move  Ws-Table-Dest           To    R115IRP0-In-Table-Version06010023
060200     Perform E330-Find-RP                                         06020023
060300*                                                                 06030023
060400     .                                                            06040023
060500*################################################################*06050008
060600 E330-Find-RP                      Section.                       06060008
060700*                                                                 06070008
060800*                                                                 06080008
060900     Set   R115IRP0-Version        To    True                     06090008
061000     Move  R115L140-Fin-Inst-No    To    R115IRP0-In-Fin-Inst-No  06100008
061100     Move  R115L140-Contract-Type  To    R115IRP0-In-Contract-Type06110008
061200     Move  R115L140-Contract-No    To    R115IRP0-In-Contract-No  06120008
061300*                                                                 06130008
061400     Set   R115IRP0-In-Rel-Any     To    True                     06140008
061500*                                                                 06150008
061600     Call  'F115IRP0'              Using R115IRP0-Related-Party   06160008
061700                                         R7919999-Error-Area      06170008
061800     End-Call                                                     06180008
061900*                                                                 06190008
062000     Evaluate True                                                06200008
062100       When R7919999-Return-Abend                                 06210008
062200         Move  'E231'              To    R7919999-Paragraph       06220008
062300         Perform Z900-Abend                                       06230008
062400*                                                                 06240008
062500     End-Evaluate                                                 06250008
062600*                                                                 06260008
062700     .                                                            06270008
062800*################################################################*06280008
062900 E340-Create-RP                    Section.                       06290008
063000*                                                                 06300008
063100     Move  Ws-Table-Dest           To    R115IRP0-In-Table-Version06310016
063200     Set   R115IRP0-In-Insert      To    True                     06320008
063300*                                                                 06330008
063400     Call  'F115IRP0'              Using R115IRP0-Related-Party   06340008
063500                                         R7919999-Error-Area      06350008
063600     End-Call                                                     06360008
063700*                                                                 06370008
063800     Evaluate True                                                06380008
063900       When R7919999-Return-Abend                                 06390008
064000         Move  'E241'              To    R7919999-Paragraph       06400008
064100         Perform Z900-Abend                                       06410008
064200*                                                                 06420008
064300       When R7919999-Return-Error                                 06430008
064400         Move  'E242'              To    R7919999-Paragraph       06440008
064500         Perform Z700-Error-AE                                    06450008
064600*                                                                 06460008
064700     End-Evaluate                                                 06470008
064800*                                                                 06480008
064900     .                                                            06490008
065000*################################################################*06500016
065100 E350-Delete-RP-Source             Section.                       06510023
065200*                                                                 06520016
065300     Move  Ws-Table-Source         To    R115IRP0-In-Table-Version06530016
065400     Set   R115IRP0-In-Delete      To    True                     06540016
065500*                                                                 06550016
065600     Move  R115IRP0-CA-Currency    To    R115IRP0-In-CA-Currency  06560023
065700     Move  R115IRP0-PA-Seq-No      To    R115IRP0-In-PA-Seq-No    06570023
065800     Move  R115IRP0-Role-Type      To    R115IRP0-In-Role-Type    06580023
065900     Move  R115IRP0-Relation       To    R115IRP0-In-Relation     06590023
066000*                                                                 06600023
066100     Call  'F115IRP0'              Using R115IRP0-Related-Party   06610016
066200                                         R7919999-Error-Area      06620016
066300     End-Call                                                     06630016
066400*                                                                 06640016
066500     Evaluate True                                                06650016
066600       When R7919999-Return-Abend                                 06660016
066700         Move  'E351'              To    R7919999-Paragraph       06670016
066800         Perform Z900-Abend                                       06680016
066900*                                                                 06690016
067000       When R7919999-Return-Error                                 06700016
067100         Move  'E352'              To    R7919999-Paragraph       06710016
067200         Perform Z700-Error-AE                                    06720016
067300*                                                                 06730016
067400     End-Evaluate                                                 06740016
067500*                                                                 06750016
067600     .                                                            06760016
067700*################################################################*06770023
067800 E360-Delete-RP-Dest               Section.                       06780023
067900*                                                                 06790023
068000     Move  Ws-Table-Dest           To    R115IRP0-In-Table-Version06800023
068100     Set   R115IRP0-In-Delete      To    True                     06810023
068200*                                                                 06820023
068300     Move  R115IRP0-CA-Currency    To    R115IRP0-In-CA-Currency  06830023
068400     Move  R115IRP0-PA-Seq-No      To    R115IRP0-In-PA-Seq-No    06840023
068500     Move  R115IRP0-Role-Type      To    R115IRP0-In-Role-Type    06850023
068600     Move  R115IRP0-Relation       To    R115IRP0-In-Relation     06860023
068700*                                                                 06870023
068800     Call  'F115IRP0'              Using R115IRP0-Related-Party   06880023
068900                                         R7919999-Error-Area      06890023
069000     End-Call                                                     06900023
069100*                                                                 06910023
069200     Evaluate True                                                06920023
069300       When R7919999-Return-Abend                                 06930023
069400         Move  'E361'              To    R7919999-Paragraph       06940023
069500         Perform Z900-Abend                                       06950023
069600*                                                                 06960023
069700       When R7919999-Return-Error                                 06970023
069800         Move  'E362'              To    R7919999-Paragraph       06980023
069900         Perform Z700-Error-AE                                    06990023
070000*                                                                 07000023
070100     End-Evaluate                                                 07010023
070200*                                                                 07020023
070300     .                                                            07030023
070400*################################################################*07040023
070500 E400-Handle-EI                  Section.                         07050008
070600*                                                                 07060008
070700     If  R115L140-Accept-Shadow                                   07070023
070800*                                                                 07080023
070900         Perform E411-Find-First-EI-Dest                          07090023
071000         Perform Until R7919999-Return-Error                      07100023
071100*                                                                 07110023
071200            Perform E460-Delete-EI-Dest                           07120023
071300*                                                                 07130023
071400            Perform E421-Find-Next-EI-Dest                        07140023
071500         End-Perform                                              07150023
071600     End-If                                                       07160023
071700*                                                                 07170023
071800     Perform E410-Find-First-EI-Source                            07180023
071900     Perform Until R7919999-Return-Error                          07190008
072000*                                                                 07200008
072100        Perform E440-Create-EI                                    07210008
072200*                                                                 07220008
072300        If  R115L140-Accept-Shadow                                07230016
072400            Perform E450-Delete-EI-Source                         07240023
072500        End-If                                                    07250016
072600*                                                                 07260016
072700        Perform E420-Find-Next-EI-Source                          07270023
072800     End-Perform                                                  07280008
072900*                                                                 07290008
073000     Initialize       R7919999-Error                              07300008
073100*                                                                 07310008
073200     .                                                            07320008
073300*################################################################*07330008
073400 E410-Find-First-EI-Source         Section.                       07340023
073500*                                                                 07350008
073600     Initialize                          R115IEI0-Event-Info      07360008
073700     Set   R115IEI0-In-Get-1st     To    True                     07370008
073800     Move  Ws-Table-Source         To    R115IEI0-In-Table-Version07380023
073900     Perform E430-Find-EI                                         07390008
074000*                                                                 07400008
074100     .                                                            07410008
074200*################################################################*07420023
074300 E411-Find-First-EI-Dest           Section.                       07430023
074400*                                                                 07440023
074500     Initialize                          R115IEI0-Event-Info      07450023
074600     Set   R115IEI0-In-Get-1st     To    True                     07460023
074700     Move  Ws-Table-Dest           To    R115IEI0-In-Table-Version07470023
074800     Perform E430-Find-EI                                         07480023
074900*                                                                 07490023
075000     .                                                            07500023
075100*################################################################*07510023
075200 E420-Find-Next-EI-Source          Section.                       07520023
075300*                                                                 07530023
075400     Initialize                          R115IEI0-Event-Info      07540023
075500     Set   R115IEI0-In-Get-Next    To    True                     07550023
075600     Move  Ws-Table-Source         To    R115IEI0-In-Table-Version07560023
075700     Perform E430-Find-EI                                         07570023
075800*                                                                 07580023
075900     .                                                            07590023
076000*################################################################*07600023
076100 E421-Find-Next-EI-Dest            Section.                       07610023
076200*                                                                 07620023
076300     Initialize                          R115IEI0-Event-Info      07630023
076400     Set   R115IEI0-In-Get-Next    To    True                     07640023
076500     Move  Ws-Table-Dest           To    R115IEI0-In-Table-Version07650023
076600     Perform E430-Find-EI                                         07660023
076700*                                                                 07670023
076800     .                                                            07680023
076900*################################################################*07690023
077000 E430-Find-EI                      Section.                       07700008
077100*                                                                 07710008
077200     Set   R115IEI0-Version        To    True                     07720008
077300     Move  R115L140-Fin-Inst-No    To    R115IEI0-In-Fin-Inst-No  07730008
077400     Move  R115L140-Contract-Type  To    R115IEI0-In-Contract-Type07740008
077500     Move  R115L140-Contract-No    To    R115IEI0-In-Contract-No  07750008
077600*                                                                 07760008
077700     Set   R115IEI0-In-Rel-Any     To    True                     07770008
077800*                                                                 07780008
077900     Call  'F115IEI0'              Using R115IEI0-Event-Info      07790008
078000                                         R7919999-Error-Area      07800008
078100     End-Call                                                     07810008
078200*                                                                 07820008
078300     Evaluate True                                                07830008
078400       When R7919999-Return-Abend                                 07840008
078500         Move  'E431'              To    R7919999-Paragraph       07850008
078600         Perform Z900-Abend                                       07860008
078700*                                                                 07870008
078800     End-Evaluate                                                 07880008
078900*                                                                 07890008
079000     .                                                            07900008
079100*################################################################*07910008
079200 E440-Create-EI                    Section.                       07920008
079300*                                                                 07930008
079400*ndl                                                              07940047
079500     If  R115IMC0-Status = 'TERMINATED'                           07950049
079600         Move  'HIST'              To    R115IEI0-In-Table-Version07960046
079700     Else                                                         07970046
079800         Move  Ws-Table-Dest       To    R115IEI0-In-Table-Version07980046
079900     End-If                                                       07990046
080000*                                                                 08000046
080100     Set   R115IEI0-In-Insert      To    True                     08010008
080200*                                                                 08020008
080300     Call  'F115IEI0'              Using R115IEI0-Event-Info      08030008
080400                                         R7919999-Error-Area      08040008
080500     End-Call                                                     08050008
080600*                                                                 08060008
080700     Evaluate True                                                08070008
080800       When R7919999-Return-Abend                                 08080008
080900         Move  'E441'              To    R7919999-Paragraph       08090008
081000         Perform Z900-Abend                                       08100008
081100*                                                                 08110008
081200       When R7919999-Return-Error                                 08120008
081300         Move  'E442'              To    R7919999-Paragraph       08130008
081400         Perform Z700-Error-AE                                    08140008
081500*                                                                 08150008
081600     End-Evaluate                                                 08160008
081700*                                                                 08170008
081800     .                                                            08180008
081900*################################################################*08190016
082000 E450-Delete-EI-Source             Section.                       08200023
082100*                                                                 08210016
082200     Move  Ws-Table-Source         To    R115IEI0-In-Table-Version08220016
082300     Set   R115IEI0-In-Delete      To    True                     08230016
082400*                                                                 08240016
082500     Move  R115IEI0-CA-Currency    To    R115IEI0-In-CA-Currency  08250023
082600     Move  R115IEI0-PA-Seq-No      To    R115IEI0-In-PA-Seq-No    08260023
082700     Move  R115IEI0-Event-Type     To    R115IEI0-In-Event-Type   08270023
082800     Move  R115IEI0-Relation       To    R115IEI0-In-Relation     08280023
082900*                                                                 08290023
083000     Call  'F115IEI0'              Using R115IEI0-Event-Info      08300016
083100                                         R7919999-Error-Area      08310016
083200     End-Call                                                     08320016
083300*                                                                 08330016
083400     Evaluate True                                                08340016
083500       When R7919999-Return-Abend                                 08350016
083600         Move  'E451'              To    R7919999-Paragraph       08360016
083700         Perform Z900-Abend                                       08370016
083800*                                                                 08380016
083900       When R7919999-Return-Error                                 08390016
084000         Move  'E452'              To    R7919999-Paragraph       08400016
084100         Perform Z700-Error-AE                                    08410016
084200*                                                                 08420016
084300     End-Evaluate                                                 08430016
084400*                                                                 08440016
084500     .                                                            08450016
084600*################################################################*08460023
084700 E460-Delete-EI-Dest               Section.                       08470023
084800*                                                                 08480023
084900     Move  Ws-Table-Dest           To    R115IEI0-In-Table-Version08490023
085000     Set   R115IEI0-In-Delete      To    True                     08500023
085100*                                                                 08510023
085200     Move  R115IEI0-CA-Currency    To    R115IEI0-In-CA-Currency  08520023
085300     Move  R115IEI0-PA-Seq-No      To    R115IEI0-In-PA-Seq-No    08530023
085400     Move  R115IEI0-Event-Type     To    R115IEI0-In-Event-Type   08540023
085500     Move  R115IEI0-Relation       To    R115IEI0-In-Relation     08550023
085600*                                                                 08560023
085700     Call  'F115IEI0'              Using R115IEI0-Event-Info      08570023
085800                                         R7919999-Error-Area      08580023
085900     End-Call                                                     08590023
086000*                                                                 08600023
086100     Evaluate True                                                08610023
086200       When R7919999-Return-Abend                                 08620023
086300         Move  'E461'              To    R7919999-Paragraph       08630023
086400         Perform Z900-Abend                                       08640023
086500*                                                                 08650023
086600       When R7919999-Return-Error                                 08660023
086700         Move  'E462'              To    R7919999-Paragraph       08670023
086800         Perform Z700-Error-AE                                    08680023
086900*                                                                 08690023
087000     End-Evaluate                                                 08700023
087100*                                                                 08710023
087200     .                                                            08720023
087300*################################################################*08730023
087400 E500-Handle-CA                  Section.                         08740011
087500*                                                                 08750011
087600     If  R115L140-Accept-Shadow                                   08760023
087700*                                                                 08770023
087800         Perform E511-Find-First-CA-Dest                          08780023
087900         Perform Until R7919999-Return-Error                      08790023
088000*                                                                 08800023
088100            Perform E560-Delete-CA-Dest                           08810023
088200*                                                                 08820023
088300            Perform E521-Find-Next-CA-Dest                        08830023
088400         End-Perform                                              08840023
088500     End-If                                                       08850023
088600*                                                                 08860023
088700     Perform E510-Find-First-CA-Source                            08870023
088800     Perform Until R7919999-Return-Error                          08880011
088900*                                                                 08890011
089000        Perform E540-Create-CA                                    08900011
089100*                                                                 08910011
089200        If  R115L140-Accept-Shadow                                08920016
089300            Perform E550-Delete-CA-Source                         08930023
089400        End-If                                                    08940016
089500*                                                                 08950016
089600        Perform E520-Find-Next-CA-Source                          08960023
089700     End-Perform                                                  08970011
089800*                                                                 08980011
089900     Initialize       R7919999-Error                              08990011
090000*                                                                 09000011
090100     .                                                            09010011
090200*################################################################*09020011
090300 E510-Find-First-CA-Source         Section.                       09030023
090400*                                                                 09040011
090500     Initialize                          R115ICA0-Contract-Amount 09050012
090600     Set   R115ICA0-In-Get-1st     To    True                     09060011
090700     Move  Ws-Table-Source         To    R115ICA0-In-Table-Version09070023
090800     Perform E530-Find-CA                                         09080011
090900*                                                                 09090011
091000     .                                                            09100011
091100*################################################################*09110023
091200 E511-Find-First-CA-Dest           Section.                       09120023
091300*                                                                 09130023
091400     Initialize                          R115ICA0-Contract-Amount 09140023
091500     Set   R115ICA0-In-Get-1st     To    True                     09150023
091600     Move  Ws-Table-Dest           To    R115ICA0-In-Table-Version09160023
091700     Perform E530-Find-CA                                         09170023
091800*                                                                 09180023
091900     .                                                            09190023
092000*################################################################*09200011
092100 E520-Find-Next-CA-Source          Section.                       09210023
092200*                                                                 09220011
092300     Initialize                          R115ICA0-Contract-Amount 09230012
092400     Set   R115ICA0-In-Get-Next    To    True                     09240011
092500     Move  Ws-Table-Source         To    R115ICA0-In-Table-Version09250023
092600     Perform E530-Find-CA                                         09260011
092700*                                                                 09270011
092800     .                                                            09280011
092900*################################################################*09290023
093000 E521-Find-Next-CA-Dest            Section.                       09300023
093100*                                                                 09310023
093200     Initialize                          R115ICA0-Contract-Amount 09320023
093300     Set   R115ICA0-In-Get-Next    To    True                     09330023
093400     Move  Ws-Table-Dest           To    R115ICA0-In-Table-Version09340023
093500     Perform E530-Find-CA                                         09350023
093600*                                                                 09360023
093700     .                                                            09370023
093800*################################################################*09380011
093900 E530-Find-CA                      Section.                       09390011
094000*                                                                 09400011
094100     Set   R115ICA0-Version        To    True                     09410011
094200     Move  R115L140-Fin-Inst-No    To    R115ICA0-In-Fin-Inst-No  09420011
094300     Move  R115L140-Contract-Type  To    R115ICA0-In-Contract-Type09430011
094400     Move  R115L140-Contract-No    To    R115ICA0-In-Contract-No  09440011
094500*                                                                 09450011
094600     Call  'F115ICA0'              Using R115ICA0-Contract-Amount 09460012
094700                                         R7919999-Error-Area      09470011
094800     End-Call                                                     09480011
094900*                                                                 09490011
095000     Evaluate True                                                09500011
095100       When R7919999-Return-Abend                                 09510011
095200         Move  'E531'              To    R7919999-Paragraph       09520011
095300         Perform Z900-Abend                                       09530011
095400*                                                                 09540011
095500     End-Evaluate                                                 09550011
095600*                                                                 09560011
095700     .                                                            09570011
095800*################################################################*09580011
095900 E540-Create-CA                    Section.                       09590011
096000*                                                                 09600011
096100     Move  Ws-Table-Dest           To    R115ICA0-In-Table-Version09610016
096200     Set   R115ICA0-In-Insert      To    True                     09620011
096300*                                                                 09630011
096400     Call  'F115ICA0'              Using R115ICA0-Contract-Amount 09640012
096500                                         R7919999-Error-Area      09650011
096600     End-Call                                                     09660011
096700*                                                                 09670011
096800     Evaluate True                                                09680011
096900       When R7919999-Return-Abend                                 09690011
097000         Move  'E541'              To    R7919999-Paragraph       09700011
097100         Perform Z900-Abend                                       09710011
097200*                                                                 09720011
097300       When R7919999-Return-Error                                 09730011
097400         Move  'E542'              To    R7919999-Paragraph       09740011
097500         Perform Z700-Error-AE                                    09750011
097600*                                                                 09760011
097700     End-Evaluate                                                 09770011
097800*                                                                 09780011
097900     .                                                            09790011
098000*################################################################*09800016
098100 E550-Delete-CA-Source             Section.                       09810023
098200*                                                                 09820016
098300     Move  Ws-Table-Source         To    R115ICA0-In-Table-Version09830016
098400     Set   R115ICA0-In-Delete      To    True                     09840016
098500*                                                                 09850016
098600     Move  R115ICA0-Currency       To    R115ICA0-In-Currency     09860023
098700*                                                                 09870023
098800     Call  'F115ICA0'              Using R115ICA0-Contract-Amount 09880016
098900                                         R7919999-Error-Area      09890016
099000     End-Call                                                     09900016
099100*                                                                 09910016
099200     Evaluate True                                                09920016
099300       When R7919999-Return-Abend                                 09930016
099400         Move  'E551'              To    R7919999-Paragraph       09940016
099500         Perform Z900-Abend                                       09950016
099600*                                                                 09960016
099700       When R7919999-Return-Error                                 09970016
099800         Move  'E552'              To    R7919999-Paragraph       09980016
099900         Perform Z700-Error-AE                                    09990016
100000*                                                                 10000016
100100     End-Evaluate                                                 10010016
100200*                                                                 10020016
100300     .                                                            10030016
100400*################################################################*10040023
100500 E560-Delete-CA-Dest               Section.                       10050023
100600*                                                                 10060023
100700     Move  Ws-Table-Dest           To    R115ICA0-In-Table-Version10070023
100800     Set   R115ICA0-In-Delete      To    True                     10080023
100900*                                                                 10090023
101000     Move  R115ICA0-Currency       To    R115ICA0-In-Currency     10100023
101100*                                                                 10110023
101200     Call  'F115ICA0'              Using R115ICA0-Contract-Amount 10120023
101300                                         R7919999-Error-Area      10130023
101400     End-Call                                                     10140023
101500*                                                                 10150023
101600     Evaluate True                                                10160023
101700       When R7919999-Return-Abend                                 10170023
101800         Move  'E561'              To    R7919999-Paragraph       10180023
101900         Perform Z900-Abend                                       10190023
102000*                                                                 10200023
102100       When R7919999-Return-Error                                 10210023
102200         Move  'E562'              To    R7919999-Paragraph       10220023
102300         Perform Z700-Error-AE                                    10230023
102400*                                                                 10240023
102500     End-Evaluate                                                 10250023
102600*                                                                 10260023
102700     .                                                            10270023
102800*################################################################*10280023
102900 E600-Handle-PA                  Section.                         10290011
103000*                                                                 10300011
103100     If  R115L140-Accept-Shadow                                   10310023
103200*                                                                 10320023
103300         Perform E611-Find-First-PA-Dest                          10330023
103400         Perform Until R7919999-Return-Error                      10340023
103500*                                                                 10350023
103600            Perform E660-Delete-PA-Dest                           10360023
103700*                                                                 10370023
103800            Perform E621-Find-Next-PA-Dest                        10380023
103900         End-Perform                                              10390023
104000     End-If                                                       10400023
104100*                                                                 10410023
104200     Perform E610-Find-First-PA-Source                            10420023
104300     Perform Until R7919999-Return-Error                          10430011
104400*                                                                 10440011
104500        Perform E640-Create-PA                                    10450011
104600*                                                                 10460011
104700        If  R115L140-Accept-Shadow                                10470016
104800            Perform E650-Delete-PA-Source                         10480023
104900        End-If                                                    10490016
105000*                                                                 10500016
105100        Perform E620-Find-Next-PA-Source                          10510023
105200     End-Perform                                                  10520011
105300*                                                                 10530011
105400     Initialize       R7919999-Error                              10540011
105500*                                                                 10550011
105600     .                                                            10560011
105700*################################################################*10570011
105800 E610-Find-First-PA-Source         Section.                       10580023
105900*                                                                 10590011
106000     Initialize                          R115IPA0-Part-Amount     10600012
106100     Set   R115IPA0-In-Get-1st     To    True                     10610011
106200     Move  Ws-Table-Source         To    R115IPA0-In-Table-Version10620023
106300     Perform E630-Find-PA                                         10630011
106400*                                                                 10640011
106500     .                                                            10650011
106600*################################################################*10660023
106700 E611-Find-First-PA-Dest           Section.                       10670023
106800*                                                                 10680023
106900     Initialize                          R115IPA0-Part-Amount     10690023
107000     Set   R115IPA0-In-Get-1st     To    True                     10700023
107100     Move  Ws-Table-Dest           To    R115IPA0-In-Table-Version10710023
107200     Perform E630-Find-PA                                         10720023
107300*                                                                 10730023
107400     .                                                            10740023
107500*################################################################*10750011
107600 E620-Find-Next-PA-Source          Section.                       10760023
107700*                                                                 10770011
107800     Initialize                          R115IPA0-Part-Amount     10780012
107900     Set   R115IPA0-In-Get-Next    To    True                     10790011
108000     Move  Ws-Table-Source         To    R115IPA0-In-Table-Version10800023
108100     Perform E630-Find-PA                                         10810011
108200*                                                                 10820011
108300     .                                                            10830011
108400*################################################################*10840023
108500 E621-Find-Next-PA-Dest            Section.                       10850023
108600*                                                                 10860023
108700     Initialize                          R115IPA0-Part-Amount     10870023
108800     Set   R115IPA0-In-Get-Next    To    True                     10880023
108900     Move  Ws-Table-Dest           To    R115IPA0-In-Table-Version10890023
109000     Perform E630-Find-PA                                         10900023
109100*                                                                 10910023
109200     .                                                            10920023
109300*################################################################*10930011
109400 E630-Find-PA                      Section.                       10940011
109500*                                                                 10950011
109600     Set   R115IPA0-Version        To    True                     10960011
109700     Move  R115L140-Fin-Inst-No    To    R115IPA0-In-Fin-Inst-No  10970011
109800     Move  R115L140-Contract-Type  To    R115IPA0-In-Contract-Type10980011
109900     Move  R115L140-Contract-No    To    R115IPA0-In-Contract-No  10990011
110000*                                                                 11000011
110100     Call  'F115IPA0'              Using R115IPA0-Part-Amount     11010012
110200                                         R7919999-Error-Area      11020011
110300     End-Call                                                     11030011
110400*                                                                 11040011
110500     Evaluate True                                                11050011
110600       When R7919999-Return-Abend                                 11060011
110700         Move  'E631'              To    R7919999-Paragraph       11070011
110800         Perform Z900-Abend                                       11080011
110900*                                                                 11090011
111000     End-Evaluate                                                 11100011
111100*                                                                 11110011
111200     .                                                            11120011
111300*################################################################*11130011
111400 E640-Create-PA                    Section.                       11140011
111500*                                                                 11150011
111600     Move  Ws-Table-Dest           To    R115IPA0-In-Table-Version11160016
111700     Set   R115IPA0-In-Insert      To    True                     11170011
111800*                                                                 11180011
111900     Call  'F115IPA0'              Using R115IPA0-Part-Amount     11190012
112000                                         R7919999-Error-Area      11200011
112100     End-Call                                                     11210011
112200*                                                                 11220011
112300     Evaluate True                                                11230011
112400       When R7919999-Return-Abend                                 11240011
112500         Move  'E641'              To    R7919999-Paragraph       11250011
112600         Perform Z900-Abend                                       11260011
112700*                                                                 11270011
112800       When R7919999-Return-Error                                 11280011
112900         Move  'E642'              To    R7919999-Paragraph       11290011
113000         Perform Z700-Error-AE                                    11300011
113100*                                                                 11310011
113200     End-Evaluate                                                 11320011
113300*                                                                 11330011
113400     .                                                            11340011
113500*################################################################*11350016
113600 E650-Delete-PA-Source             Section.                       11360023
113700*                                                                 11370016
113800     Move  Ws-Table-Source         To    R115IPA0-In-Table-Version11380016
113900     Set   R115IPA0-In-Delete      To    True                     11390016
114000*                                                                 11400016
114100     Move  R115IPA0-CA-Currency    To    R115IPA0-In-CA-Currency  11410023
114200     Move  R115IPA0-PA-Seq-No      To    R115IPA0-In-PA-Seq-No    11420023
114300*                                                                 11430023
114400     Call  'F115IPA0'              Using R115IPA0-Part-Amount     11440016
114500                                         R7919999-Error-Area      11450016
114600     End-Call                                                     11460016
114700*                                                                 11470016
114800     Evaluate True                                                11480016
114900       When R7919999-Return-Abend                                 11490016
115000         Move  'E651'              To    R7919999-Paragraph       11500016
115100         Perform Z900-Abend                                       11510016
115200*                                                                 11520016
115300       When R7919999-Return-Error                                 11530016
115400         Move  'E652'              To    R7919999-Paragraph       11540016
115500         Perform Z700-Error-AE                                    11550016
115600*                                                                 11560016
115700     End-Evaluate                                                 11570016
115800*                                                                 11580016
115900     .                                                            11590016
116000*################################################################*11600023
116100 E660-Delete-PA-Dest               Section.                       11610023
116200*                                                                 11620023
116300     Move  Ws-Table-Dest           To    R115IPA0-In-Table-Version11630023
116400     Set   R115IPA0-In-Delete      To    True                     11640023
116500*                                                                 11650023
116600     Move  R115IPA0-CA-Currency    To    R115IPA0-In-CA-Currency  11660023
116700     Move  R115IPA0-PA-Seq-No      To    R115IPA0-In-PA-Seq-No    11670023
116800*                                                                 11680023
116900     Call  'F115IPA0'              Using R115IPA0-Part-Amount     11690023
117000                                         R7919999-Error-Area      11700023
117100     End-Call                                                     11710023
117200*                                                                 11720023
117300     Evaluate True                                                11730023
117400       When R7919999-Return-Abend                                 11740023
117500         Move  'E661'              To    R7919999-Paragraph       11750023
117600         Perform Z900-Abend                                       11760023
117700*                                                                 11770023
117800       When R7919999-Return-Error                                 11780023
117900         Move  'E662'              To    R7919999-Paragraph       11790023
118000         Perform Z700-Error-AE                                    11800023
118100*                                                                 11810023
118200     End-Evaluate                                                 11820023
118300*                                                                 11830023
118400     .                                                            11840023
118500*################################################################*11850023
118600 E700-Handle-SE                  Section.                         11860014
118700*                                                                 11870014
118800     If  R115L140-Accept-Shadow                                   11880023
118900*                                                                 11890023
119000         Perform E711-Find-First-SE-Dest                          11900023
119100         Perform Until R7919999-Return-Error                      11910023
119200*                                                                 11920023
119300            Perform E760-Delete-SE-Dest                           11930023
119400*                                                                 11940023
119500            Perform E721-Find-Next-SE-Dest                        11950023
119600         End-Perform                                              11960023
119700     End-If                                                       11970023
119800*                                                                 11980023
119900     Perform E710-Find-First-SE-Source                            11990023
120000     Perform Until R7919999-Return-Error                          12000014
120100*                                                                 12010014
120200        Perform E740-Create-SE                                    12020014
120300*                                                                 12030014
120400        If  R115L140-Accept-Shadow                                12040016
120500            Perform E750-Delete-SE-Source                         12050023
120600        End-If                                                    12060016
120700*                                                                 12070016
120800        Perform E720-Find-Next-SE-Source                          12080023
120900     End-Perform                                                  12090014
121000*                                                                 12100014
121100     Initialize       R7919999-Error                              12110014
121200*                                                                 12120014
121300     .                                                            12130014
121400*################################################################*12140014
121500 E710-Find-First-SE-Source         Section.                       12150023
121600*                                                                 12160014
121700     Initialize                          R115ISE0-Settlement      12170014
121800     Set   R115ISE0-In-Get-1st     To    True                     12180014
121900     Move  Ws-Table-Source         To    R115ISE0-In-Table-Version12190023
122000     Perform E730-Find-SE                                         12200014
122100*                                                                 12210014
122200     .                                                            12220014
122300*################################################################*12230023
122400 E711-Find-First-SE-Dest           Section.                       12240023
122500*                                                                 12250023
122600     Initialize                          R115ISE0-Settlement      12260023
122700     Set   R115ISE0-In-Get-1st     To    True                     12270023
122800     Move  Ws-Table-Dest           To    R115ISE0-In-Table-Version12280023
122900     Perform E730-Find-SE                                         12290023
123000*                                                                 12300023
123100     .                                                            12310023
123200*################################################################*12320014
123300 E720-Find-Next-SE-Source          Section.                       12330023
123400*                                                                 12340014
123500     Initialize                          R115ISE0-Settlement      12350014
123600     Set   R115ISE0-In-Get-Next    To    True                     12360014
123700     Move  Ws-Table-Source         To    R115ISE0-In-Table-Version12370023
123800     Perform E730-Find-SE                                         12380014
123900*                                                                 12390014
124000     .                                                            12400014
124100*################################################################*12410023
124200 E721-Find-Next-SE-Dest            Section.                       12420023
124300*                                                                 12430023
124400     Initialize                          R115ISE0-Settlement      12440023
124500     Set   R115ISE0-In-Get-Next    To    True                     12450023
124600     Move  Ws-Table-Dest           To    R115ISE0-In-Table-Version12460023
124700     Perform E730-Find-SE                                         12470023
124800*                                                                 12480023
124900     .                                                            12490023
125000*################################################################*12500014
125100 E730-Find-SE                      Section.                       12510014
125200*                                                                 12520014
125300     Set   R115ISE0-Version        To    True                     12530014
125400     Move  R115L140-Fin-Inst-No    To    R115ISE0-In-Fin-Inst-No  12540014
125500     Move  R115L140-Contract-Type  To    R115ISE0-In-Contract-Type12550014
125600     Move  R115L140-Contract-No    To    R115ISE0-In-Contract-No  12560014
125700*                                                                 12570014
125800     Call  'F115ISE0'              Using R115ISE0-Settlement      12580014
125900                                         R7919999-Error-Area      12590014
126000     End-Call                                                     12600014
126100*                                                                 12610014
126200     Evaluate True                                                12620014
126300       When R7919999-Return-Abend                                 12630014
126400         Move  'E731'              To    R7919999-Paragraph       12640014
126500         Perform Z900-Abend                                       12650014
126600*                                                                 12660014
126700     End-Evaluate                                                 12670014
126800*                                                                 12680014
126900     .                                                            12690014
127000*################################################################*12700014
127100 E740-Create-SE                    Section.                       12710014
127200*                                                                 12720014
127300     Move  Ws-Table-Dest           To    R115ISE0-In-Table-Version12730016
127400     Set   R115ISE0-In-Insert      To    True                     12740014
127500*                                                                 12750014
127600     Call  'F115ISE0'              Using R115ISE0-Settlement      12760014
127700                                         R7919999-Error-Area      12770014
127800     End-Call                                                     12780014
127900*                                                                 12790014
128000     Evaluate True                                                12800014
128100       When R7919999-Return-Abend                                 12810014
128200         Move  'E741'              To    R7919999-Paragraph       12820014
128300         Perform Z900-Abend                                       12830014
128400*                                                                 12840014
128500       When R7919999-Return-Error                                 12850014
128600         Move  'E742'              To    R7919999-Paragraph       12860014
128700         Perform Z700-Error-AE                                    12870014
128800*                                                                 12880014
128900     End-Evaluate                                                 12890014
129000*                                                                 12900014
129100     .                                                            12910014
129200*################################################################*12920016
129300 E750-Delete-SE-Source             Section.                       12930023
129400*                                                                 12940016
129500     Move  Ws-Table-Source         To    R115ISE0-In-Table-Version12950016
129600     Set   R115ISE0-In-Delete      To    True                     12960016
129700*                                                                 12970016
129800     Move  R115ISE0-CA-Currency    To    R115ISE0-In-CA-Currency  12980023
129900     Move  R115ISE0-PA-Seq-No      To    R115ISE0-In-PA-Seq-No    12990023
130000*                                                                 13000023
130100     Call  'F115ISE0'              Using R115ISE0-Settlement      13010016
130200                                         R7919999-Error-Area      13020016
130300     End-Call                                                     13030016
130400*                                                                 13040016
130500     Evaluate True                                                13050016
130600       When R7919999-Return-Abend                                 13060016
130700         Move  'E751'              To    R7919999-Paragraph       13070016
130800         Perform Z900-Abend                                       13080016
130900*                                                                 13090016
131000       When R7919999-Return-Error                                 13100016
131100         Move  'E752'              To    R7919999-Paragraph       13110016
131200         Perform Z700-Error-AE                                    13120016
131300*                                                                 13130016
131400     End-Evaluate                                                 13140016
131500*                                                                 13150016
131600     .                                                            13160016
131700*################################################################*13170023
131800 E760-Delete-SE-Dest               Section.                       13180023
131900*                                                                 13190023
132000     Move  Ws-Table-Dest           To    R115ISE0-In-Table-Version13200023
132100     Set   R115ISE0-In-Delete      To    True                     13210023
132200*                                                                 13220023
132300     Move  R115ISE0-CA-Currency    To    R115ISE0-In-CA-Currency  13230023
132400     Move  R115ISE0-PA-Seq-No      To    R115ISE0-In-PA-Seq-No    13240023
132500*                                                                 13250023
132600     Call  'F115ISE0'              Using R115ISE0-Settlement      13260023
132700                                         R7919999-Error-Area      13270023
132800     End-Call                                                     13280023
132900*                                                                 13290023
133000     Evaluate True                                                13300023
133100       When R7919999-Return-Abend                                 13310023
133200         Move  'E761'              To    R7919999-Paragraph       13320023
133300         Perform Z900-Abend                                       13330023
133400*                                                                 13340023
133500       When R7919999-Return-Error                                 13350023
133600         Move  'E762'              To    R7919999-Paragraph       13360023
133700         Perform Z700-Error-AE                                    13370023
133800*                                                                 13380023
133900     End-Evaluate                                                 13390023
134000*                                                                 13400023
134100     .                                                            13410023
134200*################################################################*13420023
134300 E800-Handle-PC                  Section.                         13430014
134400*                                                                 13440014
134500     If  R115L140-Accept-Shadow                                   13450023
134600*                                                                 13460023
134700         Perform E811-Find-First-PC-Dest                          13470023
134800         Perform Until R7919999-Return-Error                      13480023
134900*                                                                 13490023
135000            Perform E860-Delete-PC-Dest                           13500023
135100*                                                                 13510023
135200            Perform E821-Find-Next-PC-Dest                        13520023
135300         End-Perform                                              13530023
135400     End-If                                                       13540023
135500*                                                                 13550023
135600     Perform E810-Find-First-PC-Source                            13560023
135700     Perform Until R7919999-Return-Error                          13570014
135800*                                                                 13580014
135900        Perform E840-Create-PC                                    13590014
136000*                                                                 13600014
136100        If  R115L140-Accept-Shadow                                13610016
136200            Perform E850-Delete-PC-Source                         13620023
136300        End-If                                                    13630016
136400*                                                                 13640016
136500        Perform E820-Find-Next-PC-Source                          13650023
136600     End-Perform                                                  13660014
136700*                                                                 13670014
136800     Initialize       R7919999-Error                              13680014
136900*                                                                 13690014
137000     .                                                            13700014
137100*################################################################*13710014
137200 E810-Find-First-PC-Source         Section.                       13720023
137300*                                                                 13730014
137400     Initialize                          R115IPC0-Part-Charge     13740014
137500     Set   R115IPC0-In-Get-1st     To    True                     13750014
137600     Move  Ws-Table-Source         To    R115IPC0-In-Table-Version13760023
137700     Perform E830-Find-PC                                         13770014
137800*                                                                 13780014
137900     .                                                            13790014
138000*################################################################*13800023
138100 E811-Find-First-PC-Dest           Section.                       13810023
138200*                                                                 13820023
138300     Initialize                          R115IPC0-Part-Charge     13830023
138400     Set   R115IPC0-In-Get-1st     To    True                     13840023
138500     Move  Ws-Table-Dest           To    R115IPC0-In-Table-Version13850023
138600     Perform E830-Find-PC                                         13860023
138700*                                                                 13870023
138800     .                                                            13880023
138900*################################################################*13890014
139000 E820-Find-Next-PC-Source          Section.                       13900023
139100*                                                                 13910014
139200     Initialize                          R115IPC0-Part-Charge     13920014
139300     Set   R115IPC0-In-Get-Next    To    True                     13930014
139400     Move  Ws-Table-Source         To    R115IPC0-In-Table-Version13940023
139500     Perform E830-Find-PC                                         13950014
139600*                                                                 13960014
139700     .                                                            13970014
139800*################################################################*13980023
139900 E821-Find-Next-PC-Dest            Section.                       13990023
140000*                                                                 14000023
140100     Initialize                          R115IPC0-Part-Charge     14010023
140200     Set   R115IPC0-In-Get-Next    To    True                     14020023
140300     Move  Ws-Table-Dest           To    R115IPC0-In-Table-Version14030023
140400     Perform E830-Find-PC                                         14040023
140500*                                                                 14050023
140600     .                                                            14060023
140700*################################################################*14070014
140800 E830-Find-PC                      Section.                       14080014
140900*                                                                 14090014
141000*                                                                 14100014
141100     Set   R115IPC0-Version        To    True                     14110014
141200     Move  R115L140-Fin-Inst-No    To    R115IPC0-In-Fin-Inst-No  14120014
141300     Move  R115L140-Contract-Type  To    R115IPC0-In-Contract-Type14130014
141400     Move  R115L140-Contract-No    To    R115IPC0-In-Contract-No  14140014
141500*                                                                 14150014
141600     Call  'F115IPC0'              Using R115IPC0-Part-Charge     14160014
141700                                         R7919999-Error-Area      14170014
141800     End-Call                                                     14180014
141900*                                                                 14190014
142000     Evaluate True                                                14200014
142100       When R7919999-Return-Abend                                 14210014
142200         Move  'E831'              To    R7919999-Paragraph       14220014
142300         Perform Z900-Abend                                       14230014
142400*                                                                 14240014
142500     End-Evaluate                                                 14250014
142600*                                                                 14260014
142700     .                                                            14270014
142800*################################################################*14280014
142900 E840-Create-PC                    Section.                       14290014
143000*                                                                 14300014
143100     Move  Ws-Table-Dest           To    R115IPC0-In-Table-Version14310016
143200     Set   R115IPC0-In-Insert      To    True                     14320014
143300*                                                                 14330014
143400     Call  'F115IPC0'              Using R115IPC0-Part-Charge     14340014
143500                                         R7919999-Error-Area      14350014
143600     End-Call                                                     14360014
143700*                                                                 14370014
143800     Evaluate True                                                14380014
143900       When R7919999-Return-Abend                                 14390014
144000         Move  'E841'              To    R7919999-Paragraph       14400014
144100         Perform Z900-Abend                                       14410014
144200*                                                                 14420014
144300       When R7919999-Return-Error                                 14430014
144400         Move  'E842'              To    R7919999-Paragraph       14440014
144500         Perform Z700-Error-AE                                    14450014
144600*                                                                 14460014
144700     End-Evaluate                                                 14470014
144800*                                                                 14480014
144900     .                                                            14490014
145000*################################################################*14500016
145100 E850-Delete-PC-Source             Section.                       14510023
145200*                                                                 14520016
145300     Move  Ws-Table-Source         To    R115IPC0-In-Table-Version14530016
145400     Set   R115IPC0-In-Delete      To    True                     14540016
145500*                                                                 14550016
145600     Move  R115IPC0-CA-Currency    To    R115IPC0-In-CA-Currency  14560023
145700     Move  R115IPC0-PA-Seq-No      To    R115IPC0-In-PA-Seq-No    14570023
145800     Move  R115IPC0-Role-Type      To    R115IPC0-In-Role-Type    14580023
145900     Move  R115IPC0-CT-Type        To    R115IPC0-In-CT-Type      14590023
146000*    Move  R115IPC0-CH-Seq-No      To    R115IPC0-In-CH-Seq-No    14600034
146100*                                                                 14610023
146200     Call  'F115IPC0'              Using R115IPC0-Part-Charge     14620016
146300                                         R7919999-Error-Area      14630016
146400     End-Call                                                     14640016
146500*                                                                 14650016
146600     Evaluate True                                                14660016
146700       When R7919999-Return-Abend                                 14670016
146800         Move  'E841'              To    R7919999-Paragraph       14680016
146900         Perform Z900-Abend                                       14690016
147000*                                                                 14700016
147100       When R7919999-Return-Error                                 14710016
147200         Move  'E842'              To    R7919999-Paragraph       14720016
147300         Perform Z700-Error-AE                                    14730016
147400*                                                                 14740016
147500     End-Evaluate                                                 14750016
147600*                                                                 14760016
147700     .                                                            14770016
147800*################################################################*14780023
147900 E860-Delete-PC-Dest               Section.                       14790023
148000*                                                                 14800023
148100     Move  Ws-Table-Dest           To    R115IPC0-In-Table-Version14810023
148200     Set   R115IPC0-In-Delete      To    True                     14820023
148300*                                                                 14830023
148400     Move  R115IPC0-CA-Currency    To    R115IPC0-In-CA-Currency  14840023
148500     Move  R115IPC0-PA-Seq-No      To    R115IPC0-In-PA-Seq-No    14850023
148600     Move  R115IPC0-Role-Type      To    R115IPC0-In-Role-Type    14860023
148700     Move  R115IPC0-CT-Type        To    R115IPC0-In-CT-Type      14870023
148800*    Move  R115IPC0-CH-Seq-No      To    R115IPC0-In-CH-Seq-No    14880034
148900*                                                                 14890023
149000     Call  'F115IPC0'              Using R115IPC0-Part-Charge     14900023
149100                                         R7919999-Error-Area      14910023
149200     End-Call                                                     14920023
149300*                                                                 14930023
149400     Evaluate True                                                14940023
149500       When R7919999-Return-Abend                                 14950023
149600         Move  'E841'              To    R7919999-Paragraph       14960023
149700         Perform Z900-Abend                                       14970023
149800*                                                                 14980023
149900       When R7919999-Return-Error                                 14990023
150000         Move  'E842'              To    R7919999-Paragraph       15000023
150100         Perform Z700-Error-AE                                    15010023
150200*                                                                 15020023
150300     End-Evaluate                                                 15030023
150400*                                                                 15040023
150500     .                                                            15050023
150600*################################################################*15060023
150700 E900-Handle-CH                  Section.                         15070014
150800*                                                                 15080014
150900     If  R115L140-Accept-Shadow                                   15090023
151000*                                                                 15100023
151100         Perform E911-Find-First-CH-Dest                          15110023
151200         Perform Until R7919999-Return-Error                      15120023
151300*                                                                 15130054
151400*           Perform E960-Delete-CH-Dest                           15140054
151500*                                                                 15150023
151600*NDL Feilretting, Sletter ikke omk av typen % av PA på Main Charge15160054
151700*    dersom man er på en rate                                     15170054
151800*                                                                 15180054
151900            If  R115L140-Charge-PA                                15190055
152000            And R115ICH0-Charge-Pct > 0                           15200054
152100                Perform E970-Read-Sys-Charge-Type                 15210054
152300                If Not R115ICT0-MethCalc-Pct-Of-PA                15230054
152600                   Perform E960-Delete-CH-Dest                    15260054
152700                End-If                                            15270054
152800            Else                                                  15280054
153000                Perform E960-Delete-CH-Dest                       15300054
153100            End-If                                                15310054
153200*Feilretting slutt                                                15320054
153300*                                                                 15330054
153400            Perform E921-Find-Next-CH-Dest                        15340023
153500         End-Perform                                              15350023
153600     End-If                                                       15360023
153700*                                                                 15370023
153800     Perform E910-Find-First-CH-Source                            15380023
153900     Perform Until R7919999-Return-Error                          15390014
154000*                                                                 15400014
154100        Perform E940-Create-CH                                    15410014
154200*                                                                 15420014
154300        If  R115L140-Accept-Shadow                                15430016
154400            Perform E950-Delete-CH-Source                         15440023
154500        End-If                                                    15450016
154600*                                                                 15460016
154700        Perform E920-Find-Next-CH-Source                          15470023
154800     End-Perform                                                  15480014
154900*                                                                 15490014
155000     Initialize       R7919999-Error                              15500014
155100*                                                                 15510014
155200     .                                                            15520014
155300*################################################################*15530014
155400 E910-Find-First-CH-Source         Section.                       15540023
155500*                                                                 15550014
155600     Initialize                          R115ICH0-Main-Charge     15560014
155700     Set   R115ICH0-In-Get-1st     To    True                     15570014
155800     Move  Ws-Table-Source         To    R115ICH0-In-Table-Version15580023
155900     Perform E930-Find-CH                                         15590014
156000*                                                                 15600014
156100     .                                                            15610014
156200*################################################################*15620023
156300 E911-Find-First-CH-Dest           Section.                       15630023
156400*                                                                 15640023
156500     Initialize                          R115ICH0-Main-Charge     15650023
156600     Set   R115ICH0-In-Get-1st     To    True                     15660023
156700     Move  Ws-Table-Dest           To    R115ICH0-In-Table-Version15670023
156800     Perform E930-Find-CH                                         15680023
156900*                                                                 15690023
157000     .                                                            15700023
157100*################################################################*15710014
157200 E920-Find-Next-CH-Source          Section.                       15720023
157300*                                                                 15730014
157400     Initialize                          R115ICH0-Main-Charge     15740014
157500     Set   R115ICH0-In-Get-Next    To    True                     15750014
157600     Move  Ws-Table-Source         To    R115ICH0-In-Table-Version15760023
157700     Perform E930-Find-CH                                         15770014
157800*                                                                 15780014
157900     .                                                            15790014
158000*################################################################*15800023
158100 E921-Find-Next-CH-Dest            Section.                       15810023
158200*                                                                 15820023
158300     Initialize                          R115ICH0-Main-Charge     15830023
158400     Set   R115ICH0-In-Get-Next    To    True                     15840023
158500     Move  Ws-Table-Dest           To    R115ICH0-In-Table-Version15850023
158600     Perform E930-Find-CH                                         15860023
158700*                                                                 15870023
158800     .                                                            15880023
158900*################################################################*15890014
159000 E930-Find-CH                      Section.                       15900014
159100*                                                                 15910014
159200     Set   R115ICH0-Version        To    True                     15920014
159300     Move  R115L140-Fin-Inst-No    To    R115ICH0-In-Fin-Inst-No  15930014
159400     Move  R115L140-Contract-Type  To    R115ICH0-In-Contract-Type15940014
159500     Move  R115L140-Contract-No    To    R115ICH0-In-Contract-No  15950014
159600*                                                                 15960014
159700     Call  'F115ICH0'              Using R115ICH0-Main-Charge     15970014
159800                                         R7919999-Error-Area      15980014
159900     End-Call                                                     15990014
160000*                                                                 16000014
160100     Evaluate True                                                16010014
160200       When R7919999-Return-Abend                                 16020014
160300         Move  'E931'              To    R7919999-Paragraph       16030014
160400         Perform Z900-Abend                                       16040014
160500*                                                                 16050014
160600     End-Evaluate                                                 16060014
160700*                                                                 16070014
160800     .                                                            16080014
160900*################################################################*16090014
161000 E940-Create-CH                    Section.                       16100014
161100*                                                                 16110014
161200     Move  Ws-Table-Dest           To    R115ICH0-In-Table-Version16120016
161300     Set   R115ICH0-In-Insert      To    True                     16130016
161400*                                                                 16140014
161500     Call  'F115ICH0'              Using R115ICH0-Main-Charge     16150014
161600                                         R7919999-Error-Area      16160014
161700     End-Call                                                     16170014
161800*                                                                 16180014
161900     Evaluate True                                                16190014
162000       When R7919999-Return-Abend                                 16200014
162100         Move  'E941'              To    R7919999-Paragraph       16210014
162200         Perform Z900-Abend                                       16220014
162300*                                                                 16230014
162310*ndl   ok at den finnes fra før                                   16231067
162400*      When R7919999-Return-Error                                 16240067
162500*        Move  'E942'              To    R7919999-Paragraph       16250067
162600*        Perform Z700-Error-AE                                    16260067
162700*                                                                 16270014
162800     End-Evaluate                                                 16280014
162900*                                                                 16290014
163000     .                                                            16300014
163100*################################################################*16310016
163200 E950-Delete-CH-Source             Section.                       16320023
163300*                                                                 16330016
163400     Move  Ws-Table-Source         To    R115ICH0-In-Table-Version16340016
163500     Set   R115ICH0-In-Delete      To    True                     16350016
163600*                                                                 16360016
163700     Move  R115ICH0-CA-Currency    To    R115ICH0-In-CA-Currency  16370023
163800     Move  R115ICH0-PA-Seq-No      To    R115ICH0-In-PA-Seq-No    16380023
163900     Move  R115ICH0-RP-Role-Type   To    R115ICH0-In-RP-Role-Type 16390023
164000     Move  R115ICH0-Charge-Type    To    R115ICH0-In-Charge-Type  16400023
164100     Move  R115ICH0-CH-Seq-No      To    R115ICH0-In-CH-Seq-No    16410023
164200*                                                                 16420023
164300     Call  'F115ICH0'              Using R115ICH0-Main-Charge     16430016
164400                                         R7919999-Error-Area      16440016
164500     End-Call                                                     16450016
164600*                                                                 16460016
164700     Evaluate True                                                16470016
164800       When R7919999-Return-Abend                                 16480016
164900         Move  'E951'              To    R7919999-Paragraph       16490016
165000         Perform Z900-Abend                                       16500016
165100*                                                                 16510016
165200       When R7919999-Return-Error                                 16520016
165300         Move  'E952'              To    R7919999-Paragraph       16530016
165400         Perform Z700-Error-AE                                    16540016
165500*                                                                 16550016
165600     End-Evaluate                                                 16560016
165700*                                                                 16570016
165800     .                                                            16580016
165900*################################################################*16590023
166000 E960-Delete-CH-Dest               Section.                       16600023
166100*                                                                 16610023
166200     Move  Ws-Table-Dest           To    R115ICH0-In-Table-Version16620023
166300     Set   R115ICH0-In-Delete      To    True                     16630023
166400*                                                                 16640023
166500     Move  R115ICH0-CA-Currency    To    R115ICH0-In-CA-Currency  16650023
166600     Move  R115ICH0-PA-Seq-No      To    R115ICH0-In-PA-Seq-No    16660023
166700     Move  R115ICH0-RP-Role-Type   To    R115ICH0-In-RP-Role-Type 16670023
166800     Move  R115ICH0-Charge-Type    To    R115ICH0-In-Charge-Type  16680023
166900     Move  R115ICH0-CH-Seq-No      To    R115ICH0-In-CH-Seq-No    16690023
167000*                                                                 16700023
167200     Call  'F115ICH0'              Using R115ICH0-Main-Charge     16720023
167300                                         R7919999-Error-Area      16730023
167400     End-Call                                                     16740023
167500*                                                                 16750023
167600     Evaluate True                                                16760023
167700       When R7919999-Return-Abend                                 16770023
167800         Move  'E961'              To    R7919999-Paragraph       16780023
167900         Perform Z900-Abend                                       16790023
168000*                                                                 16800023
168100       When R7919999-Return-Error                                 16810023
168200         Move  'E962'              To    R7919999-Paragraph       16820023
168300         Perform Z700-Error-AE                                    16830023
168700*                                                                 16870023
168800     End-Evaluate                                                 16880023
168900*                                                                 16890023
169000     .                                                            16900023
169100*################################################################*16910054
169200 E970-Read-Sys-Charge-Type.                                       16920054
169300*                                                                 16930054
169400     Initialize                          R115ICT0-Sys-Charge-Type 16940054
169500     Set   R115ICT0-Version        To    True                     16950054
169600     Set   R115ICT0-In-Select      To    True                     16960059
169700     Move  R115L140-Fin-Inst-No    To    R115ICT0-In-Fin-Inst-No  16970054
169800     Move  +0                      To    R115ICT0-In-RegNo        16980062
169900     Move  R115ICH0-Charge-Type    To    R115ICT0-In-CT-Type      16990054
170000*                                                                 17000054
170100     Perform E980-Call-DBI-TF-CT                                  17010054
170200*                                                                 17020062
170300     If  R7919999-Return-Error                                    17030062
170400         Set R7919999-Return-OK    To    True                     17040062
170600         Move  R115L140-In-Reg-No  To    R115ICT0-In-RegNo        17060062
170700         Perform E980-Call-DBI-TF-CT                              17070062
170800         If R7919999-Return-Error                                 17080062
170900            Move  'E982'              To    R7919999-Paragraph    17090062
171000            Perform Z700-Error-AE                                 17100062
171100         End-If                                                   17110062
171200     End-If                                                       17120062
171300     .                                                            17130054
171400*################################################################*17140054
171500 E980-Call-DBI-TF-CT.                                             17150054
171600*                                                                 17160054
171700     Call  'F115ICT0'              Using R115ICT0-Sys-Charge-Type 17170056
171800                                         R7919999-Error-Area      17180054
171900         End-Call                                                 17190054
172000*                                                                 17200054
172100     Evaluate True                                                17210054
172200       When R7919999-Return-Abend                                 17220054
172300         Move  'E981'              To    R7919999-Paragraph       17230054
172400         Perform Z900-Abend                                       17240054
172500*                                                                 17250054
172600*      When R7919999-Return-Error                                 17260062
172700*        Display 'ERROR etter les av sys-charge-type'             17270062
172800*        Move  'E982'              To    R7919999-Paragraph       17280062
172900*        Perform Z700-Error-AE                                    17290062
173000*                                                                 17300054
173100       When R7919999-Return-OK                                    17310054
173200         Continue                                                 17320054
173300*                                                                 17330054
173400     End-Evaluate                                                 17340054
173500     .                                                            17350054
173600*################################################################*17360054
173700 F000-Handle-LM                  Section.                         17370016
173800*                                                                 17380016
173900     If  R115L140-Accept-Shadow                                   17390023
174000*                                                                 17400023
174100         Perform F011-Find-First-LM-Dest                          17410023
174200         Perform Until R7919999-Return-Error                      17420023
174300*                                                                 17430023
174400            Perform F060-Delete-LM-Dest                           17440023
174500*                                                                 17450023
174600            Perform F021-Find-Next-LM-Dest                        17460023
174700         End-Perform                                              17470023
174800     End-If                                                       17480023
174900*                                                                 17490023
175000     Perform F010-Find-First-LM-Source                            17500023
175100     Perform Until R7919999-Return-Error                          17510016
175200*                                                                 17520016
175300        Perform F040-Create-LM                                    17530016
175400*                                                                 17540016
175500        If  R115L140-Accept-Shadow                                17550016
175600            Perform F050-Delete-LM-Source                         17560023
175700        End-If                                                    17570016
175800*                                                                 17580016
175900        Perform F020-Find-Next-LM-Source                          17590023
176000     End-Perform                                                  17600016
176100*                                                                 17610016
176200     Initialize       R7919999-Error                              17620016
176300*                                                                 17630016
176400     .                                                            17640016
176500*################################################################*17650016
176600 F010-Find-First-LM-Source         Section.                       17660023
176700*                                                                 17670016
176800     Initialize                          R115ILM0-Letter-Message  17680016
176900     Set   R115ILM0-In-Get-1st     To    True                     17690016
177000     Move  Ws-Table-Source         To    R115ILM0-In-Table-Version17700023
177100     Perform F030-Find-LM                                         17710016
177200*                                                                 17720016
177300     .                                                            17730016
177400*################################################################*17740023
177500 F011-Find-First-LM-Dest           Section.                       17750023
177600*                                                                 17760023
177700     Initialize                          R115ILM0-Letter-Message  17770023
177800     Set   R115ILM0-In-Get-1st     To    True                     17780023
177900     Move  Ws-Table-Dest           To    R115ILM0-In-Table-Version17790023
178000     Perform F030-Find-LM                                         17800023
178100*                                                                 17810023
178200     .                                                            17820023
178300*################################################################*17830016
178400 F020-Find-Next-LM-Source          Section.                       17840023
178500*                                                                 17850016
178600     Initialize                          R115ILM0-Letter-Message  17860016
178700     Set   R115ILM0-In-Get-Next    To    True                     17870016
178800     Move  Ws-Table-Source         To    R115ILM0-In-Table-Version17880023
178900     Perform F030-Find-LM                                         17890016
179000*                                                                 17900016
179100     .                                                            17910016
179200*################################################################*17920023
179300 F021-Find-Next-LM-Dest            Section.                       17930023
179400*                                                                 17940023
179500     Initialize                          R115ILM0-Letter-Message  17950023
179600     Set   R115ILM0-In-Get-Next    To    True                     17960023
179700     Move  Ws-Table-Dest           To    R115ILM0-In-Table-Version17970023
179800     Perform F030-Find-LM                                         17980023
179900*                                                                 17990023
180000     .                                                            18000023
180100*################################################################*18010016
180200 F030-Find-LM                      Section.                       18020016
180300*                                                                 18030016
180400     Set   R115ILM0-Version        To    True                     18040016
180500     Move  R115L140-Fin-Inst-No    To    R115ILM0-In-Fin-Inst-No  18050016
180600     Move  R115L140-Contract-Type  To    R115ILM0-In-Contract-Type18060016
180700     Move  R115L140-Contract-No    To    R115ILM0-In-Contract-No  18070016
180800*                                                                 18080016
180900     Call  'F115ILM0'              Using R115ILM0-Letter-Message  18090016
181000                                         R7919999-Error-Area      18100016
181100     End-Call                                                     18110016
181200*                                                                 18120016
181300     Evaluate True                                                18130016
181400       When R7919999-Return-Abend                                 18140016
181500         Move  'F031'              To    R7919999-Paragraph       18150016
181600         Perform Z900-Abend                                       18160016
181700*                                                                 18170016
181800     End-Evaluate                                                 18180016
181900*                                                                 18190016
182000     .                                                            18200016
182100*################################################################*18210016
182200 F040-Create-LM                    Section.                       18220016
182300*                                                                 18230016
182400     Move  Ws-Table-Dest           To    R115ILM0-In-Table-Version18240016
182500     Set   R115ILM0-In-Insert      To    True                     18250016
182600*                                                                 18260016
182700     Call  'F115ILM0'              Using R115ILM0-Letter-Message  18270016
182800                                         R7919999-Error-Area      18280016
182900     End-Call                                                     18290016
183000*                                                                 18300016
183100     Evaluate True                                                18310016
183200       When R7919999-Return-Abend                                 18320016
183300         Move  'F041'              To    R7919999-Paragraph       18330016
183400         Perform Z900-Abend                                       18340016
183500*                                                                 18350016
183600       When R7919999-Return-Error                                 18360016
183700         Move  'F042'              To    R7919999-Paragraph       18370016
183800         Perform Z700-Error-AE                                    18380016
183900*                                                                 18390016
184000     End-Evaluate                                                 18400016
184100*                                                                 18410016
184200     .                                                            18420016
184300*################################################################*18430016
184400 F050-Delete-LM-Source             Section.                       18440023
184500*                                                                 18450016
184600     Move  Ws-Table-Source         To    R115ILM0-In-Table-Version18460016
184700     Set   R115ILM0-In-Delete      To    True                     18470016
184800*                                                                 18480016
184900     Move  R115ILM0-CA-Currency    To    R115ILM0-In-CA-Currency  18490026
185000     Move  R115ILM0-PA-Seq-No      To    R115ILM0-In-PA-Seq-No    18500026
185100     Move  R115ILM0-Letter-Type    To    R115ILM0-In-Letter-Type  18510026
185200     Move  R115ILM0-LM-Seq-No      To    R115ILM0-In-LM-Seq-No    18520026
185300*                                                                 18530023
185400     Call  'F115ILM0'              Using R115ILM0-Letter-Message  18540016
185500                                         R7919999-Error-Area      18550016
185600     End-Call                                                     18560016
185700*                                                                 18570016
185800     Evaluate True                                                18580016
185900       When R7919999-Return-Abend                                 18590016
186000         Move  'F051'              To    R7919999-Paragraph       18600016
186100         Perform Z900-Abend                                       18610016
186200*                                                                 18620016
186300       When R7919999-Return-Error                                 18630016
186400         Move  'F052'              To    R7919999-Paragraph       18640016
186500         Perform Z700-Error-AE                                    18650016
186600*                                                                 18660016
186700     End-Evaluate                                                 18670016
186800*                                                                 18680016
186900     .                                                            18690016
187000*################################################################*18700023
187100 F060-Delete-LM-Dest               Section.                       18710023
187200*                                                                 18720023
187300     Move  Ws-Table-Dest           To    R115ILM0-In-Table-Version18730023
187400     Set   R115ILM0-In-Delete      To    True                     18740023
187500*                                                                 18750023
187600     Move  R115ILM0-CA-Currency    To    R115ILM0-In-CA-Currency  18760026
187700     Move  R115ILM0-PA-Seq-No      To    R115ILM0-In-PA-Seq-No    18770026
187800     Move  R115ILM0-Letter-Type    To    R115ILM0-In-Letter-Type  18780026
187900     Move  R115ILM0-LM-Seq-No      To    R115ILM0-In-LM-Seq-No    18790026
188000*                                                                 18800023
188100     Call  'F115ILM0'              Using R115ILM0-Letter-Message  18810023
188200                                         R7919999-Error-Area      18820023
188300     End-Call                                                     18830023
188400*                                                                 18840023
188500     Evaluate True                                                18850023
188600       When R7919999-Return-Abend                                 18860023
188700         Move  'F061'              To    R7919999-Paragraph       18870023
188800         Perform Z900-Abend                                       18880023
188900*                                                                 18890023
189000       When R7919999-Return-Error                                 18900023
189100         Move  'F062'              To    R7919999-Paragraph       18910023
189200         Perform Z700-Error-AE                                    18920023
189300*                                                                 18930023
189400     End-Evaluate                                                 18940023
189500*                                                                 18950023
189600     .                                                            18960023
189700*################################################################*18970023
189800 F100-Handle-LL                  Section.                         18980016
189900*                                                                 18990016
190000     If  R115L140-Accept-Shadow                                   19000023
190100*                                                                 19010023
190200         Perform F111-Find-First-LL-Dest                          19020023
190300         Perform Until R7919999-Return-Error                      19030023
190400*                                                                 19040023
190500            Perform F160-Delete-LL-Dest                           19050023
190600*                                                                 19060023
190700            Perform F121-Find-Next-LL-Dest                        19070023
190800         End-Perform                                              19080023
190900     End-If                                                       19090023
191000*                                                                 19100023
191100     Perform F110-Find-First-LL-Source                            19110023
191200     Perform Until R7919999-Return-Error                          19120016
191300*                                                                 19130016
191400        Perform F140-Create-LL                                    19140016
191500*                                                                 19150016
191600        If  R115L140-Accept-Shadow                                19160016
191700            Perform F150-Delete-LL-Source                         19170023
191800        End-If                                                    19180016
191900*                                                                 19190016
192000        Perform F120-Find-Next-LL-Source                          19200023
192100     End-Perform                                                  19210016
192200*                                                                 19220016
192300     Initialize       R7919999-Error                              19230016
192400*                                                                 19240016
192500     .                                                            19250016
192600*################################################################*19260016
192700 F110-Find-First-LL-Source         Section.                       19270023
192800*                                                                 19280016
192900     Initialize                          R115ILL0-Letter-Line     19290016
193000     Set   R115ILL0-In-Get-1st     To    True                     19300016
193100     Move  Ws-Table-Source         To    R115ILL0-In-Table-Version19310023
193200     Perform F130-Find-LL                                         19320016
193300*                                                                 19330016
193400     .                                                            19340016
193500*################################################################*19350023
193600 F111-Find-First-LL-Dest           Section.                       19360023
193700*                                                                 19370023
193800     Initialize                          R115ILL0-Letter-Line     19380023
193900     Set   R115ILL0-In-Get-1st     To    True                     19390023
194000     Move  Ws-Table-Dest           To    R115ILL0-In-Table-Version19400023
194100     Perform F130-Find-LL                                         19410023
194200*                                                                 19420023
194300     .                                                            19430023
194400*################################################################*19440016
194500 F120-Find-Next-LL-Source          Section.                       19450023
194600*                                                                 19460016
194700     Initialize                          R115ILL0-Letter-Line     19470016
194800     Set   R115ILL0-In-Get-Next    To    True                     19480016
194900     Move  Ws-Table-Source         To    R115ILL0-In-Table-Version19490023
195000     Perform F130-Find-LL                                         19500016
195100*                                                                 19510016
195200     .                                                            19520016
195300*################################################################*19530023
195400 F121-Find-Next-LL-Dest            Section.                       19540023
195500*                                                                 19550023
195600     Initialize                          R115ILL0-Letter-Line     19560023
195700     Set   R115ILL0-In-Get-Next    To    True                     19570023
195800     Move  Ws-Table-Dest           To    R115ILL0-In-Table-Version19580023
195900     Perform F130-Find-LL                                         19590023
196000*                                                                 19600023
196100     .                                                            19610023
196200*################################################################*19620016
196300 F130-Find-LL                      Section.                       19630016
196400*                                                                 19640016
196500*                                                                 19650016
196600     Set   R115ILL0-Version        To    True                     19660016
196700     Move  R115L140-Fin-Inst-No    To    R115ILL0-In-Fin-Inst-No  19670016
196800     Move  R115L140-Contract-Type  To    R115ILL0-In-Contract-Type19680016
196900     Move  R115L140-Contract-No    To    R115ILL0-In-Contract-No  19690016
197000*                                                                 19700016
197100     Call  'F115ILL0'              Using R115ILL0-Letter-Line     19710016
197200                                         R7919999-Error-Area      19720016
197300     End-Call                                                     19730016
197400*                                                                 19740016
197500     Evaluate True                                                19750016
197600       When R7919999-Return-Abend                                 19760016
197700         Move  'F131'              To    R7919999-Paragraph       19770016
197800         Perform Z900-Abend                                       19780016
197900*                                                                 19790016
198000     End-Evaluate                                                 19800016
198100*                                                                 19810016
198200     .                                                            19820016
198300*################################################################*19830016
198400 F140-Create-LL                    Section.                       19840016
198500*                                                                 19850016
198600     Move  Ws-Table-Dest           To    R115ILL0-In-Table-Version19860016
198700     Set   R115ILL0-In-Insert      To    True                     19870016
198800*                                                                 19880016
198900     Call  'F115ILL0'              Using R115ILL0-Letter-Line     19890016
199000                                         R7919999-Error-Area      19900016
199100     End-Call                                                     19910016
199200*                                                                 19920016
199300     Evaluate True                                                19930016
199400       When R7919999-Return-Abend                                 19940016
199500         Move  'F141'              To    R7919999-Paragraph       19950016
199600         Perform Z900-Abend                                       19960016
199700*                                                                 19970016
199800       When R7919999-Return-Error                                 19980016
199900         Move  'F142'              To    R7919999-Paragraph       19990016
200000         Perform Z700-Error-AE                                    20000016
200100*                                                                 20010016
200200     End-Evaluate                                                 20020016
200300*                                                                 20030016
200400     .                                                            20040016
200500*################################################################*20050016
200600 F150-Delete-LL-Source             Section.                       20060023
200700*                                                                 20070016
200800     Move  Ws-Table-Source         To    R115ILL0-In-Table-Version20080016
200900     Set   R115ILL0-In-Delete      To    True                     20090016
201000*                                                                 20100016
201100     Move  R115ILL0-CA-Currency    To    R115ILL0-In-CA-Currency  20110023
201200     Move  R115ILL0-PA-Seq-No      To    R115ILL0-In-PA-Seq-No    20120023
201300     Move  R115ILL0-Letter-Type    To    R115ILL0-In-Letter-Type  20130023
201400     Move  R115ILL0-LM-Seq-No      To    R115ILL0-In-LM-Seq-No    20140023
201500     Move  R115ILL0-Text-Type      To    R115ILL0-In-Text-Type    20150023
201600     Move  R115ILL0-Line-No        To    R115ILL0-In-Line-No      20160023
201700*                                                                 20170023
201800     Call  'F115ILL0'              Using R115ILL0-Letter-Line     20180016
201900                                         R7919999-Error-Area      20190016
202000     End-Call                                                     20200016
202100*                                                                 20210016
202200     Evaluate True                                                20220016
202300       When R7919999-Return-Abend                                 20230016
202400         Move  'F151'              To    R7919999-Paragraph       20240016
202500         Perform Z900-Abend                                       20250016
202600*                                                                 20260016
202700       When R7919999-Return-Error                                 20270016
202800         Move  'F152'              To    R7919999-Paragraph       20280016
202900         Perform Z700-Error-AE                                    20290016
203000*                                                                 20300016
203100     End-Evaluate                                                 20310016
203200*                                                                 20320016
203300     .                                                            20330016
203400*################################################################*20340023
203500 F160-Delete-LL-Dest               Section.                       20350023
203600*                                                                 20360023
203700     Move  Ws-Table-Dest           To    R115ILL0-In-Table-Version20370023
203800     Set   R115ILL0-In-Delete      To    True                     20380023
203900*                                                                 20390023
204000     Move  R115ILL0-CA-Currency    To    R115ILL0-In-CA-Currency  20400023
204100     Move  R115ILL0-PA-Seq-No      To    R115ILL0-In-PA-Seq-No    20410023
204200     Move  R115ILL0-Letter-Type    To    R115ILL0-In-Letter-Type  20420023
204300     Move  R115ILL0-LM-Seq-No      To    R115ILL0-In-LM-Seq-No    20430023
204400     Move  R115ILL0-Text-Type      To    R115ILL0-In-Text-Type    20440023
204500     Move  R115ILL0-Line-No        To    R115ILL0-In-Line-No      20450023
204600*                                                                 20460023
204700     Call  'F115ILL0'              Using R115ILL0-Letter-Line     20470023
204800                                         R7919999-Error-Area      20480023
204900     End-Call                                                     20490023
205000*                                                                 20500023
205100     Evaluate True                                                20510023
205200       When R7919999-Return-Abend                                 20520023
205300         Move  'F161'              To    R7919999-Paragraph       20530023
205400         Perform Z900-Abend                                       20540023
205500*                                                                 20550023
205600       When R7919999-Return-Error                                 20560023
205700         Move  'F162'              To    R7919999-Paragraph       20570023
205800         Perform Z700-Error-AE                                    20580023
205900*                                                                 20590023
206000     End-Evaluate                                                 20600023
206100*                                                                 20610023
206200     .                                                            20620023
206300*################################################################*20630023
206400 F200-Handle-WM                    Section.                       20640032
206500*                                                                 20650032
206600     If  R115L140-Accept-Shadow                                   20660032
206700*                                                                 20670032
206800         Perform F211-Find-First-WM-Dest                          20680032
206900         Perform Until R7919999-Return-Error                      20690032
207000*                                                                 20700032
207100            Perform F260-Delete-WM-Dest                           20710032
207200*                                                                 20720032
207300            Perform F221-Find-Next-WM-Dest                        20730032
207400         End-Perform                                              20740032
207500     End-If                                                       20750032
207600*                                                                 20760032
207700     Perform F210-Find-First-WM-Source                            20770032
207800     Perform Until R7919999-Return-Error                          20780032
207900*                                                                 20790032
208000        Perform F240-Create-WM                                    20800032
208100*                                                                 20810032
208200        If  R115L140-Accept-Shadow                                20820032
208300            Perform F250-Delete-WM-Source                         20830032
208400        End-If                                                    20840032
208500*                                                                 20850032
208600        Perform F220-Find-Next-WM-Source                          20860032
208700     End-Perform                                                  20870032
208800*                                                                 20880032
208900     Initialize       R7919999-Error                              20890032
209000*                                                                 20900032
209100     .                                                            20910032
209200*                                                                 20920032
209300 F200-Handle-WM-Ex.                                               20930032
209400     Exit.                                                        20940032
209500*################################################################*20950032
209600 F210-Find-First-WM-Source         Section.                       20960032
209700*                                                                 20970032
209800     Initialize                          R115IWM0-Swift-Message   20980032
209900     Set   R115IWM0-In-Get-1st     To    True                     20990032
210000     Move  Ws-Table-Source         To    R115IWM0-In-Table-Version21000032
210100     Perform F230-Find-WM                                         21010032
210200*                                                                 21020032
210300     .                                                            21030032
210400*################################################################*21040032
210500 F211-Find-First-WM-Dest           Section.                       21050032
210600*                                                                 21060032
210700     Initialize                          R115IWM0-Swift-Message   21070032
210800     Set   R115IWM0-In-Get-1st     To    True                     21080032
210900     Move  Ws-Table-Dest           To    R115IWM0-In-Table-Version21090032
211000     Perform F230-Find-WM                                         21100032
211100*                                                                 21110032
211200     .                                                            21120032
211300*################################################################*21130032
211400 F220-Find-Next-WM-Source          Section.                       21140032
211500*                                                                 21150032
211600     Initialize                          R115IWM0-Swift-Message   21160032
211700     Set   R115IWM0-In-Get-Next    To    True                     21170032
211800     Move  Ws-Table-Source         To    R115IWM0-In-Table-Version21180032
211900     Perform F230-Find-WM                                         21190032
212000*                                                                 21200032
212100     .                                                            21210032
212200*################################################################*21220032
212300 F221-Find-Next-WM-Dest            Section.                       21230032
212400*                                                                 21240032
212500     Initialize                          R115IWM0-Swift-Message   21250032
212600     Set   R115IWM0-In-Get-Next    To    True                     21260032
212700     Move  Ws-Table-Dest           To    R115IWM0-In-Table-Version21270032
212800     Perform F230-Find-WM                                         21280032
212900*                                                                 21290032
213000     .                                                            21300032
213100*################################################################*21310032
213200 F230-Find-WM                      Section.                       21320032
213300*                                                                 21330032
213400*                                                                 21340032
213500     Set   R115IWM0-Version        To    True                     21350032
213600     Move  R115L140-Fin-Inst-No    To    R115IWM0-In-Fin-Inst-No  21360032
213700     Move  R115L140-Contract-Type  To    R115IWM0-In-Contract-Type21370032
213800     Move  R115L140-Contract-No    To    R115IWM0-In-Contract-No  21380032
213900*                                                                 21390032
214000     Call  'F115IWM0'              Using R115IWM0-Swift-Message   21400032
214100                                         R7919999-Error-Area      21410032
214200     End-Call                                                     21420032
214300*                                                                 21430032
214400     Evaluate True                                                21440032
214500       When R7919999-Return-Abend                                 21450032
214600         Move  'F231'              To    R7919999-Paragraph       21460032
214700         Perform Z900-Abend                                       21470032
214800*                                                                 21480032
214900     End-Evaluate                                                 21490032
215000*                                                                 21500032
215100     .                                                            21510032
215200*################################################################*21520032
215300 F240-Create-WM                    Section.                       21530032
215400*                                                                 21540032
215500     Move  Ws-Table-Dest           To    R115IWM0-In-Table-Version21550032
215600     Set   R115IWM0-In-Insert      To    True                     21560032
215700*                                                                 21570032
215800     Call  'F115IWM0'              Using R115IWM0-Swift-Message   21580032
215900                                         R7919999-Error-Area      21590032
216000     End-Call                                                     21600032
216100*                                                                 21610032
216200     Evaluate True                                                21620032
216300       When R7919999-Return-Abend                                 21630032
216400         Move  'F241'              To    R7919999-Paragraph       21640032
216500         Perform Z900-Abend                                       21650032
216600*                                                                 21660032
216700       When R7919999-Return-Error                                 21670032
216800         Move  'F242'              To    R7919999-Paragraph       21680032
216900         Perform Z700-Error-AE                                    21690032
217000*                                                                 21700032
217100     End-Evaluate                                                 21710032
217200*                                                                 21720032
217300     .                                                            21730032
217400*################################################################*21740032
217500 F250-Delete-WM-Source             Section.                       21750032
217600*                                                                 21760032
217700     Move  Ws-Table-Source         To    R115IWM0-In-Table-Version21770032
217800     Set   R115IWM0-In-Delete      To    True                     21780032
217900*                                                                 21790032
218000     Move  R115IWM0-CA-Currency    To    R115IWM0-In-CA-Currency  21800032
218100     Move  R115IWM0-PA-Seq-No      To    R115IWM0-In-PA-Seq-No    21810032
218200     Move  R115IWM0-Message-Type   To    R115IWM0-In-Message-Type 21820032
218300     Move  R115IWM0-WM-Seq-No      To    R115IWM0-In-WM-Seq-No    21830032
218400*                                                                 21840032
218500     Call  'F115IWM0'              Using R115IWM0-Swift-Message   21850032
218600                                         R7919999-Error-Area      21860032
218700     End-Call                                                     21870032
218800*                                                                 21880032
218900     Evaluate True                                                21890032
219000       When R7919999-Return-Abend                                 21900032
219100         Move  'F251'              To    R7919999-Paragraph       21910032
219200         Perform Z900-Abend                                       21920032
219300*                                                                 21930032
219400       When R7919999-Return-Error                                 21940032
219500         Move  'F252'              To    R7919999-Paragraph       21950032
219600         Perform Z700-Error-AE                                    21960032
219700*                                                                 21970032
219800     End-Evaluate                                                 21980032
219900*                                                                 21990032
220000     .                                                            22000032
220100*################################################################*22010032
220200 F260-Delete-WM-Dest               Section.                       22020032
220300*                                                                 22030032
220400     Move  Ws-Table-Dest           To    R115IWM0-In-Table-Version22040032
220500     Set   R115IWM0-In-Delete      To    True                     22050032
220600*                                                                 22060032
220700     Move  R115IWM0-CA-Currency    To    R115IWM0-In-CA-Currency  22070032
220800     Move  R115IWM0-PA-Seq-No      To    R115IWM0-In-PA-Seq-No    22080032
220900     Move  R115IWM0-Message-Type   To    R115IWM0-In-Message-Type 22090032
221000     Move  R115IWM0-WM-Seq-No      To    R115IWM0-In-WM-Seq-No    22100032
221100*                                                                 22110032
221200     Call  'F115IWM0'              Using R115IWM0-Swift-Message   22120032
221300                                         R7919999-Error-Area      22130032
221400     End-Call                                                     22140032
221500*                                                                 22150032
221600     Evaluate True                                                22160032
221700       When R7919999-Return-Abend                                 22170032
221800         Move  'F261'              To    R7919999-Paragraph       22180032
221900         Perform Z900-Abend                                       22190032
222000*                                                                 22200032
222100       When R7919999-Return-Error                                 22210032
222200         Move  'F262'              To    R7919999-Paragraph       22220032
222300         Perform Z700-Error-AE                                    22230032
222400*                                                                 22240032
222500     End-Evaluate                                                 22250032
222600*                                                                 22260032
222700     .                                                            22270032
222800*################################################################*22280032
222900 F300-Handle-WF                    Section.                       22290032
223000*                                                                 22300032
223100     If  R115L140-Accept-Shadow                                   22310032
223200*                                                                 22320032
223300         Perform F311-Find-First-WF-Dest                          22330032
223400         Perform Until R7919999-Return-Error                      22340032
223500*                                                                 22350032
223600            Perform F360-Delete-WF-Dest                           22360032
223700*                                                                 22370032
223800            Perform F321-Find-Next-WF-Dest                        22380032
223900         End-Perform                                              22390032
224000     End-If                                                       22400032
224100*                                                                 22410032
224200     Perform F310-Find-First-WF-Source                            22420032
224300     Perform Until R7919999-Return-Error                          22430032
224400*                                                                 22440032
224500        Perform F340-Create-WF                                    22450032
224600*                                                                 22460032
224700        If  R115L140-Accept-Shadow                                22470032
224800            Perform F350-Delete-WF-Source                         22480032
224900        End-If                                                    22490032
225000*                                                                 22500032
225100        Perform F320-Find-Next-WF-Source                          22510032
225200     End-Perform                                                  22520032
225300*                                                                 22530032
225400     Initialize       R7919999-Error                              22540032
225500*                                                                 22550032
225600     .                                                            22560032
225700*                                                                 22570032
225800 F300-Handle-WF-Ex.                                               22580032
225900     Exit.                                                        22590032
226000*################################################################*22600032
226100 F310-Find-First-WF-Source         Section.                       22610032
226200*                                                                 22620032
226300     Initialize                          R115IWF0-Swift-Field     22630032
226400     Set   R115IWF0-In-Get-1st     To    True                     22640032
226500     Move  Ws-Table-Source         To    R115IWF0-In-Table-Version22650032
226600     Perform F330-Find-WF                                         22660032
226700*                                                                 22670032
226800     .                                                            22680032
226900*################################################################*22690032
227000 F311-Find-First-WF-Dest           Section.                       22700032
227100*                                                                 22710032
227200     Initialize                          R115IWF0-Swift-Field     22720032
227300     Set   R115IWF0-In-Get-1st     To    True                     22730032
227400     Move  Ws-Table-Dest           To    R115IWF0-In-Table-Version22740032
227500     Perform F330-Find-WF                                         22750032
227600*                                                                 22760032
227700     .                                                            22770032
227800*################################################################*22780032
227900 F320-Find-Next-WF-Source          Section.                       22790032
228000*                                                                 22800032
228100     Initialize                          R115IWF0-Swift-Field     22810032
228200     Set   R115IWF0-In-Get-Next    To    True                     22820032
228300     Move  Ws-Table-Source         To    R115IWF0-In-Table-Version22830032
228400     Perform F330-Find-WF                                         22840032
228500*                                                                 22850032
228600     .                                                            22860032
228700*################################################################*22870032
228800 F321-Find-Next-WF-Dest            Section.                       22880032
228900*                                                                 22890032
229000     Initialize                          R115IWF0-Swift-Field     22900032
229100     Set   R115IWF0-In-Get-Next    To    True                     22910032
229200     Move  Ws-Table-Dest           To    R115IWF0-In-Table-Version22920032
229300     Perform F330-Find-WF                                         22930032
229400*                                                                 22940032
229500     .                                                            22950032
229600*################################################################*22960032
229700 F330-Find-WF                      Section.                       22970032
229800*                                                                 22980032
229900*                                                                 22990032
230000     Set   R115IWF0-Version        To    True                     23000032
230100     Move  R115L140-Fin-Inst-No    To    R115IWF0-In-Fin-Inst-No  23010032
230200     Move  R115L140-Contract-Type  To    R115IWF0-In-Contract-Type23020032
230300     Move  R115L140-Contract-No    To    R115IWF0-In-Contract-No  23030032
230400*                                                                 23040032
230500     Call  'F115IWF0'              Using R115IWF0-Swift-Field     23050032
230600                                         R7919999-Error-Area      23060032
230700     End-Call                                                     23070032
230800*                                                                 23080032
230900     Evaluate True                                                23090032
231000       When R7919999-Return-Abend                                 23100032
231100         Move  'F331'              To    R7919999-Paragraph       23110032
231200         Perform Z900-Abend                                       23120032
231300*                                                                 23130032
231400     End-Evaluate                                                 23140032
231500*                                                                 23150032
231600     .                                                            23160032
231700*################################################################*23170032
231800 F340-Create-WF                    Section.                       23180032
231900*                                                                 23190032
232000     Move  Ws-Table-Dest           To    R115IWF0-In-Table-Version23200032
232100     Set   R115IWF0-In-Insert      To    True                     23210032
232200*                                                                 23220032
232300     Call  'F115IWF0'              Using R115IWF0-Swift-Field     23230032
232400                                         R7919999-Error-Area      23240032
232500     End-Call                                                     23250032
232600*                                                                 23260032
232700     Evaluate True                                                23270032
232800       When R7919999-Return-Abend                                 23280032
232900         Move  'F341'              To    R7919999-Paragraph       23290032
233000         Perform Z900-Abend                                       23300032
233100*                                                                 23310032
233200       When R7919999-Return-Error                                 23320032
233300         Move  'F342'              To    R7919999-Paragraph       23330032
233400         Perform Z700-Error-AE                                    23340032
233500*                                                                 23350032
233600     End-Evaluate                                                 23360032
233700*                                                                 23370032
233800     .                                                            23380032
233900*################################################################*23390032
234000 F350-Delete-WF-Source             Section.                       23400032
234100*                                                                 23410032
234200     Move  Ws-Table-Source         To    R115IWF0-In-Table-Version23420032
234300     Set   R115IWF0-In-Delete      To    True                     23430032
234400*                                                                 23440032
234500     Move  R115IWF0-CA-Currency    To    R115IWF0-In-CA-Currency  23450032
234600     Move  R115IWF0-PA-Seq-No      To    R115IWF0-In-PA-Seq-No    23460032
234700     Move  R115IWF0-Message-Type   To    R115IWF0-In-Message-Type 23470032
234800     Move  R115IWF0-WM-Seq-No      To    R115IWF0-In-WM-Seq-No    23480032
234900     Move  R115IWF0-Field-Name     To    R115IWF0-In-Field-Name   23490032
235000     Move  R115IWF0-WF-Seq-No      To    R115IWF0-In-WF-Seq-No    23500032
235100*                                                                 23510032
235200     Call  'F115IWF0'              Using R115IWF0-Swift-Field     23520032
235300                                         R7919999-Error-Area      23530032
235400     End-Call                                                     23540032
235500*                                                                 23550032
235600     Evaluate True                                                23560032
235700       When R7919999-Return-Abend                                 23570032
235800         Move  'F351'              To    R7919999-Paragraph       23580032
235900         Perform Z900-Abend                                       23590032
236000*                                                                 23600032
236100       When R7919999-Return-Error                                 23610032
236200         Move  'F352'              To    R7919999-Paragraph       23620032
236300         Perform Z700-Error-AE                                    23630032
236400*                                                                 23640032
236500     End-Evaluate                                                 23650032
236600*                                                                 23660032
236700     .                                                            23670032
236800*################################################################*23680032
236900 F360-Delete-WF-Dest               Section.                       23690032
237000*                                                                 23700032
237100     Move  Ws-Table-Dest           To    R115IWF0-In-Table-Version23710032
237200     Set   R115IWF0-In-Delete      To    True                     23720032
237300*                                                                 23730032
237400     Move  R115IWF0-CA-Currency    To    R115IWF0-In-CA-Currency  23740032
237500     Move  R115IWF0-PA-Seq-No      To    R115IWF0-In-PA-Seq-No    23750032
237600     Move  R115IWF0-Message-Type   To    R115IWF0-In-Message-Type 23760032
237700     Move  R115IWF0-WM-Seq-No      To    R115IWF0-In-WM-Seq-No    23770032
237800     Move  R115IWF0-Field-Name     To    R115IWF0-In-Field-Name   23780032
237900     Move  R115IWF0-WF-Seq-No      To    R115IWF0-In-WF-Seq-No    23790032
238000*                                                                 23800032
238100     Call  'F115IWF0'              Using R115IWF0-Swift-Field     23810032
238200                                         R7919999-Error-Area      23820032
238300     End-Call                                                     23830032
238400*                                                                 23840032
238500     Evaluate True                                                23850032
238600       When R7919999-Return-Abend                                 23860032
238700         Move  'F361'              To    R7919999-Paragraph       23870032
238800         Perform Z900-Abend                                       23880032
238900*                                                                 23890032
239000       When R7919999-Return-Error                                 23900032
239100         Move  'F362'              To    R7919999-Paragraph       23910032
239200         Perform Z700-Error-AE                                    23920032
239300*                                                                 23930032
239400     End-Evaluate                                                 23940032
239500*                                                                 23950032
239600     .                                                            23960032
239700*################################################################*23970033
239800 F400-Handle-TP                  Section.                         23980033
239900*                                                                 23990033
240000     If  R115L140-Accept-Shadow                                   24000033
240100*                                                                 24010033
240200         Perform F411-Find-First-TP-Dest                          24020033
240300         Perform Until R7919999-Return-Error                      24030033
240400*                                                                 24040033
240500            Perform F460-Delete-TP-Dest                           24050033
240600*                                                                 24060033
240700            Perform F421-Find-Next-TP-Dest                        24070033
240800         End-Perform                                              24080033
240900     End-If                                                       24090033
241000*                                                                 24100033
241100     Perform F410-Find-First-TP-Source                            24110033
241200     Perform Until R7919999-Return-Error                          24120033
241300*                                                                 24130033
241400        Perform F440-Create-TP                                    24140033
241500*                                                                 24150033
241600        If  R115L140-Accept-Shadow                                24160033
241700            Perform F450-Delete-TP-Source                         24170033
241800        End-If                                                    24180033
241900*                                                                 24190033
242000        Perform F420-Find-Next-TP-Source                          24200033
242100     End-Perform                                                  24210033
242200*                                                                 24220033
242300     Initialize       R7919999-Error                              24230033
242400*                                                                 24240033
242500     .                                                            24250033
242600*################################################################*24260033
242700 F410-Find-First-TP-Source         Section.                       24270033
242800*                                                                 24280033
242900     Initialize                          R115ITP0-Tast-Part       24290033
243000     Set   R115ITP0-In-Get-1st     To    True                     24300033
243100     Move  Ws-Table-Source         To    R115ITP0-In-Table-Version24310033
243200     Perform F430-Find-TP                                         24320033
243300*                                                                 24330033
243400     .                                                            24340033
243500*################################################################*24350033
243600 F411-Find-First-TP-Dest           Section.                       24360033
243700*                                                                 24370033
243800     Initialize                          R115ITP0-Tast-Part       24380033
243900     Set   R115ITP0-In-Get-1st     To    True                     24390033
244000     Move  Ws-Table-Dest           To    R115ITP0-In-Table-Version24400033
244100     Perform F430-Find-TP                                         24410033
244200*                                                                 24420033
244300     .                                                            24430033
244400*################################################################*24440033
244500 F420-Find-Next-TP-Source          Section.                       24450033
244600*                                                                 24460033
244700     Initialize                          R115ITP0-Tast-Part       24470033
244800     Set   R115ITP0-In-Get-Next    To    True                     24480033
244900     Move  Ws-Table-Source         To    R115ITP0-In-Table-Version24490033
245000     Perform F430-Find-TP                                         24500033
245100*                                                                 24510033
245200     .                                                            24520033
245300*################################################################*24530033
245400 F421-Find-Next-TP-Dest            Section.                       24540033
245500*                                                                 24550033
245600     Initialize                          R115ITP0-Tast-Part       24560033
245700     Set   R115ITP0-In-Get-Next    To    True                     24570033
245800     Move  Ws-Table-Dest           To    R115ITP0-In-Table-Version24580033
245900     Perform F430-Find-TP                                         24590033
246000*                                                                 24600033
246100     .                                                            24610033
246200*################################################################*24620033
246300 F430-Find-TP                      Section.                       24630033
246400*                                                                 24640033
246500*                                                                 24650033
246600     Set   R115ITP0-Version        To    True                     24660033
246700     Move  R115L140-Fin-Inst-No    To    R115ITP0-In-Fin-Inst-No  24670033
246800     Move  R115L140-Contract-Type  To    R115ITP0-In-Contract-Type24680033
246900     Move  R115L140-Contract-No    To    R115ITP0-In-Contract-No  24690033
247000*                                                                 24700033
247100     Set   R115ITP0-In-Rel-Any     To    True                     24710033
247200*                                                                 24720033
247300     Call  'F115ITP0'              Using R115ITP0-Tast-Part       24730033
247400                                         R7919999-Error-Area      24740033
247500     End-Call                                                     24750033
247600*                                                                 24760033
247700     Evaluate True                                                24770033
247800       When R7919999-Return-Abend                                 24780033
247900         Move  'E231'              To    R7919999-Paragraph       24790033
248000         Perform Z900-Abend                                       24800033
248100*                                                                 24810033
248200     End-Evaluate                                                 24820033
248300*                                                                 24830033
248400     .                                                            24840033
248500*################################################################*24850033
248600 F440-Create-TP                    Section.                       24860033
248700*                                                                 24870033
248800     Move  Ws-Table-Dest           To    R115ITP0-In-Table-Version24880033
248900     Set   R115ITP0-In-Insert      To    True                     24890033
249000*                                                                 24900033
249100     Call  'F115ITP0'              Using R115ITP0-Tast-Part       24910033
249200                                         R7919999-Error-Area      24920033
249300     End-Call                                                     24930033
249400*                                                                 24940033
249500     Evaluate True                                                24950033
249600       When R7919999-Return-Abend                                 24960033
249700         Move  'E241'              To    R7919999-Paragraph       24970033
249800         Perform Z900-Abend                                       24980033
249900*                                                                 24990033
250000       When R7919999-Return-Error                                 25000033
250100         Move  'E242'              To    R7919999-Paragraph       25010033
250200         Perform Z700-Error-AE                                    25020033
250300*                                                                 25030033
250400     End-Evaluate                                                 25040033
250500*                                                                 25050033
250600     .                                                            25060033
250700*################################################################*25070033
250800 F450-Delete-TP-Source             Section.                       25080033
250900*                                                                 25090033
251000     Move  Ws-Table-Source         To    R115ITP0-In-Table-Version25100033
251100     Set   R115ITP0-In-Delete      To    True                     25110033
251200*                                                                 25120033
251300     Move  R115ITP0-CA-Currency    To    R115ITP0-In-CA-Currency  25130033
251400     Move  R115ITP0-PA-Seq-No      To    R115ITP0-In-PA-Seq-No    25140033
251500     Move  R115ITP0-Role-Type      To    R115ITP0-In-Role-Type    25150033
251600     Move  R115ITP0-Relation       To    R115ITP0-In-Relation     25160033
251700*                                                                 25170033
251800     Call  'F115ITP0'              Using R115ITP0-Tast-Part       25180034
251900                                         R7919999-Error-Area      25190033
252000     End-Call                                                     25200033
252100*                                                                 25210033
252200     Evaluate True                                                25220033
252300       When R7919999-Return-Abend                                 25230033
252400         Move  'F451'              To    R7919999-Paragraph       25240033
252500         Perform Z900-Abend                                       25250033
252600*                                                                 25260033
252700       When R7919999-Return-Error                                 25270033
252800         Move  'F452'              To    R7919999-Paragraph       25280033
252900         Perform Z700-Error-AE                                    25290033
253000*                                                                 25300033
253100     End-Evaluate                                                 25310033
253200*                                                                 25320033
253300     .                                                            25330033
253400*################################################################*25340033
253500 F460-Delete-TP-Dest               Section.                       25350033
253600*                                                                 25360033
253700     Move  Ws-Table-Dest           To    R115ITP0-In-Table-Version25370033
253800     Set   R115ITP0-In-Delete      To    True                     25380033
253900*                                                                 25390033
254000     Move  R115ITP0-CA-Currency    To    R115ITP0-In-CA-Currency  25400033
254100     Move  R115ITP0-PA-Seq-No      To    R115ITP0-In-PA-Seq-No    25410033
254200     Move  R115ITP0-Role-Type      To    R115ITP0-In-Role-Type    25420033
254300     Move  R115ITP0-Relation       To    R115ITP0-In-Relation     25430033
254400*                                                                 25440033
254500     Call  'F115ITP0'              Using R115ITP0-Tast-Part       25450033
254600                                         R7919999-Error-Area      25460033
254700     End-Call                                                     25470033
254800*                                                                 25480033
254900     Evaluate True                                                25490033
255000       When R7919999-Return-Abend                                 25500033
255100         Move  'F461'              To    R7919999-Paragraph       25510033
255200         Perform Z900-Abend                                       25520033
255300*                                                                 25530033
255400       When R7919999-Return-Error                                 25540033
255500         Move  'F462'              To    R7919999-Paragraph       25550033
255600         Perform Z700-Error-AE                                    25560033
255700*                                                                 25570033
255800     End-Evaluate                                                 25580033
255900*                                                                 25590033
256000     .                                                            25600033
256100*################################################################*25610032
256200 H000-Delete-Shadow                Section.                       25620032
256300*                                                                 25630032
256400     Perform H200-Handle-CC                                       25640032
256500     Perform H300-Handle-RP                                       25650028
256600     Perform H400-Handle-EI                                       25660028
256700     Perform H500-Handle-CA                                       25670028
256800     Perform H600-Handle-PA                                       25680028
256900     Perform H700-Handle-SE                                       25690028
257000     Perform H800-Handle-PC                                       25700028
257100     Perform H900-Handle-CH                                       25710028
257200     Perform I000-Handle-LM                                       25720028
257300     Perform I100-Handle-LL                                       25730028
257400     Perform I200-Handle-WM                                       25740032
257500     Perform I300-Handle-WF                                       25750032
257600     Perform I400-Handle-TP                                       25760033
257700*                                                                 25770016
257800     Move  Ws-Table-Source        To    R115IMC0-In-Table-Version 25780028
257900     Perform E140-Delete-MC                                       25790028
258000*                                                                 25800028
258100     Set  R115IMC0-In-Progress-No To    True                      25810028
258200*                                                                 25820028
258300     Move  'ACTUAL'               To    R115IMC0-In-Table-Version 25830028
258400     Perform E120-Update-MC                                       25840028
258500*                                                                 25850028
258600     .                                                            25860016
258700*################################################################*25870016
258800 H200-Handle-CC                    Section.                       25880028
258900*                                                                 25890004
259000     Perform E210-Find-First-CC-Source                            25900028
259100     Perform Until R7919999-Return-Error                          25910028
259200*                                                                 25920028
259300         Perform E250-Delete-CC-Source                            25930028
259400*                                                                 25940028
259500         Perform E220-Find-Next-CC-Source                         25950028
259600     End-Perform                                                  25960028
259700*                                                                 25970028
259800     .                                                            25980028
259900*################################################################*25990028
260000 H300-Handle-RP                    Section.                       26000028
260100*                                                                 26010028
260200     Perform E310-Find-First-RP-Source                            26020033
260300     Perform Until R7919999-Return-Error                          26030028
260400*                                                                 26040028
260500        Perform E350-Delete-RP-Source                             26050033
260600*                                                                 26060028
260700        Perform E320-Find-Next-RP-Source                          26070033
260800     End-Perform                                                  26080028
260900*                                                                 26090028
261000     .                                                            26100028
261100*################################################################*26110028
261200 H400-Handle-EI                   Section.                        26120028
261300*                                                                 26130028
261400     Perform E410-Find-First-EI-Source                            26140028
261500     Perform Until R7919999-Return-Error                          26150028
261600*                                                                 26160028
261700        Perform E450-Delete-EI-Source                             26170028
261800*                                                                 26180028
261900        Perform E420-Find-Next-EI-Source                          26190028
262000     End-Perform                                                  26200028
262100*                                                                 26210028
262200     .                                                            26220028
262300*################################################################*26230028
262400 H500-Handle-CA                   Section.                        26240028
262500*                                                                 26250028
262600     Perform E510-Find-First-CA-Source                            26260028
262700     Perform Until R7919999-Return-Error                          26270028
262800*                                                                 26280028
262900        Perform E550-Delete-CA-Source                             26290028
263000*                                                                 26300028
263100        Perform E520-Find-Next-CA-Source                          26310028
263200     End-Perform                                                  26320028
263300*                                                                 26330028
263400     .                                                            26340028
263500*################################################################*26350028
263600 H600-Handle-PA                   Section.                        26360028
263700*                                                                 26370028
263800     Perform E610-Find-First-PA-Source                            26380028
263900     Perform Until R7919999-Return-Error                          26390028
264000*                                                                 26400028
264100        Perform E650-Delete-PA-Source                             26410028
264200*                                                                 26420028
264300        Perform E620-Find-Next-PA-Source                          26430028
264400     End-Perform                                                  26440028
264500*                                                                 26450028
264600     .                                                            26460028
264700*################################################################*26470028
264800 H700-Handle-SE                   Section.                        26480028
264900*                                                                 26490028
265000     Perform E710-Find-First-SE-Source                            26500028
265100     Perform Until R7919999-Return-Error                          26510028
265200*                                                                 26520028
265300        Perform E750-Delete-SE-Source                             26530028
265400*                                                                 26540028
265500        Perform E720-Find-Next-SE-Source                          26550028
265600     End-Perform                                                  26560028
265700*                                                                 26570028
265800     .                                                            26580028
265900*################################################################*26590028
266000 H800-Handle-PC                   Section.                        26600028
266100*                                                                 26610028
266200     Perform E810-Find-First-PC-Source                            26620028
266300     Perform Until R7919999-Return-Error                          26630028
266400*                                                                 26640028
266500        Perform E850-Delete-PC-Source                             26650028
266600*                                                                 26660028
266700        Perform E820-Find-Next-PC-Source                          26670028
266800     End-Perform                                                  26680028
266900*                                                                 26690028
267000     .                                                            26700028
267100*################################################################*26710028
267200 H900-Handle-CH                   Section.                        26720028
267300*                                                                 26730028
267400     Perform E910-Find-First-CH-Source                            26740028
267500     Perform Until R7919999-Return-Error                          26750028
267600*                                                                 26760028
267700        Perform E950-Delete-CH-Source                             26770028
267800*                                                                 26780028
267900        Perform E920-Find-Next-CH-Source                          26790028
268000     End-Perform                                                  26800028
268100*                                                                 26810028
268200     .                                                            26820028
268300*################################################################*26830028
268400 I000-Handle-LM                   Section.                        26840028
268500*                                                                 26850028
268600     Perform F010-Find-First-LM-Source                            26860028
268700     Perform Until R7919999-Return-Error                          26870028
268800*                                                                 26880028
268900        Perform F050-Delete-LM-Source                             26890028
269000*                                                                 26900028
269100        Perform F020-Find-Next-LM-Source                          26910028
269200     End-Perform                                                  26920028
269300*                                                                 26930028
269400     .                                                            26940028
269500*################################################################*26950028
269600 I100-Handle-LL                   Section.                        26960028
269700*                                                                 26970028
269800     Perform F110-Find-First-LL-Source                            26980028
269900     Perform Until R7919999-Return-Error                          26990028
270000*                                                                 27000028
270100        Perform F150-Delete-LL-Source                             27010028
270200*                                                                 27020028
270300        Perform F120-Find-Next-LL-Source                          27030028
270400     End-Perform                                                  27040028
270500*                                                                 27050028
270600     .                                                            27060028
270700*################################################################*27070028
270800 I200-Handle-WM                   Section.                        27080032
270900*                                                                 27090032
271000     Perform F210-Find-First-WM-Source                            27100032
271100     Perform Until R7919999-Return-Error                          27110032
271200*                                                                 27120032
271300        Perform F250-Delete-WM-Source                             27130032
271400*                                                                 27140032
271500        Perform F220-Find-Next-WM-Source                          27150032
271600     End-Perform                                                  27160032
271700*                                                                 27170032
271800     .                                                            27180032
271900*################################################################*27190032
272000 I300-Handle-WF                   Section.                        27200032
272100*                                                                 27210032
272200     Perform F310-Find-First-WF-Source                            27220032
272300     Perform Until R7919999-Return-Error                          27230032
272400*                                                                 27240032
272500        Perform F350-Delete-WF-Source                             27250032
272600*                                                                 27260032
272700        Perform F320-Find-Next-WF-Source                          27270032
272800     End-Perform                                                  27280032
272900*                                                                 27290032
273000     .                                                            27300032
273100*################################################################*27310033
273200 I400-Handle-TP                    Section.                       27320033
273300*                                                                 27330033
273400     Perform F410-Find-First-TP-Source                            27340033
273500     Perform Until R7919999-Return-Error                          27350033
273600*                                                                 27360033
273700        Perform F450-Delete-TP-Source                             27370033
273800*                                                                 27380033
273900        Perform F420-Find-Next-TP-Source                          27390033
274000     End-Perform                                                  27400033
274100*                                                                 27410033
274200     .                                                            27420033
274300*################################################################*27430032
274400 Z000-Error-Message                Section.                       27440032
274500*                                                                 27450028
274600     Set   R7918030-Version        To    True                     27460028
274700*                                                                 27470001
274800     Move  'TF'                    To    R7918030-In-System-ID    27480001
274900     Move  R115X000-Fin-Inst-No    To    R7918030-In-Fin-Inst-No  27490001
275000     Move  R115X000-FI-Language-639-1                             27500001
275100                                   To    R7918030-In-Language     27510001
275200*                                                                 27520001
275300     If  R115X000-Trace-On                                        27530001
275400         Set  R7918030-In-Log-Yes  To    True                     27540001
275500     End-If                                                       27550001
275600*                                                                 27560001
275700     Call  'F7918030'              Using R7918030-ErrorMessage    27570001
275800     End-Call                                                     27580001
275900*                                                                 27590001
276000     Move  R7918030-Out-MessageText                               27600001
276100                                   To    R7919999-Message         27610001
276200*                                                                 27620001
276300     .                                                            27630001
276400*################################################################*27640001
276500 ZI00-Konv-Input-Version           Section.                       27650001
276600*                                                                 27660001
276700* Version control.                                                27670001
276800* If conversion is needed, we call the conversion module.         27680001
276900*                                                                 27690001
277000     Set   R115L140-Version        To    True                     27700001
277100     Move  Length                  Of    R115L140-Shadow          27710004
277200                                   To    W-IO-Length              27720001
277300*                                                                 27730001
277400     Evaluate True                                                27740001
277500       When L-Ext-IO-Area (1:8)    =     R115L140-Version-No      27750001
277600       and  Length                 Of    L-Ext-IO-Area            27760001
277700                                   Not < W-IO-Length              27770001
277800         Move  L-Ext-IO-Area (1:W-IO-Length)                      27780001
277900                                   To    W-Int-IO-Area            27790001
278000*                                                                 27800001
278100       When Other                                                 27810001
278200         Call  'F115L999'                                         27820001
278300             Using By Content      'F115L140 '                    27830001
278400                                   'INPUT '                       27840001
278500                   By Reference    L-Ext-IO-Area                  27850001
278600                                   W-Int-IO-Area                  27860001
278700                                   R7919999-Error-Area            27870001
278800         End-Call                                                 27880001
278900*                                                                 27890001
279000         If  R7919999-Return-Abend                                27900001
279100             Move  'ZI03'          To    R7919999-Paragraph       27910014
279200             Perform Z900-Abend                                   27920001
279300         End-If                                                   27930001
279400*                                                                 27940001
279500     End-Evaluate                                                 27950001
279600*                                                                 27960001
279700     .                                                            27970001
279800*################################################################*27980001
279900 ZO00-Konv-Output-Version          Section.                       27990001
280000*                                                                 28000001
280100* Version control.                                                28010001
280200* If conversion is needed, we call the conversion module.         28020001
280300*                                                                 28030001
280400     Evaluate True                                                28040001
280500       When L-Ext-IO-Area (1:8)    =     R115L140-Version-No      28050001
280600       and  Length                 Of    L-Ext-IO-Area            28060001
280700                                   Not < W-IO-Length              28070001
280800         Move  W-Int-IO-Area       To    L-Ext-IO-Area            28080001
280900                                                   (1:W-IO-Length)28090001
281000*                                                                 28100001
281100       When Other                                                 28110001
281200         Call  'F115L999'                                         28120001
281300             Using By Content      'F115L140 '                    28130001
281400                                   'OUTPUT '                      28140001
281500                   By Reference    L-Ext-IO-Area                  28150001
281600                                   W-Int-IO-Area                  28160001
281700                                   R7919999-Error-Area            28170001
281800         End-Call                                                 28180001
281900*                                                                 28190001
282000         If  R7919999-Return-Abend                                28200001
282100             Move  'ZO01'          To    R7919999-Paragraph       28210001
282200             Perform Z900-Abend                                   28220001
282300         End-If                                                   28230001
282400*                                                                 28240001
282500     End-Evaluate                                                 28250001
282600*                                                                 28260001
282700     .                                                            28270001
282800*################################################################*28280001
282900 Z500-OK-Return                    Section.                       28290001
283000*                                                                 28300001
283100     Move  Spaces                  To    R7919999-Message         28310001
283200     Initialize                          R7919999-Error           28320001
283300*                                                                 28330001
283400     Goback.                                                      28340001
283500*################################################################*28350001
283600 Z600-Warning-AW                   Section.                       28360001
283700*                                                                 28370001
283800     If  R7919999-Return-Code      Not   Numeric                  28380001
283900     or  Not R7919999-Return-Abend                                28390001
284000         Move  +0                  To    R7919999-Module-Ind      28400001
284100     End-If                                                       28410001
284200*                                                                 28420001
284300     Add   +1                      To    R7919999-Module-Ind      28430001
284400*                                                                 28440001
284500     If  R7919999-Module-Ind       Not >                          28450001
284600                       ( Length    Of    R7919999-Module-Tab      28460001
284700                       / Length    Of    R7919999-Module-Element )28470001
284800         Move  'F115L140'          To    R7919999-Module-Name     28480001
284900                                             (R7919999-Module-Ind)28490001
285000         Move  R7919999-Paragraph  To    R7919999-Module-Para     28500001
285100                                             (R7919999-Module-Ind)28510001
285200     End-If                                                       28520001
285300*                                                                 28530001
285400     Set   R7919999-Return-Warning To    TRUE                     28540001
285500*                                                                 28550001
285600     Goback.                                                      28560001
285700*################################################################*28570001
285800 Z700-Error-AE                     Section.                       28580001
285900*                                                                 28590001
286000     If  R7919999-Return-Code      Not   Numeric                  28600001
286100     or  Not R7919999-Return-Abend                                28610001
286200         Move  +0                  To    R7919999-Module-Ind      28620001
286300     End-If                                                       28630001
286400*                                                                 28640001
286500     Add   +1                      To    R7919999-Module-Ind      28650001
286600*                                                                 28660001
286700     If  R7919999-Module-Ind       Not >                          28670001
286800                       ( Length    Of    R7919999-Module-Tab      28680001
286900                       / Length    Of    R7919999-Module-Element )28690001
287000         Move  'F115L140'          To    R7919999-Module-Name     28700001
287100                                             (R7919999-Module-Ind)28710001
287200         Move  R7919999-Paragraph  To    R7919999-Module-Para     28720001
287300                                             (R7919999-Module-Ind)28730001
287400     End-If                                                       28740001
287500*                                                                 28750001
287600     Set   R7919999-Return-Error   To    TRUE                     28760001
287700*                                                                 28770001
287800     Goback.                                                      28780001
287900*################################################################*28790001
288000 Z900-Abend                        Section.                       28800001
288100*                                                                 28810001
288200     If  R7919999-Return-Code      Not   Numeric                  28820001
288300     or  Not R7919999-Return-Abend                                28830001
288400         Move  +0                  To    R7919999-Module-Ind      28840001
288500     End-If                                                       28850001
288600*                                                                 28860001
288700     Add   +1                      To    R7919999-Module-Ind      28870001
288800*                                                                 28880001
288900     If  R7919999-Module-Ind       Not >                          28890001
289000                       ( Length    Of    R7919999-Module-Tab      28900001
289100                       / Length    Of    R7919999-Module-Element )28910001
289200         Move  'F115L140'          To    R7919999-Module-Name     28920001
289300                                             (R7919999-Module-Ind)28930001
289400         Move  R7919999-Paragraph  To    R7919999-Module-Para     28940001
289500                                             (R7919999-Module-Ind)28950001
289600     End-If                                                       28960001
289700*                                                                 28970001
289800     Set   R7919999-Return-Abend   To    TRUE                     28980001
289900*                                                                 28990001
290000     Goback.                                                      29000001
