       Identification Division.                                         00010000
       Program-ID. F115IRP0.                                            00020000
       Author.  Henning Langfeldt Rødland.                              00030000
      *################################################################*00040000
      *                                                                 00050000
      * FD Trade Finance                                                00060000
      *                                                                 00070000
      * Interface for all database access on table TF_Related_Party.    00080000
      *                                                                 00090000
      * The interface kan read one spesific occurence,                  00100000
      * or several occurences, fully or partly qualified with           00110000
      * from- and to- values.                                           00120000
      *                                                                 00130000
      * When reading several occurences, one must always start with     00140000
      * -In-Get-1st, and continue with -In-Get-Next.                    00150000
      *                                                                 00160000
      * NB!  There are several key-fields, which may be used            00170000
      *      differently depending on the need.                         00180000
      *      See seperate description below.                            00190000
      *                                                                 00200000
      *                                                                 00210000
      * An ordinary Select call may look like this:                     00220019
      *                                                                 00230019
      *    Initialize                          R115IRP0-Related-Party   00240019
      *    Set   R115IRP0-Version        To    True                     00250019
      *    Set   R115IRP0-In-Select      To    True                     00260019
      *                                                                 00270019
      * One of these:                                                   00280035
      * 1) Set   R115IRP0-In-Actual      To    True                     00290035
      * 2) Set   R115IRP0-In-Work        To    True                     00300035
      *                                                                 00310035
      * One of these:                                                   00320019
      * 1) Move  &fin-inst-id            To    R115IRP0-In-Fin-Inst-ID  00330019
      * 2) Move  &fin-inst-no            To    R115IRP0-In-Fin-Inst-No  00340019
      *                                                                 00350019
      *    Move  &contract-type          To    R115IRP0-In-Contract-Type00360019
      *    Move  &contract-no            To    R115IRP0-In-Contract-No  00370019
      *    Move  &role-type              To    R115IRP0-In-Role-Type    00380019
      *                                                                 00390019
      * To specify relation to Main_Contract or Part_Amount:            00400019
      * One of these: (3rd only for cursors)                            00410019
      * 1) Set   R115IRP0-In-Rel-MC      To    True                     00420019
      * 2) Set   R115IRP0-In-Rel-PA      To    True                     00430019
      * 3) Set   R115IRP0-In-Rel-All     To    True                     00440019
      *                                                                 00450019
      * If you want Related Party for a Part_Amount, fill in these:     00460019
      *    Move  &currency (ISO 4217)    To    R115IRP0-In-CA-Currency  00470019
      *    Move  &part-amount seq.no     To    R115IRP0-In-PA-Seq-No    00480019
      *                                                                 00490019
      *    Call  'F115IRP0'              Using R115IRP0-Related-Party   00500000
      *                                        R7919999-Error-Area      00510000
      *    End-Call                                                     00520000
      *                                                                 00530000
      *    Evaluate True                                                00540000
      *      When R7919999-Return-Abend                                 00550000
      *        Move  '&&&&'              To    R7919999-Paragraph       00560000
      *        Perform Z900-Abend                                       00570000
      *                                                                 00580000
      *      When R7919999-Return-Error                                 00590000
      *        ...not found...                                          00600000
      *                                                                 00610000
      *      When R7919999-Return-OK                                    00620000
      *        ...found...                                              00630000
      *                                                                 00640000
      *    End-Evaluate                                                 00650000
      *                                                                 00660000
      *################################################################*00670000
      * Date ! Si! Change description                            ! 3A ! 00680000
      *------+---+-----------------------------------------------+----+ 00690000
      *131011!NDL! New Cursor Fi-CT-Cu-Asc                   OPP016097! 00700059
      *011001!NDL! New Cursor FI-RO                              !LR12! 00700159
      *130701!NDL! Deleted Bic-Info                              !LR12! 00700259
      *200201!NDL! Added Cursor FI-CU                            !LT12! 00700359
      *050101!NDL! Added BIC-Info                                !LR12! 00700459
      *190600!HLR! Removed cursors CT, RO, CTN, CTN-PA, CT-RO,   !LO18! 00701051
      *      !   ! CTN-RO, CTN-PA-RO.                            !    ! 00710049
      *      !   ! Changed cursor-qual. on FK_TFMC_Contr_Type    !    ! 00720049
      *      !   ! from "Like" to "=".                           !    ! 00730049
      *      !   ! Removed interval on Contract-No.              !    ! 00740050
      *290499!HLR! Added relation to TF_Part_Amount              !LG10! 00750019
      *      !   ! Removed Work_Status                           !    ! 00760019
      *100399!HLR! New module                                    !LG10! 00770000
      *################################################################*00780000
       Environment Division.                                            00790000
       Configuration Section.                                           00800000
       Special-Names.                                                   00810000
           Decimal-Point Is Comma.                                      00820000
      *                                                                 00830000
      *################################################################*00840000
       Data Division.                                                   00850000
       Working-Storage Section.                                         00860000
      *                                                                 00870000
       01  Filler.                                                      00880000
      *                                                                 00890000
           05  W-Table-Name              Pic  X(18) Value               00900000
                                                   'TF_Related_Party  '.00910038
             88  SW-Table-Actual             Value 'TF_Related_Party  '.00920038
             88  SW-Table-Work               Value 'TF_Work_RP        '.00930038
      *                                                                 00940000
           05  W-IO-Length               Pic S9(04)              Comp.  00950000
           05  W-Tally                   Pic S9(05)              Comp.  00960029
      *                                                                 00970000
           05  WD-Length                 Pic  Z.ZZ9.                    00980000
      *                                                                 00990000
           05  Ind-WS-Put                Pic S9(04)              Comp.  01000000
           05  Ind-WS                    Pic S9(04)              Comp.  01010000
           05  W-Max-Occ-WS-Tab          Pic S9(04)              Comp.  01020000
      *                                                                 01030000
           05  Filler.                                                  01040000
               10  WD-Fin-Inst-ID        Pic  zzzzzzzzzzzzzzzzz9.       01050000
               10  WD-Contract-No        Pic  9999999.                  01060000
               10  WD-PA-Seq-No          Pic  zzz9.                     01070019
      *                                                                 01080000
           05  Filler.                                                  01090000
               10  W-Fin-Inst-No         Pic  X(18).                    01100000
               10  W-Fin-Inst-ID         Pic S9(18)              Comp-3.01110002
               10  W-Customer-No         Pic S9(11)              Comp-3.01120002
               10  W-Customer-ID         Pic S9(11)              Comp-3.01130002
      *                                                                 01140000
           05  W-Input-Action            Pic  X(10).                    01150000
             88  SW-IA-Initialize                   Value 'INITIALIZE'. 01160000
      *                                                                 01170000
      *    This field is needed because of the old interfaces used to   01180000
      *    access Fin-Inst-ID and Customer ID.                          01190000
           05  W-Tmp-Konsern-Nr          Pic  9(04).                    01200000
      *                                                                 01210000
      *----------------------------------------------------------------*01220000
      * Counters, used on cursor read, to return row no. and total      01230000
      * no. of rows.                                                    01240000
      * Total no. of rows is only returned when -In-Count is set on     01250000
      * the Get-1st-call.                                               01260000
      *                                                                 01270000
           05  WC-Counters.                                             01280000
               10  WC-Row-No             Pic S9(11)              Comp-3.01290000
               10  WC-Total-No-Of-Rows   Pic S9(11)              Comp-3.01300000
      *                                                                 01310000
      *----------------------------------------------------------------*01320000
      * Switches used for selecting the correct cursor:                 01330000
      *                                                                 01340000
           05  SW-Cursor-Code.                                          01350000
               10  SW-CC-Fin-Inst        Pic  X(01).                    01360000
                 88  SW-Use-Fin-Inst                Value 'F'.          01370000
               10  SW-CC-Contract-Type   Pic  X(01).                    01380000
                 88  SW-Use-Contract-Type           Value 'T'.          01390000
               10  SW-CC-Contract-No     Pic  X(01).                    01400000
                 88  SW-Use-Contract-No             Value 'N'.          01410000
               10  SW-CC-Part-Amount     Pic  X(01).                    01420019
                 88  SW-Use-Part-Amount             Value 'P'.          01430019
               10  SW-CC-Role            Pic  X(01).                    01440000
                 88  SW-Use-Role                    Value 'R'.          01450000
               10  SW-CC-Customer-ID     Pic  X(01).                    01460043
                 88  SW-Use-Customer-ID             Value 'C'.          01470043
      *                                                                 01480000
           05  Filler                    Redefines SW-Cursor-Code       01490000
                                         Pic  X(06).                    01500043
             88  SW-Use-Fi-Asc                      Value 'F     '.     01510043
             88  SW-Use-Fi-CT-Asc                   Value 'FT    '.     01520043
             88  SW-Use-Fi-CT-Cu-Asc                Value 'FT   C'.     01520159
             88  SW-Use-Fi-CU-Asc                   Value 'F    C'.     01521053
             88  SW-Use-Fi-Ro-Asc                   Value 'F   R '.     01530043
             88  SW-Use-Fi-CTN-Asc                  Value 'FTN   '.     01540046
             88  SW-Use-Fi-CTN-PA-Asc               Value 'FTNP  '.     01550046
             88  SW-Use-Fi-CT-Ro-Asc                Value 'FT  R '.     01560043
             88  SW-Use-Fi-CT-Ro-Cu-Asc             Value 'FT  RC'.     01570043
             88  SW-Use-Fi-CTN-Ro-Asc               Value 'FTN R '.     01580046
             88  SW-Use-Fi-CTN-Ro-Cu-Asc            Value 'FTN RC'.     01590046
             88  SW-Use-Fi-CTN-PA-Ro-Asc            Value 'FTNPR '.     01600046
      *                                                                 01610000
      *----------------------------------------------------------------*01620000
      * These fields are used for SQL qualification:                    01630000
      *                                                                 01640000
           05  W-DB-Key.                                                01650000
               10  W-DB-Fin-Inst-ID      Pic S9(18)              Comp-3.01660000
               10  W-DB-Contract-Type    Pic  X(03).                    01670000
               10  W-DB-Contract-No      Pic S9(07)              Comp-3.01680050
               10  W-DB-CA-Currency      Pic  X(03).                    01690019
               10  W-DB-From-PA-Seq-No   Pic S9(04)              Comp.  01700019
               10  W-DB-To-PA-Seq-No     Pic S9(04)              Comp.  01710019
               10  W-DB-Role-Type        Pic  X(05).                    01720019
               10  W-DB-Customer-ID      Pic S9(11)              Comp-3.01730043
      *                                                                 01740000
      *----------------------------------------------------------------*01750000
      * These fields are used for comparison with the WS-fields.        01760000
      *                                                                 01770000
           05  WE-Cursor-Info.                                          01780000
             07  WE-Key.                                                01790000
               10  WE-Fin-Inst-ID        Pic S9(18)              Comp-3.01800000
               10  WE-Fin-Inst-No        Pic  X(18).                    01810000
               10  WE-Contract-Type      Pic  X(03).                    01820000
               10  WE-Contract-No        Pic S9(07)              Comp-3.01830050
               10  WE-CA-Currency        Pic  X(03).                    01840019
               10  WE-From-PA-Seq-No     Pic S9(04)              Comp.  01850019
               10  WE-To-PA-Seq-No       Pic S9(04)              Comp.  01860019
               10  WE-Role-Type          Pic  X(05).                    01870000
               10  WE-Customer-ID        Pic S9(11)              Comp-3.01880043
               10  WE-Customer-No        Pic S9(11)              Comp-3.01890047
             07  WE-Code-Sequence        Pic  X(01).                    01900000
               88  WE-CS-Ascending                  Value 'A'.          01910000
               88  WE-CS-Descending                 Value 'D'.          01920000
      *                                                                 01930000
      *----------------------------------------------------------------*01940000
      * Storage, and switches for identifying the content:              01950000
      * The cursor info is used to verify that the get-next has the     01960000
      * same qualification as the get-1st.                              01970000
      *                                                                 01980000
       01  W-Storage.                                                   01990000
      *                                                                 02000000
           05  WS-Cursor-Info.                                          02010000
             07  WS-Key.                                                02020000
               10  WS-Fin-Inst-ID        Pic S9(18)              Comp-3.02030000
               10  WS-Fin-Inst-No        Pic  X(18).                    02040000
               10  WS-Contract-Type      Pic  X(03).                    02050000
               10  WS-Contract-No        Pic S9(07)              Comp-3.02060050
               10  WS-CA-Currency        Pic  X(03).                    02070019
               10  WS-From-PA-Seq-No     Pic S9(04)              Comp.  02080019
               10  WS-To-PA-Seq-No       Pic S9(04)              Comp.  02090019
               10  WS-Role-Type          Pic  X(05).                    02100005
               10  WS-Customer-ID        Pic S9(11)              Comp-3.02110043
               10  WS-Customer-No        Pic S9(11)              Comp-3.02120047
             07  WS-Code-Sequence        Pic  X(01).                    02130000
               88  WS-CS-Ascending                  Value 'A'.          02140000
               88  WS-CS-Descending                 Value 'D'.          02150000
             07  WS-Cursor-Status        Pic  X(08).                    02160000
               88  WS-Cursor-OK                     Value 'OK'.         02170000
               88  WS-Cursor-End                    Value 'END'.        02180000
      *                                                                 02190000
      * We store all occurences that are read, also those that we do    02200000
      * not find. This is to reduce the number of DB2 accesses.         02210000
      *                                                                 02220000
           05  WS-DB2-Table.                                            02230000
             07  WS-DB2-Row              Occurs 10 Times.               02240000
               10  WS-DB2-Tbl-Version    Pic  X(16).                    02250036
               10  WS-DB2-Fin-Inst-ID    Pic S9(18)              Comp-3.02260000
               10  WS-DB2-Contract-Type  Pic  X(03).                    02270000
               10  WS-DB2-Contract-No    Pic S9(07)              Comp-3.02280000
               10  WS-DB2-CA-Currency    Pic  X(03).                    02290019
               10  WS-DB2-PA-Seq-No      Pic S9(04)              Comp.  02300019
               10  WS-DB2-Role-Type      Pic  X(05).                    02310019
               10  WS-DB2-Row-Status     Pic S9(01)              Comp-3.02320009
                 88  WS-DB2-Not-Read                Value +0.           02330000
                 88  WS-DB2-Read                    Value +1.           02340000
                 88  WS-DB2-Not-Found               Value +2.           02350000
               10  WS-DB2-DCL            Pic  X(250).                   02360000
      *                                                                 02370000
      *----------------------------------------------------------------*02380000
      * Areas for use when accessing DB2.                               02390000
      *                                                                 02400000
           Exec SQL Include R115TFRP End-Exec.                          02410000
      *                                                                 02420000
      *----------------------------------------------------------------*02430000
      * Internal area:                                                  02440000
      *                                                                 02450000
       01  W-Int-IO-Area.                                               02460000
           Copy R115IRP0.                                               02470000
      *                                                                 02480000
      *----------------------------------------------------------------*02490000
      * Assorted copy-areas:                                            02500000
      *                                                                 02510000
       01  Filler.                                                      02520000
           Copy R115IRPS.                                               02530000
      *                                                                 02540000
       01  Filler.                                                      02550002
           Copy R1781910.                                               02560002
      *                                                                 02570002
       01  Filler.                                                      02580000
           Copy R5879010.                                               02590000
      *                                                                 02600002
       01  Filler.                                                      02610000
           Copy R7918030.                                               02620000
      *                                                                 02630000
       Copy R115X000.                                                   02640000
      *                                                                 02650000
      *################################################################.02660000
       Linkage Section.                                                 02670000
      *                                                                 02680000
       01  L-Ext-IO-Area                 Pic  X(560).                   02690000
       Copy R7919999.                                                   02700000
      *                                                                 02710000
      *################################################################.02720000
       Procedure Division                Using L-Ext-IO-Area            02730000
                                               R7919999-Error-Area.     02740000
      *                                                                 02750000
       A000-Main                         Section.                       02760000
      *                                                                 02770000
           Perform B000-Initialize                                      02780000
      *                                                                 02790000
           Evaluate True                                                02800000
             When SW-IA-Initialize                                      02810000
               Continue                                                 02820000
      *                                                                 02830000
             When Other                                                 02840000
               Perform ZI00-Conv-Input-Version                          02850008
               Perform C000-Interface                                   02860000
               Perform ZO00-Conv-Output-Version                         02870008
      *                                                                 02880000
           End-Evaluate                                                 02890000
      *                                                                 02900000
           Goback.                                                      02910000
      *################################################################*02920000
       B000-Initialize                   Section.                       02930000
      *                                                                 02940000
           Set   R7919999-Return-OK      To    True                     02950000
      *                                                                 02960000
           Evaluate True                                                02970000
             When L-Ext-IO-Area (1:10)   =     'INITIALIZE'             02980000
               Set   Sw-IA-Initialize    To    True                     02990000
             When Other                                                 03000000
               Move  Space               To    W-Input-Action           03010000
           End-Evaluate                                                 03020000
      *                                                                 03030000
           Compute  W-Max-Occ-WS-Tab                                    03040000
               =    Length               Of    WS-DB2-Table             03050000
               /    Length               Of    WS-DB2-Row               03060000
      *                                                                 03070000
           If  Sw-IA-Initialize                                         03080000
           or  WS-DB2-Row-Status (1)     Not   Numeric                  03090009
               Initialize                      W-Storage                03100000
               Move  +0                  To    Ind-WS-Put               03110000
           End-If                                                       03120000
      *                                                                 03130000
           If  WC-Row-No                 Not   Numeric                  03140000
           or  WC-Total-No-Of-Rows       Not   Numeric                  03150000
               Initialize                      WC-Counters              03160000
           End-If                                                       03170000
      *                                                                 03180000
           Evaluate True                                                03190000
             When Not R115X000-Is-Initiated                             03200000
               Initialize                      R115X000-External-Data   03210000
             When Not R115X000-Version                                  03220000
               Initialize                      R7918030-ErrorMessage    03230000
               Move  'GL-VERSION-INVALID'                               03240000
                                         To    R7918030-In-MessageCode  03250000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03260000
               Move  R115X000-Version-No To R7918030-In-Variable-Data(1)03270000
               Move  'VAR2'              To R7918030-In-Variable-Key (2)03280000
               Move  'R115X000'          To R7918030-In-Variable-Data(2)03290000
               Perform Z000-Error-Message                               03300000
               Move  'B001'              To    R7919999-Paragraph       03310000
               Perform Z900-Abend                                       03320000
           End-Evaluate                                                 03330000
      *                                                                 03340000
           .                                                            03350000
      *################################################################.03360000
       C000-Interface                    Section.                       03370000
      *                                                                 03380000
           Perform C100-Verify                                          03390036
      *                                                                 03400036
           Evaluate True                                                03410000
             When R115IRP0-In-Get-1st                                   03420000
               Perform C200-Initialize-Output                           03430036
               Perform D000-Get-1st                                     03440000
               Perform E000-Get-Next                                    03450000
      *                                                                 03460000
             When R115IRP0-In-Get-Next                                  03470000
               Perform C200-Initialize-Output                           03480036
               Perform E000-Get-Next                                    03490000
      *                                                                 03500000
             When R115IRP0-In-Select                                    03510000
               Perform C200-Initialize-Output                           03520036
               Perform F000-Select                                      03530000
      *                                                                 03540000
             When R115IRP0-In-Insert                                    03550000
               Perform G000-Insert                                      03560000
      *                                                                 03570000
             When R115IRP0-In-Update                                    03580000
               Perform H000-Update                                      03590000
      *                                                                 03600000
             When R115IRP0-In-Delete                                    03610000
               Perform I000-Delete                                      03620000
      *                                                                 03630000
             When Other                                                 03640000
               Initialize                      R7918030-ErrorMessage    03650000
               Move  'GL-IN-AKSJON-UV'   To    R7918030-In-MessageCode  03660000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03670000
               Move  R115IRP0-In-Action  To R7918030-In-Variable-Data(1)03680000
               Perform Z000-Error-Message                               03690000
               Move  'C001'              To    R7919999-Paragraph       03700000
               Perform Z900-Abend                                       03710000
      *                                                                 03720000
           End-Evaluate                                                 03730000
      *                                                                 03740000
           .                                                            03750000
      *################################################################.03760036
       C100-Verify                       Section.                       03770036
      *                                                                 03780036
           Evaluate True                                                03790038
             When R115IRP0-In-Actual                                    03800038
               Set   SW-Table-Actual     To    True                     03810038
      *                                                                 03820038
             When R115IRP0-In-Work                                      03830038
               Set   SW-Table-Work       To    True                     03840038
      *                                                                 03850038
             When other                                                 03860038
               Initialize                      R7918030-ErrorMessage    03870036
               Move  'GL-IN-TABLE-VERSION-UV'                           03880036
                                         To    R7918030-In-MessageCode  03890036
               Move  'VAR1'              To R7918030-In-Variable-Key (1)03900036
               Move  R115IRP0-In-Table-Version                          03910037
                                         To R7918030-In-Variable-Data(1)03920036
               Perform Z000-Error-Message                               03930036
               Move  'C101'              To    R7919999-Paragraph       03940036
               Perform Z900-Abend                                       03950036
      *                                                                 03960036
           End-Evaluate                                                 03970038
      *                                                                 03980036
      *    If caller has qualified on Part Amount, and relation is not  03990042
      *    set, we set In-Rel-PA to true.                               04000042
           Evaluate True                                                04010042
             When R115IRP0-In-CA-Currency                               04020042
                                         =     Space                    04030042
             and  R115IRP0-In-PA-Seq-No  =     +0                       04040042
               Continue                                                 04050042
                                                                        04060042
             When R115IRP0-In-Relation   =     Space                    04070042
               Set   R115IRP0-In-Rel-PA  To    True                     04080042
                                                                        04090042
                                                                        04100042
           End-Evaluate                                                 04110042
      *                                                                 04120042
           .                                                            04130036
      *################################################################.04140000
       C200-Initialize-Output            Section.                       04150036
      *                                                                 04160000
           Initialize                          R115IRP0-Data            04170000
      *                                                                 04180000
           .                                                            04190000
      *################################################################.04200000
       D000-Get-1st                      Section.                       04210000
      *                                                                 04220000
           Perform D100-Prepare-Input                                   04230000
           Perform D200-Prepare-Qualification                           04240000
           Perform D300-Select-Cursor                                   04250000
           If  R115IRP0-In-CC-Count                                     04260000
               Perform D400-Count-Cursor                                04270000
           End-If                                                       04280000
           Perform D500-Open-Cursor                                     04290000
      *                                                                 04300000
           .                                                            04310000
      *################################################################.04320000
       D100-Prepare-Input                Section.                       04330000
      *                                                                 04340000
      * We create internal from- and to-values, depending on the input. 04350000
      *                                                                 04360000
           Initialize                          WE-Cursor-Info           04370000
      *                                                                 04380000
           Move  R115IRP0-In-Fin-Inst-ID To    WE-Fin-Inst-ID           04390000
           Move  R115IRP0-In-Fin-Inst-No To    WE-Fin-Inst-No           04400000
      *                                                                 04410000
           Move  R115IRP0-In-Contract-Type                              04420000
                                         To    WE-Contract-Type         04430000
      *    Move  +0                      To    W-Tally                  04440049
      *    Inspect WE-Contract-Type     Tallying W-Tally for all '*' '%'04450049
      *    If  W-Tally                   >     +0                       04460049
      *        Inspect WE-Contract-Type  Converting '* ' to '%%'        04470049
      *    End-If                                                       04480049
      *                                                                 04490000
           Move  R115IRP0-In-Contract-No To    WE-Contract-No           04500050
      *                                                                 04510000
      *    If we want related party independant of relation, we can't   04520019
      *    use these fields in the qualification.                       04530019
           Evaluate True                                                04540019
             When R115IRP0-In-Rel-MC                                    04550019
               Move  Space               To    WE-CA-Currency           04560019
               Move  +0000               To    WE-From-PA-Seq-No        04570019
               Move  +0000               To    WE-To-PA-Seq-No          04580019
                                                                        04590019
             When R115IRP0-In-Rel-Any                                   04600019
               Move  Space               To    WE-CA-Currency           04610019
               Inspect WE-CA-Currency                                   04620019
                   Converting '* '                                      04630019
                   To         '%%'                                      04640019
               Move  +0000               To    WE-From-PA-Seq-No        04650019
               Move  +9999               To    WE-To-PA-Seq-No          04660019
                                                                        04670019
             When R115IRP0-In-PA-Seq-No  =     +0                       04680019
               Move  R115IRP0-In-CA-Currency                            04690019
                                         To    WE-CA-Currency           04700019
               Move  +0                  To    W-Tally                  04710030
               Inspect WE-CA-Currency   Tallying W-Tally for all '*' '%'04720030
               If  W-Tally               >     +0                       04730030
                   Inspect WE-CA-Currency                               04740030
                                         Converting '* ' to '%%'        04750030
               End-If                                                   04760030
               Move  +0001               To    WE-From-PA-Seq-No        04770019
               Move  +9999               To    WE-To-PA-Seq-No          04780019
                                                                        04790019
             When other                                                 04800019
               Move  R115IRP0-In-CA-Currency                            04810019
                                         To    WE-CA-Currency           04820019
               Move  +0                  To    W-Tally                  04830030
               Inspect WE-CA-Currency   Tallying W-Tally for all '*' '%'04840030
               If  W-Tally               >     +0                       04850030
                   Inspect WE-CA-Currency                               04860030
                                         Converting '* ' to '%%'        04870030
               End-If                                                   04880030
               Move  R115IRP0-In-PA-Seq-No                              04890019
                                         To    WE-From-PA-Seq-No        04900019
               Move  R115IRP0-In-PA-Seq-No                              04910019
                                         To    WE-To-PA-Seq-No          04920019
                                                                        04930019
           End-Evaluate                                                 04940019
      *                                                                 04950019
           Move  R115IRP0-In-Role-Type   To    WE-Role-Type             04960000
           Move  +0                      To    W-Tally                  04970031
           Inspect WE-Role-Type         Tallying W-Tally for all '*' '%'04980031
           If  W-Tally                   >     +0                       04990031
               Inspect WE-Role-Type      Converting '* ' to '%%'        05000031
           End-If                                                       05010031
      *                                                                 05020000
           Move  R115IRP0-In-Customer-ID To    WE-Customer-ID           05030045
           Move  R115IRP0-In-Customer-No To    WE-Customer-No           05040045
      *                                                                 05050043
           .                                                            05060000
      *################################################################.05070000
       D200-Prepare-Qualification        Section.                       05080000
      *                                                                 05090000
      * We store the qualification, so that we can check that the       05100000
      * qualification do not change on any following Get-Next.          05110000
      *                                                                 05120000
           Initialize                          WS-Cursor-Info           05130000
           Move  WE-Key                  To    WS-Key                   05140000
           Move  WE-Code-Sequence        To    WS-Code-Sequence         05150000
      *                                                                 05160000
           Initialize WC-Counters                                       05170000
      *                                                                 05180000
      * We fill in the SQL host variables.                              05190000
      *                                                                 05200000
           Initialize                          W-DB-Key                 05210000
      *                                                                 05220000
           Move  WE-Fin-Inst-ID          To    W-DB-Fin-Inst-ID         05230000
           Move  WE-Contract-Type        To    W-DB-Contract-Type       05240000
      *                                                                 05250000
           Move  WE-Contract-No          To    W-DB-Contract-No         05260050
      *                                                                 05270000
           Move  WE-CA-Currency          To    W-DB-CA-Currency         05280019
           Move  WE-From-PA-Seq-No       To    W-DB-From-PA-Seq-No      05290019
           Move  WE-To-PA-Seq-No         To    W-DB-To-PA-Seq-No        05300019
      *                                                                 05310019
           Move  WE-Role-Type            To    W-DB-Role-Type           05320019
           Move  WE-Customer-ID          To    W-DB-Customer-ID         05330043
      *                                                                 05340000
           If  WE-Fin-Inst-No            Not = Space                    05350000
           and W-DB-Fin-Inst-ID          =     +0                       05360000
               Move  WE-Fin-Inst-No      To    W-Fin-Inst-No            05370000
               Perform N100-Fetch-Fin-Inst-ID                           05380000
               Move  W-Fin-Inst-ID       To    W-DB-Fin-Inst-ID         05390000
           End-If                                                       05400000
      *                                                                 05410000
           If  WE-Customer-No            Not = +0                       05420045
           and W-DB-Customer-ID          =     +0                       05430045
               Move  WE-Customer-No      To    W-Customer-No            05440045
               Perform N300-Fetch-Customer-ID                           05450045
               Move  W-Customer-ID       To    W-DB-Customer-ID         05460045
           End-If                                                       05470045
      *                                                                 05480045
           .                                                            05490000
      *################################################################.05500000
       D300-Select-Cursor                Section.                       05510000
      *                                                                 05520000
      * We choose which cursor to use, depending on the qualification.  05530000
      *                                                                 05540000
           Move  Space                   To    SW-Cursor-Code           05550000
      *                                                                 05560000
           If  W-DB-Fin-Inst-ID          Not = +0                       05570000
               Set  Sw-Use-Fin-Inst      To    True                     05580000
           End-If                                                       05590000
      *                                                                 05600000
           If  W-DB-Contract-Type        Not = Space                    05610028
      *    and W-DB-Contract-Type (1:1)  Not = '%'                      05620049
               Set   SW-Use-Contract-Type                               05630000
                                         To    True                     05640000
           End-If                                                       05650027
      *                                                                 05660000
           If  W-DB-Contract-No          Not = +0                       05670050
               Set   SW-Use-Contract-No  To    True                     05680000
           End-If                                                       05690050
      *                                                                 05700000
           If  Not R115IRP0-In-Rel-Any                                  05711056
               Set  Sw-Use-Part-Amount   To    True                     05720019
           End-If                                                       05730019
      *                                                                 05740019
           If  W-DB-Role-Type            Not = Space                    05750028
           and W-DB-Role-Type (1:1)      Not = '%'                      05760028
               Set  Sw-Use-Role          To    True                     05770000
           End-If                                                       05780000
      *                                                                 05790000
           If  W-DB-Customer-ID          Not = +0                       05800043
               Set  Sw-Use-Customer-ID   To    True                     05810043
           End-If                                                       05820043
      *                                                                 05830043
           Evaluate True                                                05840000
             When SW-Use-Fi-Asc                                         05850000
             or   SW-Use-Fi-CT-Asc                                      05860000
             or   SW-Use-Fi-CT-Cu-Asc                                   05860159
             or   SW-Use-Fi-CU-Asc                                      05861053
             or   SW-Use-Fi-Ro-Asc                                      05870002
             or   SW-Use-Fi-CTN-Asc                                     05880046
             or   SW-Use-Fi-CTN-PA-Asc                                  05890046
             or   SW-Use-Fi-CT-Ro-Asc                                   05900002
             or   SW-Use-Fi-CT-Ro-Cu-Asc                                05910043
             or   SW-Use-Fi-CTN-Ro-Asc                                  05920046
             or   SW-Use-Fi-CTN-Ro-Cu-Asc                               05930046
             or   SW-Use-Fi-CTN-PA-Ro-Asc                               05940046
               Continue                                                 05950000
      *                                                                 05960000
             When other                                                 05970000
               Initialize                      R7918030-ErrorMessage    05980000
               Move  'GL-CURSOR-UV'      To    R7918030-In-MessageCode  05990000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)06000000
               Move  SW-Cursor-Code      To R7918030-In-Variable-Data(1)06010000
               Perform Z000-Error-Message                               06020000
               Move  'D302'              To    R7919999-Paragraph       06030000
               Perform Z900-Abend                                       06040000
      *                                                                 06050000
           End-Evaluate                                                 06060000
      *                                                                 06070000
           .                                                            06080000
      *################################################################.06090000
       D400-Count-Cursor                 Section.                       06100000
      *                                                                 06110000
           Initialize                          R115IRPS-SQL-Submodules  06120000
           Set   R115IRPS-Version        To    True                     06130000
           Set   R115IRPS-In-Count-Cursor                               06140000
                                         To    True                     06150000
           Move  R115IRP0-In-Table-Version                              06160036
                                         To    R115IRPS-In-Table-Version06170036
           Move  Sw-Cursor-Code          To    R115IRPS-Cursor-Code     06180000
           Move  W-DB-Key                To    R115IRPS-DB-Key          06190000
      *                                                                 06200000
           Call  'F115IRPR'              Using R115IRPS-SQL-Submodules  06210000
                                               DCLTF-Related-Party      06220000
                                               R7919999-Error-Area      06230000
           End-Call                                                     06240000
      *                                                                 06250000
           Evaluate True                                                06260000
             When R7919999-Return-OK                                    06270000
               Move  R115IRPS-Out-Total-Rows                            06280000
                                         To    WC-Total-No-Of-Rows      06290000
      *                                                                 06300000
             When other                                                 06310000
               Move  'D401'              To    R7919999-Paragraph       06320000
               Perform Z900-Abend                                       06330000
      *                                                                 06340000
           End-Evaluate                                                 06350000
      *                                                                 06360000
           .                                                            06370000
      *################################################################.06380000
       D500-Open-Cursor                  Section.                       06390000
      *                                                                 06400000
           Initialize                          R115IRPS-SQL-Submodules  06410000
           Set   R115IRPS-Version        To    True                     06420000
           Set   R115IRPS-In-Open-Cursor To    True                     06430000
           Move  R115IRP0-In-Table-Version                              06440036
                                         To    R115IRPS-In-Table-Version06450036
           Move  Sw-Cursor-Code          To    R115IRPS-Cursor-Code     06460000
           Move  W-DB-Key                To    R115IRPS-DB-Key          06470000
      *                                                                 06480000
           Call  'F115IRPR'              Using R115IRPS-SQL-Submodules  06490000
                                               DCLTF-Related-Party      06500000
                                               R7919999-Error-Area      06510000
           End-Call                                                     06520000
      *                                                                 06530000
           Evaluate True                                                06540000
             When R7919999-Return-OK                                    06550000
               Set   WS-Cursor-OK        To    True                     06560000
      *                                                                 06570000
             When other                                                 06580000
               Move  'D501'              To    R7919999-Paragraph       06590000
               Perform Z900-Abend                                       06600000
      *                                                                 06610000
           End-Evaluate                                                 06620000
      *                                                                 06630000
           .                                                            06640000
      *################################################################.06650000
       E000-Get-Next                     Section.                       06660000
      *                                                                 06670000
           Perform D100-Prepare-Input                                   06680000
           Perform E100-Check-Qualification                             06690000
           Perform E200-Fetch-Cursor                                    06700000
      *                                                                 06710000
           If  R7919999-Return-OK                                       06720000
               Perform L100-Store-DCL                                   06730000
               Perform J000-Get-Columns                                 06740000
           End-If                                                       06750000
      *                                                                 06760000
           .                                                            06770000
      *################################################################.06780000
       E100-Check-Qualification          Section.                       06790000
      *                                                                 06800000
      * We use the WE-fields for comparison with the WS-fields.         06810000
      * This to verify that the qualification has not changes since     06820000
      * the Get-1st.                                                    06830000
      *                                                                 06840000
           Evaluate True                                                06850000
             When WE-Key                 =     WS-Key                   06860000
             and  WE-Code-Sequence       =     WS-Code-Sequence         06870000
             and  WS-Cursor-OK                                          06880000
               Continue                                                 06890000
      *                                                                 06900000
             When WE-Key                 =     WS-Key                   06910000
             and  WE-Code-Sequence       =     WS-Code-Sequence         06920000
             and  WS-Cursor-End                                         06930000
               Initialize                      R7918030-ErrorMessage    06940000
               Move  'DB-LEST-SISTE'     To    R7918030-In-MessageCode  06950000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)06960000
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)06970000
               Perform Z000-Error-Message                               06980000
               Move  'E101'              To    R7919999-Paragraph       06990000
               Perform Z900-Abend                                       07000000
      *                                                                 07010000
             When Other                                                 07020000
               Initialize                      R7918030-ErrorMessage    07030000
               Move  'GL-BRUK-GET-1ST'   To    R7918030-In-MessageCode  07040000
               Perform Z000-Error-Message                               07050000
               Move  'E102'              To    R7919999-Paragraph       07060000
               Perform Z900-Abend                                       07070000
      *                                                                 07080000
           End-Evaluate                                                 07090000
      *                                                                 07100000
           .                                                            07110000
      *################################################################.07120000
       E200-Fetch-Cursor                 Section.                       07130000
      *                                                                 07140000
           Initialize                          R115IRPS-SQL-Submodules  07150000
           Set   R115IRPS-Version        To    True                     07160000
           Set   R115IRPS-In-Fetch-Cursor                               07170000
                                         To    True                     07180000
           Move  R115IRP0-In-Table-Version                              07190036
                                         To    R115IRPS-In-Table-Version07200036
           Move  Sw-Cursor-Code          To    R115IRPS-Cursor-Code     07210000
           Move  W-DB-Key                To    R115IRPS-DB-Key          07220000
      *                                                                 07230000
           Call  'F115IRPR'              Using R115IRPS-SQL-Submodules  07240000
                                               DCLTF-Related-Party      07250000
                                               R7919999-Error-Area      07260000
           End-Call                                                     07270000
      *                                                                 07280000
           Evaluate True                                                07290000
             When R7919999-Return-OK                                    07300000
               Add   +1                  To    WC-Row-No                07310000
      *                                                                 07320000
             When R7919999-Return-Error                                 07330000
               Set   WS-Cursor-End       To    True                     07340000
               If  WC-Row-No             =     +0                       07350000
                 Then                                                   07360000
                   Initialize                  R7918030-ErrorMessage    07370000
                   Move  'DB-FOREKOMST-NF'                              07380000
                                         To    R7918030-In-MessageCode  07390000
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)07400000
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)07410000
                   Perform Z000-Error-Message                           07420000
                 Else                                                   07430000
                   Initialize                  R7918030-ErrorMessage    07440000
                   Move  'DB-LEST-SISTE' To    R7918030-In-MessageCode  07450000
                   Move  'VAR1'          To R7918030-In-Variable-Key (1)07460000
                   Move  W-Table-Name    To R7918030-In-Variable-Data(1)07470000
                   Perform Z000-Error-Message                           07480000
               End-If                                                   07490000
      *                                                                 07500000
             When other                                                 07510000
               Move  'E201'              To    R7919999-Paragraph       07520000
               Perform Z900-Abend                                       07530000
      *                                                                 07540000
           End-Evaluate                                                 07550000
      *                                                                 07560000
           .                                                            07570000
      *################################################################.07580000
       F000-Select                       Section.                       07590000
      *                                                                 07600000
           Perform F100-Prepare-Qualification                           07610000
      *                                                                 07620000
      * We will first look through the storage, to see if we have       07630000
      * already got the wanted occurence.                               07640000
      *                                                                 07650000
           Perform L200-Find-DCL                                        07660000
      *                                                                 07670000
      * If we didn't find anything, we need to read. Then we store.     07680000
      *                                                                 07690000
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         07700000
           or  WS-DB2-Not-Read (Ind-WS)                                 07710000
               Perform F200-Select-Row                                  07720000
               Perform L100-Store-DCL                                   07730000
           End-If                                                       07740000
      *                                                                 07750000
      * At last we check what we've got to offer.                       07760000
      *                                                                 07770000
           Evaluate True                                                07780000
             When WS-DB2-Read (Ind-WS)                                  07790000
               Move  WS-DB2-DCL (Ind-WS) To    DCLTF-Related-Party      07800000
               Perform J000-Get-Columns                                 07810000
      *                                                                 07820000
             When other                                                 07830000
               Initialize                      R7918030-ErrorMessage    07840000
               Move  'DB-FOREKOMST-NF-Q' To    R7918030-In-MessageCode  07850000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)07860000
               Move  W-Table-Name        To R7918030-In-Variable-Data(1)07870000
               Move  'VAR2'              To R7918030-In-Variable-Key (2)07880000
               Move  FK-OAKO-FinInst-ID  To WD-Fin-Inst-ID              07890000
               Move  FK-TFMC-Contr-No    To WD-Contract-No              07900000
               Move  FK-TFPA-Seq-No      To WD-PA-Seq-No                07910019
               String WD-Fin-Inst-ID           Delimited by size        07920000
                      '/'                      Delimited by size        07930000
                      FK-TFMC-Contr-Type       Delimited by space       07940000
                      WD-Contract-No           Delimited by size        07950000
                      '/'                      Delimited by size        07960000
                      FK-TFCA-Currency         Delimited by space       07970019
                      WD-PA-Seq-No             Delimited by size        07980019
                      '/'                      Delimited by size        07990019
                      FK-KFTY-Role-Type        Delimited by space       08000019
                                       Into R7918030-In-Variable-Data(2)08010000
               End-String                                               08020000
               Perform Z000-Error-Message                               08030000
               Set   R7919999-Return-Error                              08040000
                                         To    True                     08050000
      *                                                                 08060000
           End-Evaluate                                                 08070000
      *                                                                 08080000
           .                                                            08090000
      *################################################################.08100000
       F100-Prepare-Qualification        Section.                       08110000
      *                                                                 08120000
      * We fill in the host variables for the SQL.                      08130000
      *                                                                 08140000
           Initialize                          DCLTF-Related-Party      08150000
      *                                                                 08160000
           Move  R115IRP0-In-Fin-Inst-ID To    FK-OAKO-FinInst-ID       08170000
           Move  R115IRP0-In-Contract-Type                              08180000
                                         To    FK-TFMC-Contr-Type       08190000
           Move  R115IRP0-In-Contract-No To    FK-TFMC-Contr-No         08200000
      *                                                                 08210019
           Evaluate True                                                08220019
             When R115IRP0-In-Rel-MC                                    08230019
               Move  Space               To    FK-TFCA-Currency         08240019
               Move  +0                  To    FK-TFPA-Seq-No           08250019
             When other                                                 08260019
               Move  R115IRP0-In-CA-Currency                            08270019
                                         To    FK-TFCA-Currency         08280019
               Move  R115IRP0-In-PA-Seq-No                              08290019
                                         To    FK-TFPA-Seq-No           08300019
           End-Evaluate                                                 08310019
      *                                                                 08320019
           Move  R115IRP0-In-Role-Type   To    FK-KFTY-Role-Type        08330019
      *                                                                 08340000
           If  R115IRP0-In-Fin-Inst-No   Not = Space                    08350000
           and R115IRP0-In-Fin-Inst-ID   =     +0                       08360000
               Move  R115IRP0-In-Fin-Inst-No                            08370000
                                         To    W-Fin-Inst-No            08380000
               Perform N100-Fetch-Fin-Inst-ID                           08390000
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       08400000
           End-If                                                       08410000
      *                                                                 08420000
           .                                                            08430000
      *################################################################.08440000
       F200-Select-Row                   Section.                       08450000
      *                                                                 08460000
           Initialize                          R115IRPS-SQL-Submodules  08470000
           Set   R115IRPS-Version        To    True                     08480000
           Set   R115IRPS-In-Select      To    True                     08490000
           Move  R115IRP0-In-Table-Version                              08500036
                                         To    R115IRPS-In-Table-Version08510036
      *                                                                 08520000
           Call  'F115IRPR'              Using R115IRPS-SQL-Submodules  08530000
                                               DCLTF-Related-Party      08540000
                                               R7919999-Error-Area      08550000
           End-Call                                                     08560000
      *                                                                 08570000
           Evaluate True                                                08580000
             When R7919999-Return-OK                                    08590000
               Continue                                                 08600000
      *                                                                 08610000
             When R7919999-Return-Error                                 08620000
               Continue                                                 08630000
      *                                                                 08640000
             When other                                                 08650000
               Move  'F201'              To    R7919999-Paragraph       08660000
               Perform Z900-Abend                                       08670000
      *                                                                 08680000
           End-Evaluate                                                 08690000
      *                                                                 08700000
           .                                                            08710000
      *################################################################.08720000
       G000-Insert                       Section.                       08730000
      *                                                                 08740000
           Perform G100-Move-Input-To-DCL                               08750000
           Perform G200-Insert-Row                                      08760000
      *                                                                 08770000
           Perform L300-Remove-DCL                                      08780000
           Perform L100-Store-DCL                                       08790000
      *                                                                 08800000
           .                                                            08810000
      *################################################################.08820000
       G100-Move-Input-To-DCL            Section.                       08830000
      *                                                                 08840000
      * PLEASE REMEMBER:                                                08850032
      *    When you modify the code in this section, you need to do     08860032
      *    the same modifications in module F115ARP0 - E200-section.    08870032
      *                                                                 08880032
           Initialize                          DCLTF-Related-Party      08890000
      *                                                                 08900000
           Move R115IRP0-Fin-Inst-ID     To    FK-OAKO-FinInst-ID       08910000
           If  R115IRP0-Fin-Inst-No      Not = Space                    08920000
           and R115IRP0-Fin-Inst-ID      =     +0                       08930000
               Move  R115IRP0-Fin-Inst-No                               08940002
                                         To    W-Fin-Inst-No            08950000
               Perform N100-Fetch-Fin-Inst-ID                           08960000
               Move  W-Fin-Inst-ID       To    FK-OAKO-FinInst-ID       08970000
           End-If                                                       08980000
      *                                                                 08990000
           Move R115IRP0-Contract-Type   To    FK-TFMC-Contr-Type       09000000
           Move R115IRP0-Contract-No     To    FK-TFMC-Contr-No         09010000
      *                                                                 09020000
           Move R115IRP0-CA-Currency     To    FK-TFCA-Currency         09030019
           Move R115IRP0-PA-Seq-No       To    FK-TFPA-Seq-No           09040019
      *                                                                 09050019
           Move R115IRP0-Role-Type       To    FK-KFTY-Role-Type        09060019
      *                                                                 09070012
           Move R115IRP0-Customer-ID     To    FK-KLID-Cust-ID          09080002
           If  R115IRP0-Customer-No      Not = +0                       09090002
           and R115IRP0-Customer-ID      =     +0                       09100002
               Move  FK-OAKO-FinInst-ID  To    W-Fin-Inst-ID            09110002
               Move  R115IRP0-Customer-No                               09120002
                                         To    W-Customer-No            09130002
               Perform N300-Fetch-Customer-ID                           09140002
               Move  W-Customer-ID       To    FK-KLID-Cust-ID          09150002
           End-If                                                       09160002
      *                                                                 09170002
           Move R115IRP0-KFRO-Seq-No     To    FK-KFRO-SEQ-NO           09180034
      *                                                                 09190034
           Move R115IRP0-Account         To    TFRP-Account             09200034
           Move R115IRP0-Account-2       To    TFRP-Account2            09210024
           Move R115IRP0-Reference       To    TFRP-Reference           09220002
      *                                                                 09230000
           .                                                            09240000
      *################################################################.09250000
       G200-Insert-Row                   Section.                       09260000
      *                                                                 09270000
           Initialize                          R115IRPS-SQL-Submodules  09280000
           Set   R115IRPS-Version        To    True                     09290000
           Set   R115IRPS-In-Insert      To    True                     09300000
           Move  R115IRP0-In-Table-Version                              09310036
                                         To    R115IRPS-In-Table-Version09320036
      *                                                                 09330000
           Call  'F115IRPU'              Using R115IRPS-SQL-Submodules  09340000
                                               DCLTF-Related-Party      09350000
                                               R7919999-Error-Area      09360000
           End-Call                                                     09370000
      *                                                                 09380000
           Evaluate True                                                09390000
             When R7919999-Return-OK                                    09400000
               Continue                                                 09410000
      *                                                                 09420000
             When R7919999-Return-Error                                 09430000
               Continue                                                 09440000
      *                                                                 09450000
             When other                                                 09460000
               Move  'G201'              To    R7919999-Paragraph       09470000
               Perform Z900-Abend                                       09480000
      *                                                                 09490000
           End-Evaluate                                                 09500000
      *                                                                 09510000
           .                                                            09520000
      *################################################################.09530000
       H000-Update                       Section.                       09540000
      *                                                                 09550000
           Perform H100-Check-Qualification                             09560000
           Perform G100-Move-Input-To-DCL                               09570000
      *                                                                 09580000
           Perform H200-Update-Row                                      09590000
      *                                                                 09600000
           Perform L300-Remove-DCL                                      09610000
           Perform L100-Store-DCL                                       09620000
      *                                                                 09630000
           .                                                            09640000
      *################################################################.09650000
       H100-Check-Qualification          Section.                       09660000
      *                                                                 09670000
           Evaluate True                                                09680000
             When R115IRP0-Fin-Inst-ID   Not = +0                       09690000
               Continue                                                 09700000
                                                                        09710000
             When R115IRP0-Fin-Inst-No   Not = Space                    09720000
               Move  R115IRP0-Fin-Inst-No                               09730000
                                         To    W-Fin-Inst-No            09740000
               Perform N100-Fetch-Fin-Inst-ID                           09750000
               Move  W-Fin-Inst-ID       To    R115IRP0-Fin-Inst-ID     09760000
                                                                        09770000
             When R115IRP0-In-Fin-Inst-Id Not = +0                      09780000
               Move R115IRP0-In-Fin-Inst-ID                             09790000
                                         To    R115IRP0-Fin-Inst-ID     09800000
                                                                        09810000
             When R115IRP0-In-Fin-Inst-No                               09820000
                                         Not = Space                    09830000
               Move  R115IRP0-In-Fin-Inst-No                            09840000
                                         To    W-Fin-Inst-No            09850000
               Perform N100-Fetch-Fin-Inst-ID                           09860000
               Move  W-Fin-Inst-ID       To    R115IRP0-Fin-Inst-ID     09870000
                                                                        09880000
             When other                                                 09890000
               Initialize                      R7918030-ErrorMessage    09900000
               Move  'TF-FIN-INST-MISSING'                              09910000
                                         To    R7918030-In-MessageCode  09920000
               Perform Z000-Error-Message                               09930000
               Set   R7919999-Return-Error                              09940000
                                         To    True                     09950000
                                                                        09960000
           End-Evaluate                                                 09970000
      *                                                                 09980000
           Evaluate True                                                09990000
             When R115IRP0-Contract-Type Not = Space                    10000000
               Continue                                                 10010000
                                                                        10020000
             When R115IRP0-In-Contract-Type                             10030000
                                         Not = Space                    10040000
               Move R115IRP0-In-Contract-Type                           10050000
                                         To    R115IRP0-Contract-Type   10060000
                                                                        10070000
             When other                                                 10080000
               Initialize                      R7918030-ErrorMessage    10090000
               Move  'TF-CONTRACT-MISSING'                              10100000
                                         To    R7918030-In-MessageCode  10110000
               Perform Z000-Error-Message                               10120000
               Set   R7919999-Return-Error                              10130000
                                         To    True                     10140000
                                                                        10150000
           End-Evaluate                                                 10160000
      *                                                                 10170000
           Evaluate True                                                10180000
             When R115IRP0-Contract-No   Not = +0                       10190000
               Continue                                                 10200000
                                                                        10210000
             When R115IRP0-In-Contract-No                               10220000
                                         Not = +0                       10230000
               Move R115IRP0-In-Contract-No                             10240000
                                         To    R115IRP0-Contract-No     10250000
                                                                        10260000
             When other                                                 10270000
               Initialize                      R7918030-ErrorMessage    10280000
               Move  'TF-CONTRACT-MISSING'                              10290000
                                         To    R7918030-In-MessageCode  10300000
               Perform Z000-Error-Message                               10310000
               Set   R7919999-Return-Error                              10320000
                                         To    True                     10330000
                                                                        10340000
           End-Evaluate                                                 10350000
      *                                                                 10360000
           Evaluate True                                                10370019
             When R115IRP0-In-Rel-MC                                    10380019
               Continue                                                 10390019
                                                                        10400019
             When R115IRP0-CA-Currency   Not = Space                    10410019
               Continue                                                 10420019
                                                                        10430019
             When R115IRP0-In-CA-Currency                               10440019
                                         Not = Space                    10450019
               Move R115IRP0-In-CA-Currency                             10460019
                                         To    R115IRP0-CA-Currency     10470019
                                                                        10480019
             When other                                                 10490019
               Initialize                      R7918030-ErrorMessage    10500019
               Move  'TF-PART-AMOUNT-MISSING'                           10510019
                                         To    R7918030-In-MessageCode  10520019
               Perform Z000-Error-Message                               10530019
               Set   R7919999-Return-Error                              10540019
                                         To    True                     10550019
                                                                        10560019
           End-Evaluate                                                 10570019
      *                                                                 10580019
           Evaluate True                                                10590019
             When R115IRP0-In-Rel-MC                                    10600019
               Continue                                                 10610019
                                                                        10620019
             When R115IRP0-PA-Seq-No     Not = +0                       10630019
               Continue                                                 10640019
                                                                        10650019
             When R115IRP0-In-PA-Seq-No  Not = +0                       10660019
               Move R115IRP0-In-PA-Seq-No                               10670019
                                         To    R115IRP0-PA-Seq-No       10680019
                                                                        10690019
             When other                                                 10700019
               Initialize                      R7918030-ErrorMessage    10710019
               Move  'TF-PART-AMOUNT-MISSING'                           10720019
                                         To    R7918030-In-MessageCode  10730019
               Perform Z000-Error-Message                               10740019
               Set   R7919999-Return-Error                              10750019
                                         To    True                     10760019
                                                                        10770019
           End-Evaluate                                                 10780019
      *                                                                 10790019
           Evaluate True                                                10800002
             When R115IRP0-Role-Type     Not = Space                    10810002
               Continue                                                 10820019
                                                                        10830002
             When R115IRP0-In-Role-Type  Not = Space                    10840002
               Move  R115IRP0-In-Role-Type                              10850002
                                         To    R115IRP0-Role-Type       10860019
                                                                        10870002
             When other                                                 10880002
               Initialize                      R7918030-ErrorMessage    10890002
               Move  'TF-ROLE-MISSING'   To    R7918030-In-MessageCode  10900002
               Perform Z000-Error-Message                               10910002
               Set   R7919999-Return-Error                              10920002
                                         To    True                     10930002
                                                                        10940002
           End-Evaluate                                                 10950002
      *                                                                 10960002
           .                                                            10970000
      *################################################################.10980000
       H200-Update-Row                   Section.                       10990000
      *                                                                 11000000
           Initialize                          R115IRPS-SQL-Submodules  11010000
           Set   R115IRPS-Version        To    True                     11020000
           Set   R115IRPS-In-Update      To    True                     11030000
           Move  R115IRP0-In-Table-Version                              11040036
                                         To    R115IRPS-In-Table-Version11050036
      *                                                                 11060000
           Call  'F115IRPU'              Using R115IRPS-SQL-Submodules  11070000
                                               DCLTF-Related-Party      11080000
                                               R7919999-Error-Area      11090000
           End-Call                                                     11100000
      *                                                                 11110000
           Evaluate True                                                11120000
             When R7919999-Return-OK                                    11130000
               Continue                                                 11140000
      *                                                                 11150000
             When R7919999-Return-Error                                 11160000
               Continue                                                 11170000
      *                                                                 11180000
             When other                                                 11190000
               Move  'H201'              To    R7919999-Paragraph       11200000
               Perform Z900-Abend                                       11210000
      *                                                                 11220000
           End-Evaluate                                                 11230000
      *                                                                 11240000
           .                                                            11250000
      *################################################################.11260000
       I000-Delete                       Section.                       11270000
      *                                                                 11280000
           Perform F100-Prepare-Qualification                           11290000
           Perform I200-Delete-Row                                      11300000
      *                                                                 11310000
           Perform L300-Remove-DCL                                      11320000
      *                                                                 11330000
           .                                                            11340000
      *################################################################.11350000
       I200-Delete-Row                   Section.                       11360000
      *                                                                 11370000
           Initialize                          R115IRPS-SQL-Submodules  11380000
           Set   R115IRPS-Version        To    True                     11390000
           Set   R115IRPS-In-Delete      To    True                     11400000
           Move  R115IRP0-In-Table-Version                              11410036
                                         To    R115IRPS-In-Table-Version11420036
      *                                                                 11430000
           Call  'F115IRPU'              Using R115IRPS-SQL-Submodules  11440000
                                               DCLTF-Related-Party      11450000
                                               R7919999-Error-Area      11460000
           End-Call                                                     11470000
      *                                                                 11480000
           Evaluate True                                                11490000
             When R7919999-Return-OK                                    11500000
               Continue                                                 11510000
      *                                                                 11520000
             When R7919999-Return-Error                                 11530000
               Continue                                                 11540000
      *                                                                 11550000
             When other                                                 11560000
               Move  'I201'              To    R7919999-Paragraph       11570000
               Perform Z900-Abend                                       11580000
      *                                                                 11590000
           End-Evaluate                                                 11600000
      *                                                                 11610000
           .                                                            11620000
      *################################################################.11630000
       J000-Get-Columns                  Section.                       11640000
      *                                                                 11650000
           Perform J100-Move-DCL-To-Output                              11660000
      *                                                                 11670000
           .                                                            11680000
      *################################################################.11690000
       J100-Move-DCL-To-Output           Section.                       11700000
      *                                                                 11710000
      * PLEASE REMEMBER:                                                11720032
      *    When you modify the code in this section, you need to do     11730032
      *    the same modifications in module F115ARP0 - E500-section.    11740032
      *                                                                 11750032
           Move  FK-OAKO-FinInst-ID      To    R115IRP0-Fin-Inst-ID     11760000
           Move  FK-TFMC-Contr-Type      To    R115IRP0-Contract-Type   11770000
           Move  FK-TFMC-Contr-No        To    R115IRP0-Contract-No     11780000
           Move  FK-TFCA-Currency        To    R115IRP0-CA-Currency     11790019
           Move  FK-TFPA-Seq-No          To    R115IRP0-PA-Seq-No       11800019
           Move  FK-KFTY-Role-Type       To    R115IRP0-Role-Type       11810019
      *                                                                 11820002
           Move  FK-KLID-Cust-ID         To    R115IRP0-Customer-ID     11830002
           If  FK-KLID-Cust-ID           >     +0                       11840014
               Move  FK-KLID-Cust-ID     To    W-Customer-ID            11850014
               Perform N400-Fetch-Customer-No                           11860014
               Move  W-Customer-No       To    R115IRP0-Customer-No     11870014
           End-If                                                       11880014
      *                                                                 11890014
           Move  FK-KFRO-SEQ-NO          To    R115IRP0-KFRO-Seq-No     11900034
      *                                                                 11910034
           Move  TFRP-Account            To    R115IRP0-Account         11920034
           Move  TFRP-Account2           To    R115IRP0-Account-2       11930034
      *                                                                 11940034
           Move  TFRP-Reference          To    R115IRP0-Reference       11950002
      *                                                                 11951051
           Move  FK-OAKO-FinInst-ID      To    W-Fin-Inst-ID            11970000
           Perform N200-Fetch-Fin-Inst-No                               11980000
           Move  W-Fin-Inst-No           To    R115IRP0-Fin-Inst-No     11990000
      *                                                                 12000000
      * Info about the cursor:                                          12010000
      *                                                                 12020000
           Move  WC-Row-No               To  R115IRP0-Out-Row-No        12030000
           Move  WC-Total-No-Of-Rows     To  R115IRP0-Out-Total-Rows    12040000
      *                                                                 12050000
           .                                                            12060000
      *################################################################.12070000
       L100-Store-DCL                    Section.                       12080000
      *                                                                 12090000
      * We might already have this row in storage.                      12100013
      *                                                                 12110013
           Perform L200-Find-DCL                                        12120013
      *                                                                 12130013
           If  Ind-WS                    >     W-Max-Occ-WS-Tab         12140013
           or  WS-DB2-Not-Read (Ind-WS)                                 12150013
             Then                                                       12160013
      *        If we have reached the end of the storage-table,         12170013
      *        we start on the beginning.                               12180013
      *        This way, we always keep the "newest" occurrences.       12190013
               Add   +1                  To    Ind-WS-Put               12200013
               If  Ind-WS-Put            >     W-Max-Occ-WS-Tab         12210013
                   Move  +1              To    Ind-WS-Put               12220013
               End-If                                                   12230013
               Move  Ind-WS-Put          To    Ind-WS                   12240013
             Else                                                       12250013
               Move  Ind-WS              To    Ind-WS-Put               12260013
           End-If                                                       12270013
      *                                                                 12280013
      * We store the identification.                                    12290000
      *                                                                 12300000
           Move  R115IRP0-In-Table-Version                              12310036
                                         To    WS-DB2-Tbl-Version       12320036
                                                            (Ind-WS-Put)12330036
           Move  FK-OAKO-FinInst-ID      To    WS-DB2-Fin-Inst-ID       12340000
                                                            (Ind-WS-Put)12350000
           Move  FK-TFMC-Contr-Type      To    WS-DB2-Contract-Type     12360000
                                                            (Ind-WS-Put)12370000
           Move  FK-TFMC-Contr-No        To    WS-DB2-Contract-No       12380000
                                                            (Ind-WS-Put)12390000
           Move  FK-TFCA-Currency        To    WS-DB2-CA-Currency       12400019
                                                            (Ind-WS-Put)12410019
           Move  FK-TFPA-Seq-No          To    WS-DB2-PA-Seq-No         12420019
                                                            (Ind-WS-Put)12430019
           Move  FK-KFTY-Role-Type       To    WS-DB2-Role-Type         12440019
                                                            (Ind-WS-Put)12450000
      *                                                                 12460000
      * The DCL is stored if found, the status is set.                  12470000
      *                                                                 12480000
           Evaluate True                                                12490000
             When Length                 Of    DCLTF-Related-Party      12500000
                > Length                 Of    WS-DB2-DCL               12510000
               Move  Length              Of    DCLTF-Related-Party      12520000
                                         To    WD-Length                12530000
               Initialize                      R7918030-ErrorMessage    12540000
               Move  'GL-WL-DCL-UTVIDES' To    R7918030-In-MessageCode  12550000
               Move  'VAR1'              To R7918030-In-Variable-Key (1)12560000
               Move  WD-Length           To R7918030-In-Variable-Data(1)12570000
               Perform Z000-Error-Message                               12580000
               Move  'L101'              To    R7919999-Paragraph       12590000
               Perform Z900-Abend                                       12600000
      *                                                                 12610000
             When R7919999-Return-Error                                 12620000
               Set   WS-DB2-Not-Found (Ind-WS-Put)                      12630000
                                         To    True                     12640000
      *                                                                 12650000
             When other                                                 12660000
               Move  DCLTF-Related-Party                                12670000
                                         To    WS-DB2-DCL   (Ind-WS-Put)12680000
               Set   WS-DB2-Read (Ind-WS-Put)                           12690000
                                         To    True                     12700000
      *                                                                 12710000
           End-Evaluate                                                 12720000
      *                                                                 12730000
           .                                                            12740000
      *################################################################.12750000
       L200-Find-DCL                     Section.                       12760000
      *                                                                 12770000
           Perform Varying Ind-WS                                       12780000
                   From  +1              By    +1                       12790000
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         12800000
                   or  ( WS-DB2-Tbl-Version (Ind-WS)                    12810036
                                         =     R115IRP0-In-Table-Version12820036
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    12830036
                                         =     FK-OAKO-FinInst-ID       12840000
                     and WS-DB2-Contract-Type (Ind-WS)                  12850000
                                         =     FK-TFMC-Contr-Type       12860000
                     and WS-DB2-Contract-No (Ind-WS)                    12870000
                                         =     FK-TFMC-Contr-No         12880000
                     and WS-DB2-CA-Currency (Ind-WS)                    12890019
                                         =     FK-TFCA-Currency         12900019
                     and WS-DB2-PA-Seq-No (Ind-WS)                      12910019
                                         =     FK-TFPA-Seq-No           12920019
                     and WS-DB2-Role-Type (Ind-WS)                      12930019
                                         =     FK-KFTY-Role-Type )      12940019
           End-Perform                                                  12950000
      *                                                                 12960000
           .                                                            12970000
      *################################################################*12980000
       L300-Remove-DCL                   Section.                       12990000
      *                                                                 13000000
           Perform Varying Ind-WS                                       13010000
                   From  +1              By    +1                       13020000
                   Until Ind-WS          >     W-Max-Occ-WS-Tab         13030000
                   or  ( WS-DB2-Tbl-Version (Ind-WS)                    13040036
                                         =     R115IRP0-In-Table-Version13050036
                     and WS-DB2-Fin-Inst-ID (Ind-WS)                    13060036
                                         =     FK-OAKO-FinInst-ID       13070000
                     and WS-DB2-Contract-Type (Ind-WS)                  13080000
                                         =     FK-TFMC-Contr-Type       13090000
                     and WS-DB2-Contract-No (Ind-WS)                    13100000
                                         =     FK-TFMC-Contr-No         13110000
                     and WS-DB2-CA-Currency (Ind-WS)                    13120019
                                         =     FK-TFCA-Currency         13130019
                     and WS-DB2-PA-Seq-No (Ind-WS)                      13140019
                                         =     FK-TFPA-Seq-No           13150019
                     and WS-DB2-Role-Type (Ind-WS)                      13160019
                                         =     FK-KFTY-Role-Type )      13170019
           End-Perform                                                  13180000
      *                                                                 13190000
           Evaluate True                                                13200000
             When Ind-WS                 >     W-Max-Occ-WS-Tab         13210000
               Continue                                                 13220000
      *                                                                 13230000
             When other                                                 13240000
               Initialize                      WS-DB2-Row (Ind-WS)      13250000
      *                                                                 13260000
           End-Evaluate                                                 13270000
      *                                                                 13280000
           .                                                            13290000
      *################################################################*13300000
       N100-Fetch-Fin-Inst-ID            Section.                       13310000
      *                                                                 13320000
           Move  W-Fin-Inst-No (1:4)     To    W-Tmp-Konsern-Nr         13330000
      *                                                                 13340000
           If  Not R5879010-Versjon                                     13350000
           or  R5879010-In-Konsernnr     Not = W-Tmp-Konsern-Nr         13360000
      *                                                                 13370000
               Initialize                      R5879010-Konsern         13380000
               Set   R5879010-Versjon    To    True                     13390000
               Set   R5879010-In-Select  To    True                     13400000
               Move  W-Tmp-Konsern-Nr    To    R5879010-In-Konsernnr    13410000
               Call  'F5879010'          Using R5879010-Konsern         13420000
                                               R7919999-Error-Area      13430000
               End-Call                                                 13440000
               If  Not R7919999-Return-OK                               13450000
                   Move  'N101'          To    R7919999-Paragraph       13460000
                   Perform Z900-Abend                                   13470000
               End-If                                                   13480000
      *                                                                 13490000
           End-If                                                       13500000
      *                                                                 13510000
           Move  R5879010-Ut-KO-Konsern-Id                              13520000
                                         To    W-Fin-Inst-ID            13530000
      *                                                                 13540000
           .                                                            13550000
      *################################################################*13560000
       N200-Fetch-Fin-Inst-No            Section.                       13570000
      *                                                                 13580000
           If  Not R5879010-Versjon                                     13590000
           or  R5879010-In-Konsern-ID    Not = W-Fin-Inst-ID            13600000
      *                                                                 13610000
               Initialize                      R5879010-Konsern         13620000
               Set   R5879010-Versjon    To    True                     13630000
               Set   R5879010-In-Select  To    True                     13640000
               Move  W-Fin-Inst-ID       To    R5879010-In-Konsern-ID   13650000
               Call  'F5879010'          Using R5879010-Konsern         13660000
                                               R7919999-Error-Area      13670000
               End-Call                                                 13680000
               If  Not R7919999-Return-OK                               13690000
                   Move  'N201'          To    R7919999-Paragraph       13700000
                   Perform Z900-Abend                                   13710000
               End-If                                                   13720000
      *                                                                 13730000
           End-If                                                       13740000
      *                                                                 13750000
           Move  R5879010-Ut-KO-Konsernnummer                           13760000
                                         To    W-Tmp-Konsern-Nr         13770000
           Move  W-Tmp-Konsern-Nr        To    W-Fin-Inst-No            13780000
      *                                                                 13790000
           .                                                            13800000
      *################################################################*13810001
       N300-Fetch-Customer-ID            Section.                       13820001
      *                                                                 13830001
           If  W-Fin-Inst-No             =     Space                    13840001
           and W-Fin-Inst-ID             Not = +0                       13850001
               Perform N200-Fetch-Fin-Inst-No                           13860001
           End-If                                                       13870001
      *                                                                 13880001
           Move  W-Fin-Inst-No (1:4)     To    W-Tmp-Konsern-Nr         13890001
      *                                                                 13900001
           If  Not R1781910-Versjon                                     13910001
           or  R1781910-In-Konsern-Nr    Not = W-Tmp-Konsern-Nr         13920001
           or  R1781910-In-Kunde-Nr      Not = W-Customer-No            13930001
      *                                                                 13940001
               Initialize                      R1781910-Kunde-ID        13950001
               Set   R1781910-Versjon    To    True                     13960001
               Set   R1781910-In-Select  To    True                     13970001
               Move  W-Tmp-Konsern-Nr    To    R1781910-In-Konsern-Nr   13980001
               Move  W-Customer-No       To    R1781910-In-Kunde-Nr     13990001
               Call  'F1781910'          Using R1781910-Kunde-ID        14000001
                                               R7919999-Error-Area      14010001
               End-Call                                                 14020001
      *                                                                 14030001
      * We may have received a customer-no that does not exist in       14040014
      * FD Customer, therefore we must accept Return-Error.             14050014
               Evaluate True                                            14060014
                 When R7919999-Return-Abend                             14070014
                   Move  'N301'          To    R7919999-Paragraph       14080001
                   Perform Z900-Abend                                   14090001
                 When R7919999-Return-Error                             14100014
                   Move  +0              To    R1781910-Ut-Kunde-ID     14110014
                   Set   R7919999-Return-OK                             14120014
                                         To    True                     14130014
               End-Evaluate                                             14140015
      *                                                                 14150001
           End-If                                                       14160001
      *                                                                 14170001
           Move  R1781910-Ut-Kunde-ID    To    W-Customer-ID            14180001
      *                                                                 14190001
           .                                                            14200001
      *################################################################*14210001
       N400-Fetch-Customer-No            Section.                       14220001
      *                                                                 14230001
           If  Not R1781910-Versjon                                     14240001
           or  R1781910-In-Kunde-ID      Not = W-Customer-ID            14250001
      *                                                                 14260001
               Initialize                      R1781910-Kunde-ID        14270001
               Set   R1781910-Versjon    To    True                     14280001
               Set   R1781910-In-Select  To    True                     14290001
               Move  W-Customer-ID       To    R1781910-In-Kunde-ID     14300001
               Call  'F1781910'          Using R1781910-Kunde-ID        14310001
                                               R7919999-Error-Area      14320001
               End-Call                                                 14330001
      *                                                                 14340001
               If  Not R7919999-Return-OK                               14350001
                   Move  'N401'          To    R7919999-Paragraph       14360001
                   Perform Z900-Abend                                   14370001
               End-If                                                   14380001
      *                                                                 14390001
           End-If                                                       14400001
      *                                                                 14410001
           Move  R1781910-Ut-Kunde-Nr    To    W-Customer-No            14420001
      *                                                                 14430001
           .                                                            14440001
      *################################################################*14450001
       ZI00-Conv-Input-Version           Section.                       14460008
      *                                                                 14470000
      * Version control.                                                14480000
      * If conversion is needed, we call the conversion module.         14490000
      *                                                                 14500000
           Set   R115IRP0-Version        To    True                     14510000
           Move  Length                  Of    R115IRP0-Related-Party   14520000
                                         To    W-IO-Length              14530000
      *                                                                 14540000
           Evaluate True                                                14550000
             When L-Ext-IO-Area (1:8)    =     R115IRP0-Version-No      14560000
             and  Length                 Of    L-Ext-IO-Area            14570000
                                         Not < W-IO-Length              14580000
               Move  L-Ext-IO-Area (1:W-IO-Length)                      14590000
                                         To    W-Int-IO-Area            14600000
      *                                                                 14610000
             When Other                                                 14620000
               Call  'F115I999'                                         14630000
                   Using By Content      'F115IRP0 '                    14640000
                                         'INPUT '                       14650000
                         By Reference    L-Ext-IO-Area                  14660000
                                         W-Int-IO-Area                  14670000
                                         R7919999-Error-Area            14680000
               End-Call                                                 14690000
      *                                                                 14700000
               If  R7919999-Return-Abend                                14710000
                   Move  'ZI03'          To    R7919999-Paragraph       14720000
                   Perform Z900-Abend                                   14730000
               End-If                                                   14740000
      *                                                                 14750000
           End-Evaluate                                                 14760000
      *                                                                 14770000
           .                                                            14780000
      *################################################################*14790000
       ZO00-Conv-Output-Version          Section.                       14800008
      *                                                                 14810000
      * Version control.                                                14820000
      * If conversion is needed, we call the conversion module.         14830000
      *                                                                 14840000
           Evaluate True                                                14850000
             When L-Ext-IO-Area (1:8)    =     R115IRP0-Version-No      14860000
             and  Length                 Of    L-Ext-IO-Area            14870000
                                         Not < W-IO-Length              14880000
               Move  W-Int-IO-Area       To    L-Ext-IO-Area            14890000
                                                         (1:W-IO-Length)14900000
      *                                                                 14910000
             When Other                                                 14920000
               Call  'F115I999'                                         14930000
                   Using By Content      'F115IRP0 '                    14940000
                                         'OUTPUT '                      14950000
                         By Reference    L-Ext-IO-Area                  14960000
                                         W-Int-IO-Area                  14970000
                                         R7919999-Error-Area            14980000
               End-Call                                                 14990000
      *                                                                 15000000
               If  R7919999-Return-Abend                                15010000
                   Move  'ZO01'          To    R7919999-Paragraph       15020000
                   Perform Z900-Abend                                   15030000
               End-If                                                   15040000
      *                                                                 15050000
           End-Evaluate                                                 15060000
      *                                                                 15070000
           .                                                            15080000
      *################################################################*15090000
       Z000-Error-Message                Section.                       15100000
      *                                                                 15110000
           Set   R7918030-Version        To    True                     15120000
      *                                                                 15130000
           Move  'TF'                    To    R7918030-In-System-ID    15140000
           Move  R115X000-Fin-Inst-No    To    R7918030-In-Fin-Inst-No  15150000
           Move  R115X000-FI-Language-639-1                             15160000
                                         To    R7918030-In-Language     15170000
           If  R115X000-Trace-On                                        15180003
               Set   R7918030-In-Log-Yes To    True                     15190003
           End-If                                                       15200003
      *                                                                 15210000
           Call  'F7918030'              Using R7918030-ErrorMessage    15220000
           End-Call                                                     15230000
      *                                                                 15240000
           Move  R7918030-Out-MessageText                               15250000
                                         To    R7919999-Message         15260000
      *                                                                 15270000
           .                                                            15280000
      *################################################################*15290000
       Z900-Abend                        Section.                       15300000
      *                                                                 15310000
           If  R7919999-Return-Code      Not   Numeric                  15320000
           or  Not R7919999-Return-Abend                                15330000
               Move  +0                  To    R7919999-Module-Ind      15340000
           End-If                                                       15350000
      *                                                                 15360000
           Add   +1                      To    R7919999-Module-Ind      15370000
      *                                                                 15380000
           If  R7919999-Module-Ind       Not >                          15390000
                             ( Length    Of    R7919999-Module-Tab      15400000
                             / Length    Of    R7919999-Module-Element )15410000
               Move  'F115IRP0'          To    R7919999-Module-Name     15420000
                                                   (R7919999-Module-Ind)15430000
               Move  R7919999-Paragraph  To    R7919999-Module-Para     15440000
                                                   (R7919999-Module-Ind)15450000
           End-If                                                       15460000
      *                                                                 15470000
           Set   R7919999-Return-Abend   To    TRUE                     15480000
      *                                                                 15490000
           Goback.                                                      15500000
