       Identification Division.                                         00010099
       Program-Id. FTFCL110.                                            00020099
       Author. Z3216TW                                                  00030099
      *################################################################*00040099
      *                                                                *00050099
      * Servo - logilevel   / L-module - Logic module                  *00060099
      * Uses STG, in accordance with new Servo Standards.              *00070099
      *                                                                *00080099
      * TFU11/01 - Forandre Parter Inkasso                             *00090099
      *                                                                *00100099
      * Code between <META> and </META> tags must not be modified. Do  *00110099
      * your modifications in the specified user sections !            *00120099
      *                                                                *00130099
      *################################################################*00140099
      * Date ! Si! Type of change                                ! 3A !*00150099
      *------+---+-----------------------------------------------+----+*00151099
      *140818!HF ! Swift nov2018                                 !    !*00152099
      *------+---+-----------------------------------------------+----+*00160099
      *121108!NDL! Garantier ILG/ELG                          OPP017132*00170099
      *------+---+-----------------------------------------------+----+*00170199
      *110908!NDL! Kall BPOXINS0 for sjekk av sektorkoder     PRO015254*00170299
      *------+---+-----------------------------------------------+----+*00171099
      *070201!HGF! Benytter F728IXL0 - endret logikk             !    !*00172099
      *------+---+-----------------------------------------------+----+*00180099
      *030918!NDL! Move Old BENEF to FIELD 79 - MT707 in AMEND   !LO18!*00190099
      *------+---+-----------------------------------------------+----+*00200099
      *030127!HB ! Validate bic-code to be 11 posisions without  !LO18!*00210099
      *      !   ! spaces.                                       !    !*00220099
      *------+---+-----------------------------------------------+----+*00230099
      *011217!NDL! Insert Bic with upper case in tast-part       !LO18!*00240099
      *------+---+-----------------------------------------------+----+*00250099
      *011028!LG ! Corrected error in H600 - "saved" warning     !LO18!*00260099
      *------+---+-----------------------------------------------+----+*00270099
      *011025!NDL! other banks references must be unique (H600)  !LO18!*00280099
      *------+---+-----------------------------------------------+----+*00290099
      *010122!NDL! Insert parts in TF_Customer                   !LT12!*00300099
      *------+---+-----------------------------------------------+----+*00310099
      *010108!NDL! Bic Part, fjernet igjen 12.01.01              !LT12!*00320099
      *------+---+-----------------------------------------------+----+*00330099
      *000221!NDL! Tast Part, new interface for create customer  !LM04!*00340099
      *------+---+-----------------------------------------------+----+*00350099
      *990324!&&&! New module                                    !&&&&!*00360099
      *################################################################*00370099
       Environment Division.                                            00380099
       Configuration Section.                                           00390099
       Special-Names.                                                   00400099
           Decimal-Point Is Comma.                                      00410099
      *################################################################*00420099
       Data Division.                                                   00430099
       Working-Storage Section.                                         00440099
      *                                                                 00450099
       01  W-Work-Fields.                                               00460099
      *                                                                 00470099
      *<META WA-START>                                                  00480099
           05  Filler                     Pic   X(08) Value 'WA-START'. 00490099
      *</META>                                                          00500099
      *                                                                 00510099
      *    User work variables can be placed below                      00520099
           05   WC-PROGRAM-ID             Pic  X(08)  Value 'FTFCL110'. 00520199
      *                                                                 00521099
           05  Wb-In                      Pic   X(01).                  00530099
               88  Wb-In-Work                          Value 'W'.       00540099
               88  Wb-In-Actual                        Value 'A'.       00550099
           05  Wb-Remit                   Pic   X(01).                  00560099
               88  Wb-Remit-Found                      Value 'Y'.       00570099
               88  Wb-Remit-Not-Found                  Value 'N'.       00580099
           05  Wb-Drwer                   Pic   X(01).                  00590099
               88  Wb-Drwer-Found                      Value 'Y'.       00600099
               88  Wb-Drwer-Not-Found                  Value 'N'.       00610099
           05  Wb-Contract                Pic   X(01).                  00620099
               88  Wb-Main                             Value 'M'.       00630099
               88  Wb-Part                             Value 'P'.       00640099
           05  Wb-Status                  Pic   X(01)  Value 'O'.       00650099
               88  Wb-Warning                          Value 'W'.       00660099
               88  Wb-OK                               Value 'O'.       00670099
      *                                                                 00680099
           05  Ws-Currency                Pic   X(03).                  00690099
      *                                                                 00700099
           05  Ws-Bic-Code                Pic   X(11).                  00710099
      *                                                                 00720099
           05  Ws-Max-Occ-Item-Tab        Pic  S9(11)            Comp-3.00730099
           05  Ws-Idx                     Pic  S9(03)            Comp-3.00740099
      *                                                                 00750099
           05  Ws-Role-Type               Pic   X(05).                  00760099
           05  Ws-Cust-Id                 Pic  S9(11)            Comp-3.00770099
      *                                                                 00780099
           05  Ws-Idx-R                   Pic  S9(03)            Comp-3.00790099
           05  Ws-Idx-D                   Pic  S9(03)            Comp-3.00800099
      *                                                                 00810099
           05  Ws-Contract-No             Pic   Z999999.                00820099
           05  Ws-Customer-ID             Pic   99999999999.            00830099
           05  Ws-Return-Code             Pic   9.                      00840099
      *                                                                 00850099
           05  Ws-Fin-Inst-No             Pic    X(18).                 00860099
           05  Filler               Redefines   Ws-Fin-Inst-No.         00870099
               10  Ws-Fin-Inst            Pic   X(04).                  00880099
               10  Filler                 Pic   X(14).                  00890099
      *                                                                 00900099
           05  Ws-Bic-Ind                 Pic  S9(4)             Comp.  00910099
           05  Ws-Bic                     Pic   X(12).                  00920099
           05  Filler Redefines WS-Bic.                                 00930099
               10  Ws-Bic-Tab Occurs 11   Pic    X.                     00940099
               10  Ws-Bic-Rest            Pic    X.                     00950099
      *                                                                 00960099
      *<META WA-STOP>                                                   00970099
           05  Filler                     Pic   X(08) Value 'WA-STOP '. 00980099
      *</META>                                                          00990099
      *                                                                 01000099
      *----------------------------------------------------------------*01010099
      *                                                                 01020099
      * Misc. copy books:                                               01030099
      *                                                                 01040099
       01  Filler.                                                      01050099
      *                                                                 01060099
      *<META MISC-COPY1>                                                01070099
      *</META>                                                          01080099
      *<META MISC-COPY2>                                                01090099
      *</META>                                                          01100099
      *                                                                 01110099
      *    Place your copybooks below here                              01120099
           Copy R115IMC0.                                               01130099
           Copy R115IRP0.                                               01140099
           Copy R115ITP0.                                               01150099
           Copy R115ICA0.                                               01160099
           Copy R115ICU0.                                               01170099
           Copy R115ISC0.                                               01180099
      *                                                                 01190099
           Copy R115ISR0.                                               01200099
                                                                        01210099
           Copy R115L030.                                               01220099
           Copy R115L140.                                               01230099
           Copy R115L240.                                               01240099
           Copy R115L330.                                               01250099
      *                                                                 01260099
       01  R728IXL0-If-Area.                                            01270099
           Copy R728IXL0.                                               01280099
      *                                                                 01290099
      *01  R7919340-If-Area.                                            01300099
           Copy R7919340.                                               01310099
      *                                                                 01320099
           COPY  BPOXINS0.                                              01321099
      *                                                                 01323099
       01  ERROR-HANDLING.                                              01324099
           COPY R791ERR0.                                               01325099
           COPY R791ERRX.                                               01326099
      *                                                                 01330099
      *################################################################.01340099
       Linkage Section.                                                 01350099
      *                                                                 01360099
      * Fixed header from STG                                           01370099
      *                                                                 01380099
       01  L-STG-Header.                                                01390099
           Copy R400CH02.                                               01400099
      *                                                                 01410099
      * Function data                                                   01420099
      *                                                                 01430099
       01  L-Data.                                                      01440099
           Copy RTFCE110.                                               01450099
      *                                                                 01460099
      * Standard error area                                             01470099
      *                                                                 01480099
       Copy  R7919999.                                                  01490099
      *                                                                 01500099
      *################################################################.01510099
       Procedure Division                Using L-Stg-Header             01520099
                                               L-Data                   01530099
                                               R7919999-Error.          01540099
      *                                                                 01550099
       A000-Main                         Section.                       01560099
      *                                                                 01570099
           Perform B000-Initialize                                      01580099
      *                                                                 01590099
           Perform D000-Preparations                                    01600099
           Perform E000-Processing                                      01610099
           .                                                            01620099
      *                                                                 01630099
       A000-Main-Ex.                                                    01640099
           Goback.                                                      01650099
                                                                        01660099
      *################################################################*01670099
      * Initialization of necessary work fields                        *01680099
      *                                                                *01690099
      *----------------------------------------------------------------*01700099
       B000-Initialize                   Section.                       01710099
      *                                                                 01720099
           Initialize                          R7919999-Error           01730099
           Initialize                          W-Work-Fields            01740099
      *    Maximum number of occurences in ouput table.                 01750099
           Compute  Ws-Max-Occ-Item-Tab                                 01760099
               =  ( Length               Of    RTFCE110-I-Type-G        01770099
                  - Length               Of    RTFCE110-I-Type-A )      01780099
               /    Length               Of    RTFCE110-I-Type-T        01790099
           End-Compute                                                  01800099
      *                                                                 01810099
           .                                                            01820099
      *                                                                 01830099
       B000-Initialize-Ex.                                              01840099
           Exit.                                                        01850099
                                                                        01860099
      *################################################################*01870099
      * Add necessary preparation code here. Add Perform to other      *01880099
      * Dxxx- sections.                                                *01890099
      *----------------------------------------------------------------*01900099
       D000-Preparations                 Section.                       01910099
      *                                                                 01920099
           Perform D100-Read-Sys-Code-Rel                               01930099
      *                                                                 01940099
           .                                                            01950099
      *                                                                 01960099
       D000-Preparations-Ex.                                            01970099
           Exit.                                                        01980099
      *                                                                 01990099
      *################################################################*02000099
       D100-Read-Sys-Code-Rel            Section.                       02010099
      *                                                                 02020099
           Initialize                          R115ISR0-Sys-Code-Rel    02030099
           Set   R115ISR0-Version        To    True                     02040099
           Set   R115ISR0-In-Get-1st     To    True                     02050099
           Set   R115ISR0-In-CC-Count    To    True                     02060099
      *                                                                 02070099
           Move  RTFCE110-I-Fin-Inst-No-D                               02080099
                                         To    R115ISR0-In-F-I-No       02090099
           Move  'OPERATION-TYPE'        To    R115ISR0-In-From-ST-Type 02100099
           Move  RTFCE110-I-Operation-Type-D                            02110099
                                         To  R115ISR0-In-From-SC-Code   02120099
           Move  Spaces                  To  R115ISR0-In-From-Contr-Type02130099
      *                                                                 02140099
           Move  'STATUS'                To    R115ISR0-In-To-ST-Type   02150099
           Move  '*'                     To    R115ISR0-In-To-SC-Code   02160099
           Move  Spaces                  To    R115ISR0-In-To-Contr-Type02170099
      *                                                                 02180099
           Move  'VALID-OP-ST'           To    R115ISR0-In-Relation-Type02190099
                                                                        02200099
           Call  'F115ISR0'              Using R115ISR0-Sys-Code-Rel    02210099
                                               R7919999-Error-Area      02220099
           End-Call                                                     02230099
      *                                                                 02240099
           Evaluate True                                                02250099
             When R7919999-Return-Abend                                 02260099
               Move  'D101'              To    R7919999-Paragraph       02270099
               Move  'FM'                To    R400CH01-Message-Code    02280099
               Perform Z900-Abend                                       02290099
      *                                                                 02300099
             When R7919999-Return-Error                                 02310099
               Move  'D102'              To    R7919999-Paragraph       02320099
               Move  'FM'                To    R400CH01-Message-Code    02330099
               Perform Z700-Error-AE                                    02340099
      *                                                                 02350099
             When R115ISR0-Out-Total-Rows > 1                           02360099
               Move  'VAR1'              To    R400CH01-Message-Key(1)  02370099
               Move  RTFCE110-I-Operation-Type-D                        02380099
                                         To    R400CH01-Message-Data(1) 02390099
               Move  'TF-SY-STATUS-NOT-UNIQUE'                          02400099
                                         To    R400CH01-Message-Code    02410099
               Perform Z700-Error-AE                                    02420099
           End-Evaluate                                                 02430099
           .                                                            02440099
      *                                                                 02450099
       D100-Read-Sys-Code-Rel-Ex.                                       02460099
           Exit.                                                        02470099
                                                                        02480099
      *################################################################*02490099
      * Place the processing control logic here. Use perform statements*02500099
      * to other sections.                                             *02510099
      *----------------------------------------------------------------*02520099
       E000-Processing                   Section.                       02530099
      *                                                                 02540099
           Perform F000-Modification                                    02550099
           Perform G000-Update                                          02560099
           .                                                            02570099
      *                                                                 02580099
       E000-Processing-Ex.                                              02590099
           Exit.                                                        02600099
                                                                        02610099
      *################################################################*02620099
      * You can put code to perform necessary modification of data     *02630099
      * fields etc. here                                               *02640099
      *----------------------------------------------------------------*02650099
       F000-Modification                 Section.                       02660099
      *                                                                 02670099
           Continue                                                     02680099
           .                                                            02690099
      *                                                                 02700099
       F000-Modification-Ex.                                            02710099
           Exit.                                                        02720099
                                                                        02730099
      *################################################################*02740099
      * Control your database updates/queries from here. Use Perform   *02750099
      * statements to the different database parts that will be        *02760099
      * accessed in such a way that one section only controls update of*02770099
      * one database element.                                          *02780099
      *----------------------------------------------------------------*02790099
       G000-Update                       Section.                       02800099
      *                                                                 02810099
           Set  Wb-In-Actual             To    True                     02820099
           Perform H200-Read-Main-Contract                              02830099
           If  R115IMC0-In-Progress Not = 'Y'                           02840099
               Perform G600-Create-Shadow                               02850099
           End-If                                                       02860099
      *                                                                 02870099
           If  RTFCE110-I-Part-Amount-No-I = 'U'                        02880099
               Perform H300-Read-Contract-Amount                        02890099
           End-If                                                       02900099
      *                                                                 02910099
           Move  +1                      To    Ws-Idx                   02920099
      *                                                                 02930099
           Perform Until Ws-Idx > Ws-Max-Occ-Item-Tab                   02940099
                                                                        02950099
               Evaluate True                                            02960099
                 When RTFCE110-I-Selected-D (Ws-Idx) = 'N'              02970099
      * 1.       Deleting Related_Party and Tast_Part.                  02980099
                                                                        02990099
                   Move  RTFCE110-I-Type-D (Ws-Idx)                     03000099
                                         To    Ws-Role-Type             03010099
                   If  RTFCE110-I-Part-Amount-No-I Not = 'U'            03020099
                       Set  Wb-Main      To    True                     03030099
                   Else                                                 03040099
                       Set  Wb-Part      To    True                     03050099
                   End-If                                               03060099
                                                                        03070099
                   Perform H100-Read-Related-Party                      03080099
                                                                        03090099
                   If  R7919999-Return-OK                               03100099
                       Perform G300-Delete-Related-Party                03110099
                   End-If                                               03120099
      *                                                                 03130099
                 When RTFCE110-I-Selected-D (Ws-Idx) = 'Y'              03140099
                  And (    RTFCE110-I-Operation-Type-D = 'ACCEPT-COLL'  03150099
                        Or RTFCE110-I-Operation-Type-D = 'RETURN'       03160099
                        Or RTFCE110-I-Operation-Type-D = 'EXPIRE-ILC'   03170099
                        Or RTFCE110-I-Operation-Type-D = 'EXPIRE-GAR' ) 03171099
                                                                        03180099
      * 2.       Update Related_Party on part                           03190099
      *          These screens can only update reference and accounts,  03200099
                   Move  RTFCE110-I-Type-D (Ws-Idx)                     03210099
                                         To    Ws-Role-Type             03220099
                   Set  Wb-Part          To    True                     03230099
                   Perform H100-Read-Related-Party                      03240099
                   If  R7919999-Return-OK                               03250099
      *            Party already exists on Related_Party - part.        03260099
      *            We update...                                         03270099
                       Perform G100-Update-Related-Party                03280099
                   Else                                                 03290099
      *            Party does not exist on Related_Party - part.        03300099
      *            We look for it on Related-Party - main.              03310099
                       Set  Wb-Main      To    True                     03320099
                       Perform H100-Read-Related-Party                  03330099
                       If  R7919999-Return-OK                           03340099
      *                Party exists on Related_Party - main. We copy it 03350099
      *                into Related_Party - part.                       03360099
                           Perform G250-Insert-Related-Party            03370099
      *                    If R115IRP0-Customer-Id > 0                  03380099
      *                    We also check Tast_Part - main.              03390099
                             Perform H500-Read-Tast-Part                03400099
                             If  R7919999-Return-OK                     03410099
      *                      Part exists on Tast_Part - main. We copy it03420099
      *                      into Tast_Part - part.                     03430099
                                 Perform G850-Insert-Tast-Part          03440099
                             End-If                                     03450099
      *                    End-If                                       03460099
                       Else                                             03470099
                           Perform H400-Read-SYS-Code                   03480099
                           Move  'VAR1'  To    R400CH01-Message-Key(1)  03490099
                           Move  R115ISC0-Description                   03500099
                                         To    R400CH01-Message-Data(1) 03510099
                           Move  'TF-SY-NO-PART'                        03520099
                                         To    R400CH01-Message-Code    03530099
                           Perform Z700-Error-AE                        03540099
                       End-If                                           03550099
                   End-If                                               03560099
                                                                        03570099
                 When RTFCE110-I-Selected-D (Ws-Idx) = 'Y'              03580099
                  And (    RTFCE110-I-Operation-Type-D = 'SETTLE-ILC'   03590099
                        Or RTFCE110-I-Operation-Type-D = 'ACCEPT-ILC'   03600099
                        Or RTFCE110-I-Operation-Type-D = 'DISPOSE'      03610099
                        Or RTFCE110-I-Operation-Type-D = 'ACCEPT-ELC'   03620099
                        Or RTFCE110-I-Operation-Type-D = 'SETTLE-ELC'   03630099
                        Or RTFCE110-I-Operation-Type-D = 'SETTLE-COLL') 03640099
                                                                        03650099
      * 3.       New Related_Party on part or update                    03660099
                   Move  RTFCE110-I-Type-D (Ws-Idx)                     03670099
                                         To    Ws-Role-Type             03680099
                   Set  Wb-Part          To    True                     03690099
                   Perform H100-Read-Related-Party                      03700099
                                                                        03710099
                   Evaluate True                                        03720099
                     When R7919999-Return-OK                            03730099
      *                Party already exists on Related_Party - part.    03740099
      *                We update...                                     03750099
                       If  R115IRP0-Customer-Id > 0                     03760099
      *                Sjekker innkomne kundetype:                      03770099
                           Evaluate RTFCE110-I-Custm-Type-D (Ws-Idx)    03780099
                           When 'T'                                     03790099
      *                       - We change from real part to tastpart    03800099
                              Perform G300-Delete-Related-Party         03810099
                              Move +0      To R115IRP0-Customer-Id      03820099
                              Perform G200-Insert-Related-Party         03830099
                              Perform G800-Insert-Tast-Part             03840099
      *                    When 'B'                                     03850099
      *                       - We change from real part to bic-part    03860099
      *                       Perform G300-Delete-Related-Party         03870099
      *                       Move +0      To R115IRP0-Customer-Id      03880099
      *                       Perform G200-Insert-Related-Party         03890099
                           When Other                                   03900099
      *                       - We change real part                     03910099
                              Perform G100-Update-Related-Party         03920099
                           End-Evaluate                                 03930099
                       Else                                             03940099
      *                    R115IRP0-Customer-Id = 0                     03950099
      *lg start            Evaluate RTFCE110-I-Custm-Type-D (Ws-Idx)    03960099
      *lg slutt            When 'T'                                     03970099
      *                       Endrer fra Bic-part til tastpart          03980099
      *lg start               If R115IRP0-Bic-Bank > Spaces             03990099
      *                          Perform G100-Update-Related-Party      04000099
      *                          Perform G800-Insert-Tast-Part          04010099
      *                       Else                                      04020099
      *                       Oppdaterer tastpart                       04030099
      *                          Perform G100-Update-Related-Party      04040099
      *                          Perform H500-Read-Tast-Part            04050099
      *                          If R7919999-Return-OK                  04060099
      *                            Perform G700-Update-Tast-Part        04070099
      *                          Else                                   04080099
      *                            Set  R7919999-Return-OK To True      04090099
      *                          End-If                                 04100099
      *lg slutt               End-If                                    04110099
      *                    When 'B'                                     04120099
      *                       If R115IRP0-Bic-Bank = Spaces             04130099
      *                       Endrer fra tastpart til Bic-part          04140099
      *                          Perform  H500-Read-Tast-Part           04150099
      *                          If  R7919999-Return-OK                 04160099
      *                            Perform  G900-Delete-Tast-Part       04170099
      *                          Else                                   04180099
      *                            Set  R7919999-Return-OK To True      04190099
      *                          End-If                                 04200099
      *                       End-If                                    04210099
      *                       Perform G100-Update-Related-Party         04220099
      *                    When Other                                   04230099
      *                       - We change from tastpart to real part    04240099
                              If RTFCE110-I-Customer-Id-D (Ws-Idx) > 0  04250099
                                 Perform G300-Delete-Related-Party      04260099
                                 Move RTFCE110-I-Customer-Id-D (Ws-Idx) 04270099
                                                 To R115IRP0-Customer-Id04280099
                                 Perform G200-Insert-Related-Party      04290099
                              Else                                      04300099
      *                       - We change part                          04310099
                                 Perform G100-Update-Related-Party      04320099
                              End-If                                    04330099
      *                    End-Evaluate                                 04340099
                       End-If                                           04350099
                                                                        04360099
                     When (RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'      04370099
                      Or  (RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04380099
                      and  RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T' ))   04390099
      *               or   RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'B'      04400099
                      And RTFCE110-I-Operation-Type-D = 'SETTLE-ILC'    04410099
      * ndl 08.11.2000, fjernet test på rolletype                       04420099
      *               And RTFCE110-I-Type-D (Ws-Idx)  = 'AVAIL'         04430099
      *                We insert the party on Related_Party - part.     04440099
                       Perform G200-Insert-Related-Party                04450099
      *                and on tast part                                 04460099
                       If  RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04470099
                       and RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T'      04480099
                           Perform G800-Insert-Tast-Part                04490099
                       End-If                                           04500099
                                                                        04501099
      * ndl 18.04.2007, feilretting AVAIL ved accept-ilc                04501199
                     When (RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'      04502099
                      Or  (RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04503099
                      and  RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T' ))   04504099
      *               or   RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'B'      04505099
                      And RTFCE110-I-Operation-Type-D = 'ACCEPT-ILC'    04506099
      *               And RTFCE110-I-Type-D (Ws-Idx)  = 'AVAIL'         04508099
      *                We insert the party on Related_Party - part.     04509099
                       Perform G200-Insert-Related-Party                04509199
      *                and on tast part                                 04509299
                       If  RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04509399
                       and RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T'      04509499
                           Perform G800-Insert-Tast-Part                04509599
                       End-If                                           04509699
                                                                        04510099
                     When (RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'      04520099
                      Or  (RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04530099
                      and  RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T' ))   04540099
      **              or   RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'B' )))  04550099
                      And RTFCE110-I-Operation-Type-D = 'SETTLE-ELC'    04560099
      * ndl 08.11.2000, fjernet test på rolletype                       04570099
      *               And (    RTFCE110-I-Type-D (Ws-Idx)  = 'BENEF'    04580099
      *                     Or RTFCE110-I-Type-D (Ws-Idx)  = 'REIMB' )  04590099
      *                We insert the party on Related_Party - part.     04600099
                       Perform G200-Insert-Related-Party                04610099
      *                and on tast part                                 04620099
                       If  RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04630099
                       and RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T'      04640099
                           Perform G800-Insert-Tast-Part                04650099
                       End-If                                           04660099
                                                                        04670099
                     When (RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'      04680099
                      Or  (RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04690099
                      and  RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T' ))   04700099
      *               or   RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'B' )))  04710099
                      And RTFCE110-I-Operation-Type-D = 'DISPOSE'       04720099
      * ndl 08.11.2000, fjernet test på rolletype                       04730099
      *               And RTFCE110-I-Type-D (Ws-Idx)  = 'REIMB'         04740099
      *                We insert the party on Related_Party - part.     04750099
                       Perform G200-Insert-Related-Party                04760099
      *                and on tast part                                 04770099
                       If  RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04780099
                       and RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T'      04790099
                           Perform G800-Insert-Tast-Part                04800099
                       End-If                                           04810099
                                                                        04820099
                     When (RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'      04830099
                      Or  (RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04840099
                      and  RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T' ))   04850099
      *               or   RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'B' )))  04860099
                      And RTFCE110-I-Operation-Type-D = 'SETTLE-COLL'   04870099
      * ndl 08.11.2000, fjernet test på rolletype                       04880099
      *               And (   RTFCE110-I-Type-D (Ws-Idx) = 'AGENT'      04890099
      *                    Or RTFCE110-I-Type-D (Ws-Idx) = 'DRWER' )    04900099
      *                We insert the party on Related_Party - part.     04910099
                       Perform G200-Insert-Related-Party                04920099
      *                and on tast part                                 04930099
                       If  RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'      04940099
                       and RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T'      04950099
                           Perform G800-Insert-Tast-Part                04960099
                       End-If                                           04970099
                                                                        04980099
                     When Other                                         04990099
      *                Party does not exist on Related_Party - part.    05000099
      *                We look for it on Related-Party - main.          05010099
                       Set  Wb-Main      To    True                     05020099
                       Perform H100-Read-Related-Party                  05030099
                       If  R7919999-Return-OK                           05040099
      *                Party exists on Related_Party - main. We copy it 05050099
      *                into Related_Party - part.                       05060099
                           Perform G250-Insert-Related-Party            05070099
                                                                        05080099
      *                    We also check Tast_Part - main.              05090099
                           Perform H500-Read-Tast-Part                  05100099
                           If  R7919999-Return-OK                       05110099
      *                    Part exists on Tast_Part - main. We copy it  05120099
      *                    into Tast_Part - part.                       05130099
                               Perform G850-Insert-Tast-Part            05140099
                           End-If                                       05150099
                       Else                                             05160099
      *                Party does not exist on Related_Party - main.    05170099
      *                We insert the party on Related_Party - part.     05180099
      * Feilretting 03.11.2000 (ndl)                                    05190099
      *                We insert if it is a real new part               05200099
                         If ((RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'   05210099
                         and  RTFCE110-I-Customer-Id-D (Ws-Idx) > 0 )   05220099
                         Or  (RTFCE110-I-Custm-Type-I  (Ws-Idx) = 'U'   05230099
                         and  RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T')) 05240099
      *                  or   RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'B')))05250099
                            Perform G200-Insert-Related-Party           05260099
      *                                                                 05270099
                            If  RTFCE110-I-Custm-Type-D  (Ws-Idx) = 'T' 05280099
                                Perform G800-Insert-Tast-Part           05290099
                            End-If                                      05300099
                                                                        05310099
                         End-If                                         05320099
                         Set  R7919999-Return-OK     To True            05330099
                       End-If                                           05340099
                   End-Evaluate                                         05350099
                                                                        05360099
                 When RTFCE110-I-Selected-D    (Ws-Idx) = 'Y'           05370099
                  And RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'           05380099
                  And RTFCE110-I-Customer-Id-D (Ws-Idx) > 0             05390099
      * 5.       New Related_Party, or update of existing Related_Party.05400099
                                                                        05410099
                   Move  RTFCE110-I-Type-D (Ws-Idx)                     05420099
                                         To    Ws-Role-Type             05430099
                   If  RTFCE110-I-Part-Amount-No-I Not = 'U'            05440099
                       Set  Wb-Main      To    True                     05450099
                   Else                                                 05460099
                       Set  Wb-Part      To    True                     05470099
                   End-If                                               05480099
                                                                        05490099
                   Perform H100-Read-Related-Party                      05500099
                                                                        05510099
      *            We have found the party and there is no change in    05520099
      *            the customer-id. We update existing party.           05530099
                   If  R7919999-Return-OK                               05540099
                   And RTFCE110-I-Customer-Id-I (Ws-Idx) = 'U'          05550099
                   And RTFCE110-I-Customer-Id-D (Ws-Idx)                05560099
                                                  = R115IRP0-Customer-Id05570099
                       Perform G100-Update-Related-Party                05580099
                   End-If                                               05590099
                                                                        05600099
      *            We remove earlier tast-part if it exists             05610099
                   If  R7919999-Return-OK                               05620099
                   And R115IRP0-Customer-Id = 0                         05630099
                       Perform  H500-Read-Tast-Part                     05640099
                       If  R7919999-Return-OK                           05650099
                           Perform  G900-Delete-Tast-Part               05660099
                       Else                                             05670099
                           Set R7919999-Return-OK  To True              05680099
                       End-If                                           05690099
                   End-If                                               05700099
                                                                        05710099
      *            We have found the party but the customer-id has      05720099
      *            changed. We delete the old one and start from scratch05730099
                   If  R7919999-Return-OK                               05740099
                   And RTFCE110-I-Customer-Id-D (Ws-Idx)                05750099
                                              Not = R115IRP0-Customer-Id05760099
                                                                        05770099
      *                We have a new customer in FD-Kunde               05780099
                       If  RTFCE110-I-Custm-Type-I (Ws-Idx) = 'U'       05790099
                       And RTFCE110-I-Custm-Type-D (Ws-Idx) = 'C'       05800099
                           Perform  I100-Create-Customer                05810099
                       End-If                                           05820099
                                                                        05830099
                       Perform G300-Delete-Related-Party                05840099
                       Perform G200-Insert-Related-Party                05850099
      *  18.09.03 We insert new BENEF in field 79 in MT707 when amend   05860099
112018*  14.09.18 Felt 79 i MT707 skal bort                             05861099
112018*               If   RTFCE110-I-Type-D (Ws-Idx)  = 'BENEF'        05870099
112018*               And (RTFCE110-I-Operation-Type-D =                05880099
112018*                                              'AMEND-ILC-MAIN'   05890099
112018*               OR   RTFCE110-I-Operation-Type-D =                05900099
112018*                                              'AMEND-ELC-MAIN' ) 05910099
112018*                   Perform I400-Insert-Field79-MT707             05920099
112018*               End-If                                            05930099
                   End-If                                               05940099
                                                                        05950099
      *            The party does not exist. We create it.              05960099
                   If  R7919999-Return-Error                            05970099
      *                We might have a new customer in FD-Kunde.        05980099
                       If  RTFCE110-I-Custm-Type-I (Ws-Idx) = 'U'       05990099
                       And RTFCE110-I-Custm-Type-D (Ws-Idx) = 'C'       06000099
                           Perform  I100-Create-Customer                06010099
                       End-If                                           06020099
                                                                        06030099
                       Perform G200-Insert-Related-Party                06040099
                   End-If                                               06050099
                                                                        06060099
                 When RTFCE110-I-Selected-D    (Ws-Idx) = 'Y'           06070099
                  And (RTFCE110-I-Customer-Id-I (Ws-Idx) Not = 'U'      06080099
                   or  RTFCE110-I-Customer-Id-D (Ws-Idx) = 0)           06090099
      * 6.        Update of existing Related_Party and tast-part.       06100099
      *                                                                 06110099
                   Move  RTFCE110-I-Type-D (Ws-Idx)                     06120099
                                         To    Ws-Role-Type             06130099
                   If  RTFCE110-I-Part-Amount-No-I Not = 'U'            06140099
                       Set  Wb-Main      To    True                     06150099
                   Else                                                 06160099
                       Set  Wb-Part      To    True                     06170099
                   End-If                                               06180099
                                                                        06190099
                   Perform H100-Read-Related-Party                      06200099
                                                                        06210099
                   Evaluate True                                        06220099
                     When R7919999-Return-OK                            06230099
      *                Party already exists on Related_Party.           06240099
      *                We update...                                     06250099
                       If  R115IRP0-Customer-Id > 0                     06260099
      *                Sjekker innkomne kundetype:                      06270099
                           Evaluate RTFCE110-I-Custm-Type-D (Ws-Idx)    06280099
                           When 'T'                                     06290099
      *                       - We change from real part to tastpart    06300099
                              Perform G300-Delete-Related-Party         06310099
                              Move +0      To R115IRP0-Customer-Id      06320099
                              Perform G200-Insert-Related-Party         06330099
                              Perform G800-Insert-Tast-Part             06340099
      *  18.09.03 We insert new BENEF in field 79 in MT707 when amend   06350099
112018*  14.08.18 Felt 79 i MT707 skal bort.                            06351099
112018*                       If   RTFCE110-I-Type-D (Ws-Idx) = 'BENEF' 06360099
112018*                       And (RTFCE110-I-Operation-Type-D =        06370099
112018*                                                'AMEND-ILC-MAIN' 06380099
112018*                       OR   RTFCE110-I-Operation-Type-D =        06390099
112018*                                              'AMEND-ELC-MAIN' ) 06400099
112018*                           Perform I400-Insert-Field79-MT707     06410099
112018*                       End-If                                    06420099
      *                    When 'B'                                     06430099
      *                       - We change from real part to bic-part    06440099
      *                       Perform G300-Delete-Related-Party         06450099
      *                       Move +0      To R115IRP0-Customer-Id      06460099
      *                       Perform G200-Insert-Related-Party         06470099
                           When Other                                   06480099
      *                       - We change real part                     06490099
      *                                                                 06500099
                              Perform G100-Update-Related-Party         06510099
                           End-Evaluate                                 06520099
                       Else                                             06530099
      *                    R115IRP0-Customer-Id = 0                     06540099
                           Evaluate RTFCE110-I-Custm-Type-D (Ws-Idx)    06550099
                           When 'T'                                     06560099
      *                       Endrer fra Bic-part til tastpart          06570099
      *                       If R115IRP0-Bic-Bank > Spaces             06580099
      *                          Perform G100-Update-Related-Party      06590099
      *                          Perform G800-Insert-Tast-Part          06600099
      *                       Else                                      06610099
      *                       Oppdaterer tastpart                       06620099
                                 Perform G100-Update-Related-Party      06630099
                                 Perform H500-Read-Tast-Part            06640099
                                 If R7919999-Return-OK                  06650099
                                   Perform G700-Update-Tast-Part        06660099
                                 Else                                   06670099
                                   Set  R7919999-Return-OK To True      06680099
                                 End-If                                 06690099
      **                      End-If                                    06700099
      *                    When 'B'                                     06710099
      *                       If R115IRP0-Bic-Bank = Spaces             06720099
      *                       Endrer fra tastpart til Bic-part          06730099
      *                          Perform  H500-Read-Tast-Part           06740099
      *                          If  R7919999-Return-OK                 06750099
      *                            Perform  G900-Delete-Tast-Part       06760099
      *                          Else                                   06770099
      *                            Set  R7919999-Return-OK To True      06780099
      *                          End-If                                 06790099
      *                       End-If                                    06800099
      *                       Perform G100-Update-Related-Party         06810099
                           When Other                                   06820099
      *                       - We change from tastpart to real part    06830099
                              If RTFCE110-I-Customer-Id-D (Ws-Idx) > 0  06840099
                                 Perform G300-Delete-Related-Party      06850099
                                 Move RTFCE110-I-Customer-Id-D (Ws-Idx) 06860099
                                                 To R115IRP0-Customer-Id06870099
                                 Perform G200-Insert-Related-Party      06880099
      *  18.09.03 We insert new BENEF in field 79 in MT707 when amend   06890099
112018*  14.08.18 Felt 79 i MT707 skal bort.                            06891099
112018*                          If   RTFCE110-I-Type-D (Ws-Idx) =      06900099
112018*                                                        'BENEF'  06910099
112018*                          And (RTFCE110-I-Operation-Type-D =     06920099
112018*                                                'AMEND-ILC-MAIN' 06930099
112018*                          OR   RTFCE110-I-Operation-Type-D =     06940099
112018*                                              'AMEND-ELC-MAIN' ) 06950099
112018*                              Perform I400-Insert-Field79-MT707  06960099
112018*                          End-If                                 06970099
                              Else                                      06980099
      *                       - We change part                          06990099
                                 Perform G100-Update-Related-Party      07000099
                              End-If                                    07010099
                           End-Evaluate                                 07020099
                       End-If                                           07030099
      **********                                                        07040099
      *            The party does not exist. We create it.              07050099
                   When Other                                           07060099
      *            R7919999-Return-Error                                07070099
                       If  RTFCE110-I-Custm-Type-I (Ws-Idx) = 'U'       07080099
                       And  RTFCE110-I-Custm-Type-D (Ws-Idx) = 'T'      07090099
      *                or   RTFCE110-I-Custm-Type-D (Ws-Idx) = 'B'      07100099
                           Perform G200-Insert-Related-Party            07110099
                           If RTFCE110-I-Custm-Type-D (Ws-Idx) = 'T'    07120099
                              Perform G800-Insert-Tast-Part             07130099
                           End-If                                       07140099
      *  18.09.03 We insert new BENEF in field 79 in MT707 when amend   07150099
112018*  14.08.18 Felt 79 i MT707 skal bort.                            07151099
112018*                    If   RTFCE110-I-Type-D (Ws-Idx) =  'BENEF'   07160099
112018*                    And (RTFCE110-I-Operation-Type-D =           07170099
112018*                                                'AMEND-ILC-MAIN' 07180099
112018*                    OR   RTFCE110-I-Operation-Type-D =           07190099
112018*                                              'AMEND-ELC-MAIN' ) 07200099
112018*                        Perform I400-Insert-Field79-MT707        07210099
112018*                    End-If                                       07220099
                       Else                                             07230099
                           Move  'F'         To                         07240099
                                       RTFCE110-I-Customer-Id-O (Ws-Idx)07250099
                           Move  'FELT1'    To R400CH01-Message-Key(1)  07260099
                           Move  'Kunde-Id' To R400CH01-Message-Data(1) 07270099
                           Move  'GL-MISSING-FIELD&'                    07280099
                                         To    R400CH01-Message-Code    07290099
                           Perform  Z700-Error-AE                       07300099
                       End-If                                           07310099
                   End-Evaluate                                         07320099
               End-Evaluate                                             07330099
      *                                                                 07340099
      * nl 25.10.01 References must be unique                           07350099
      *        O-Bank's reference must be unique.                       07360099
      *                                                                 07370099
               If   RTFCE110-I-Type-I (Ws-Idx)       = 'U'              07380099
               And RTFCE110-I-Type-D (Ws-Idx)       = 'REMIT'           07390099
               And RTFCE110-I-Selected-I (Ws-Idx)   = 'U'               07400099
               And RTFCE110-I-Selected-D (Ws-Idx)   = 'Y'               07410099
               And RTFCE110-I-Operation-Type-D      = 'REGISTER'        07420099
               And RTFCE110-I-Reference-I (Ws-Idx)  = 'U'               07430099
                   Move 'REMIT'          To    Ws-Role-Type             07440099
                   Perform H600-Read-All-Related-Party                  07450099
               End-If                                                   07460099
                                                                        07470099
      *                                                                 07480099
      *        Issuing bank's reference must be unique.                 07490099
      *                                                                 07500099
               If   RTFCE110-I-Type-I (Ws-Idx)       = 'U'              07510099
               And RTFCE110-I-Type-D (Ws-Idx)       = 'ISSUI'           07520099
               And RTFCE110-I-Selected-I (Ws-Idx)   = 'U'               07530099
               And RTFCE110-I-Selected-D (Ws-Idx)   = 'Y'               07540099
               And RTFCE110-I-Operation-Type-D      = 'ADVICE'          07550099
               And RTFCE110-I-Reference-I (Ws-Idx)  = 'U'               07560099
                   Move 'ISSUI'          To    Ws-Role-Type             07570099
                   Perform H600-Read-All-Related-Party                  07580099
               End-If                                                   07590099
      *                                                                 07600099
               Add 1                     To    Ws-Idx                   07610099
           End-Perform                                                  07620099
      *                                                                 07630099
      *  The customer-id of the contract's owner is registered          07640099
      *  in Main_Contract.                                              07650099
      *                                                                 07660099
           If  RTFCE110-I-Operation-Type-D = 'REGISTER'                 07670099
           Or  RTFCE110-I-Operation-Type-D = 'ISSUE'                    07680099
           Or  RTFCE110-I-Operation-Type-D = 'ADVICE'                   07690099
           Or  RTFCE110-I-Operation-Type-D = 'ISSUE-GAR'                07691099
               Perform G030-Change-Main-Contract                        07700099
           End-If                                                       07710099
      *                                                                 07720099
      *  Set new timestamp and fill out output fields.                  07730099
      *                                                                 07740099
           Perform G400-Set-Timestamp                                   07750099
           Set  Wb-In-Actual             To    True                     07760099
           Perform H200-Read-Main-Contract                              07770099
           Perform U000-Out-Fields                                      07780099
      *                                                                 07790099
           .                                                            07800099
      *                                                                 07810099
       G000-Update-Ex.                                                  07820099
           Exit.                                                        07830099
                                                                        07840099
      *################################################################*07850099
       G030-Change-Main-Contract         Section.                       07860099
      *                                                                 07870099
           Move  +1                      To    Ws-Idx                   07880099
           Set   Wb-Remit-Not-Found      To    True                     07890099
           Set   Wb-Drwer-Not-Found      To    True                     07900099
      *                                                                 07910099
           Perform Until Ws-Idx > Ws-Max-Occ-Item-Tab                   07920099
                                                                        07930099
               If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 07940099
               And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 07950099
               And RTFCE110-I-Type-D (Ws-Idx) = 'CUSTM'                 07960099
               And RTFCE110-I-Operation-Type-D = 'ISSUE'                07970099
                   Set  Wb-In-Work       To    True                     07980099
                   Perform H200-Read-Main-Contract                      07990099
                   If  RTFCE110-I-Customer-Id-I  (Ws-Idx) = 'U'         08000099
                       Move  RTFCE110-I-Customer-Id-D  (Ws-Idx)         08010099
                                         To    Ws-Cust-Id               08020099
                   Else                                                 08030099
                       Move  0           To    Ws-Cust-Id               08040099
                   End-If                                               08050099
                   Perform G500-Update-Main-Contract                    08060099
               End-If                                                   08070099
      *                                                                 08071099
               If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 08072099
               And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 08073099
               And RTFCE110-I-Type-D (Ws-Idx)  = 'CUSTM'                08074099
               And RTFCE110-I-Contract-Type-D  = 'ILG'                  08074199
               And RTFCE110-I-Operation-Type-D = 'ISSUE-GAR'            08075099
                   Set  Wb-In-Work       To    True                     08076099
                   Perform H200-Read-Main-Contract                      08077099
                   If  RTFCE110-I-Customer-Id-I  (Ws-Idx) = 'U'         08078099
                       Move  RTFCE110-I-Customer-Id-D  (Ws-Idx)         08079099
                                         To    Ws-Cust-Id               08079199
                   Else                                                 08079299
                       Move  0           To    Ws-Cust-Id               08079399
                   End-If                                               08079499
                   Perform G500-Update-Main-Contract                    08079599
               End-If                                                   08079699
      *                                                                 08079799
               If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 08079899
               And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 08079999
               And RTFCE110-I-Type-D (Ws-Idx)  = 'ISSUI'                08080099
               And RTFCE110-I-Contract-Type-D  = 'ELG'                  08080199
               And RTFCE110-I-Operation-Type-D = 'ISSUE-GAR'            08080299
                   Set  Wb-In-Work       To    True                     08080399
                   Perform H200-Read-Main-Contract                      08080499
                   If  RTFCE110-I-Customer-Id-I  (Ws-Idx) = 'U'         08080599
                       Move  RTFCE110-I-Customer-Id-D  (Ws-Idx)         08080699
                                         To    Ws-Cust-Id               08080799
                   Else                                                 08080899
                       Move  0           To    Ws-Cust-Id               08080999
                   End-If                                               08081099
                   Perform G500-Update-Main-Contract                    08081199
               End-If                                                   08081299
      *                                                                 08082099
               If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 08090099
               And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 08100099
               And RTFCE110-I-Type-D (Ws-Idx) = 'ISSUI'                 08110099
               And RTFCE110-I-Operation-Type-D = 'ADVICE'               08120099
                   Set  Wb-In-Work       To    True                     08130099
                   If  RTFCE110-I-Customer-Id-I  (Ws-Idx) = 'U'         08140099
                       Move  RTFCE110-I-Customer-Id-D  (Ws-Idx)         08150099
                                         To    Ws-Cust-Id               08160099
                   Else                                                 08170099
                       Move  0           To    Ws-Cust-Id               08180099
                   End-If                                               08190099
                   Perform H200-Read-Main-Contract                      08200099
                   Perform G500-Update-Main-Contract                    08210099
               End-If                                                   08220099
                                                                        08230099
      *                                                                 08240099
               If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 08250099
               And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 08260099
               And RTFCE110-I-Type-D (Ws-Idx) = 'DRWEE'                 08270099
               And RTFCE110-I-Operation-Type-D = 'REGISTER'             08280099
               And (RTFCE110-I-Contract-Type-D      = 'IDP'             08290099
               Or   RTFCE110-I-Contract-Type-D      = 'IDA'             08300099
               Or   RTFCE110-I-Contract-Type-D      = 'ICP'             08310099
               Or   RTFCE110-I-Contract-Type-D      = 'ICA')            08320099
                   Set  Wb-In-Work       To    True                     08330099
                   If  RTFCE110-I-Customer-Id-I  (Ws-Idx) = 'U'         08340099
                       Move  RTFCE110-I-Customer-Id-D  (Ws-Idx)         08350099
                                         To    Ws-Cust-Id               08360099
                   Else                                                 08370099
                       Move  0           To    Ws-Cust-Id               08380099
                   End-If                                               08390099
                   Perform H200-Read-Main-Contract                      08400099
                   Perform G500-Update-Main-Contract                    08410099
               End-If                                                   08420099
      *                                                                 08430099
               If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 08440099
               And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 08450099
               And RTFCE110-I-Type-D (Ws-Idx) = 'DRWER'                 08460099
               And RTFCE110-I-Operation-Type-D = 'REGISTER'             08470099
               And (RTFCE110-I-Contract-Type-D      = 'EDP'             08480099
               Or   RTFCE110-I-Contract-Type-D      = 'EDA'             08490099
               Or   RTFCE110-I-Contract-Type-D      = 'ECP'             08500099
               Or   RTFCE110-I-Contract-Type-D      = 'ECA')            08510099
                   Set  Wb-In-Work       To    True                     08520099
                   If  RTFCE110-I-Customer-Id-I  (Ws-Idx) = 'U'         08530099
                       Move  RTFCE110-I-Customer-Id-D  (Ws-Idx)         08540099
                                         To    Ws-Cust-Id               08550099
                   Else                                                 08560099
                       Move  0           To    Ws-Cust-Id               08570099
                   End-If                                               08580099
                   Perform H200-Read-Main-Contract                      08590099
                   Perform G500-Update-Main-Contract                    08600099
               End-If                                                   08610099
                                                                        08620099
      *        If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 08630099
      *        And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 08640099
      *        And RTFCE110-I-Type-D (Ws-Idx) = 'DRWER'                 08650099
      *        And RTFCE110-I-Operation-Type-D = 'REGISTER'             08660099
      *            Set  Wb-Drwer-Found   To    True                     08670099
      *            Move  Ws-Idx          To    Ws-Idx-D                 08680099
      *        End-If                                                   08690099
      *                                                                 08700099
      *        Add 1                     To    Ws-Idx                   08710099
      *                                                                 08720099
      *        If  RTFCE110-I-Selected-I (Ws-Idx) = 'U'                 08730099
      *        And RTFCE110-I-Selected-D (Ws-Idx) = 'Y'                 08740099
      *        And RTFCE110-I-Type-D (Ws-Idx) = 'REMIT'                 08750099
      *        And RTFCE110-I-Operation-Type-D = 'REGISTER'             08760099
      *            Set  Wb-Remit-Found   To    True                     08770099
      *            Move  Ws-Idx          To    Ws-Idx-R                 08780099
      *        End-If                                                   08790099
      *                                                                 08800099
               Add 1                     To    Ws-Idx                   08810099
           End-Perform                                                  08820099
      *                                                                 08830099
      *    Evaluate True                                                08840099
      *      When Wb-Remit-Found                                        08850099
      *       And Wb-Drwer-Found                                        08860099
      *        If  RTFCE110-I-Customer-Id-I  (Ws-Idx-R) = 'U'           08870099
      *            Set  Wb-In-Work       To    True                     08880099
      *            If  RTFCE110-I-Customer-Id-I  (Ws-Idx-R) = 'U'       08890099
      *                Move  RTFCE110-I-Customer-Id-D  (Ws-Idx-R)       08900099
      *                                  To    Ws-Cust-Id               08910099
      *            Else                                                 08920099
      *                Move  0           To    Ws-Cust-Id               08930099
      *            End-If                                               08940099
      *            Perform H200-Read-Main-Contract                      08950099
      *            Perform G500-Update-Main-Contract                    08960099
      *        Else                                                     08970099
      *            If  RTFCE110-I-Customer-Id-I  (Ws-Idx-D) = 'U'       08980099
      *                Move  RTFCE110-I-Customer-Id-D  (Ws-Idx-D)       08990099
      *                                  To    Ws-Cust-Id               09000099
      *            Else                                                 09010099
      *                Move  0           To    Ws-Cust-Id               09020099
      *            End-If                                               09030099
      *            Set  Wb-In-Work       To    True                     09040099
      *            Perform H200-Read-Main-Contract                      09050099
      *            Perform G500-Update-Main-Contract                    09060099
      *        End-If                                                   09070099
      *                                                                 09080099
      *      When Wb-Remit-Found                                        09090099
      *       And Wb-Drwer-Not-Found                                    09100099
      *        If  RTFCE110-I-Customer-Id-I  (Ws-Idx-R) = 'U'           09110099
      *            If  RTFCE110-I-Customer-Id-I  (Ws-Idx-R) = 'U'       09120099
      *                Move  RTFCE110-I-Customer-Id-D  (Ws-Idx-R)       09130099
      *                                  To    Ws-Cust-Id               09140099
      *            Else                                                 09150099
      *                Move  0           To    Ws-Cust-Id               09160099
      *            End-If                                               09170099
      *            Set  Wb-In-Work       To    True                     09180099
      *            Perform H200-Read-Main-Contract                      09190099
      *            Perform G500-Update-Main-Contract                    09200099
      *        Else                                                     09210099
      *            Move  'DRWER'         To    Ws-Role-Type             09220099
      *            Perform  H100-Read-Related-Party                     09230099
      *            If  R7919999-Return-OK                               09240099
      *                Move  R115IRP0-Customer-Id                       09250099
      *                                  To    Ws-Cust-Id               09260099
      *                Set  Wb-In-Work   To    True                     09270099
      *                Perform H200-Read-Main-Contract                  09280099
      *                Perform G500-Update-Main-Contract                09290099
      *            End-If                                               09300099
      *        End-If                                                   09310099
      *                                                                 09320099
      *      When Wb-Drwer-Found                                        09330099
      *       And Wb-Remit-Not-Found                                    09340099
      *        If  RTFCE110-I-Customer-Id-I  (Ws-Idx-D) = 'U'           09350099
      *            Move  RTFCE110-I-Customer-Id-D  (Ws-Idx-D)           09360099
      *                                  To    Ws-Cust-Id               09370099
      *        Else                                                     09380099
      *            Move  0               To    Ws-Cust-Id               09390099
      *        End-If                                                   09400099
      *        Move  'REMIT'             To    Ws-Role-Type             09410099
      *        Perform  H100-Read-Related-Party                         09420099
      *        If  R7919999-Return-Error                                09430099
      *            Set  Wb-In-Work       To    True                     09440099
      *            Perform  H200-Read-Main-Contract                     09450099
      *            Perform  G500-Update-Main-Contract                   09460099
      *        End-If                                                   09470099
      *    End-Evaluate                                                 09480099
      *                                                                 09490099
           .                                                            09500099
      *                                                                 09510099
       G030-Change-Main-Contract-Ex.                                    09520099
           Exit.                                                        09530099
      *################################################################*09540099
       G100-Update-Related-Party         Section.                       09550099
      *                                                                 09560099
           Set   R115IRP0-In-Update      To    True                     09570099
      *                                                                 09580099
           If  RTFCE110-I-Customer-Id-I (Ws-Idx)  = 'U'                 09590099
               Move RTFCE110-I-Customer-Id-D (Ws-Idx)                   09600099
                                         To    R115IRP0-Customer-Id     09610099
           End-If                                                       09620099
      *                                                                 09630099
           If  RTFCE110-I-Reference-I (Ws-Idx)  = 'U'                   09640099
               Move RTFCE110-I-Reference-D (Ws-Idx)                     09650099
                                         To    R115IRP0-Reference       09660099
           Else                                                         09670099
               Move Spaces               To    R115IRP0-Reference       09680099
           End-If                                                       09690099
      *                                                                 09700099
           If  RTFCE110-I-Account-No-1-I (Ws-Idx)  = 'U'                09710099
               Move RTFCE110-I-Account-No-1-D (Ws-Idx)                  09720099
                                         To    R115IRP0-Account         09730099
           Else                                                         09740099
               Move Spaces               To    R115IRP0-Account         09750099
           End-If                                                       09760099
      *                                                                 09770099
           If  RTFCE110-I-Account-No-2-I (Ws-Idx)  = 'U'                09780099
               Move RTFCE110-I-Account-No-2-D (Ws-Idx)                  09790099
                                         To    R115IRP0-Account-2       09800099
           Else                                                         09810099
               Move Spaces               To    R115IRP0-Account-2       09820099
           End-If                                                       09830099
      *                                                                 09840099
      *    If  RTFCE110-I-Bic-Swift-I (Ws-Idx)  = 'U'                   09850099
      *    And RTFCE110-I-Custm-Type-I (Ws-Idx) = 'U'                   09860099
      *    And RTFCE110-I-Custm-Type-D (Ws-Idx) = 'B'                   09870099
      *        Move  RTFCE110-I-Bic-Swift-D (Ws-Idx)                    09880099
      *                                  To    R115IRP0-Bic-Code        09890099
      *    Else                                                         09900099
      * lg     Move Spaces               To    R115IRP0-Bic-Code        09910099
      *    End-If                                                       09920099
      *                                                                 09930099
           Call  'F115IRP0'              Using R115IRP0-Related-Party   09940099
                                               R7919999-Error-Area      09950099
           End-Call                                                     09960099
      *                                                                 09970099
           Evaluate True                                                09980099
             When R7919999-Return-Abend                                 09990099
               Move  'G101'              To    R7919999-Paragraph       10000099
               Move  'FM'                To    R400CH01-Message-Code    10010099
               Perform Z900-Abend                                       10020099
                                                                        10030099
             When R7919999-Return-Error                                 10040099
               Move  'G102'              To    R7919999-Paragraph       10050099
               Move  'FM'                To    R400CH01-Message-Code    10060099
               Perform Z900-Abend                                       10070099
                                                                        10080099
             When Other                                                 10090099
               Continue                                                 10100099
           End-Evaluate                                                 10110099
      *                                                                 10120099
           .                                                            10130099
      *                                                                 10140099
       G100-Update-Related-Party-Ex.                                    10150099
           Exit.                                                        10160099
      *################################################################*10170099
       G200-Insert-Related-Party         Section.                       10180099
      *                                                                 10190099
           Initialize                          R115IRP0-Related-Party   10200099
           Set   R115IRP0-Version        To    True                     10210099
           Set   R115IRP0-In-Work        To    True                     10220099
      *                                                                 10230099
           Set   R115IRP0-In-Insert      To    True                     10240099
      *                                                                 10250099
           Move  RTFCE110-I-Fin-Inst-No-D                               10260099
                                         To    R115IRP0-Fin-Inst-No     10270099
           Move  RTFCE110-I-Contract-Type-D                             10280099
                                         To    R115IRP0-Contract-Type   10290099
           Move  RTFCE110-I-Contract-No-D                               10300099
                                         To    R115IRP0-Contract-No     10310099
           Move  RTFCE110-I-Type-D (Ws-Idx)                             10320099
                                         To    R115IRP0-Role-Type       10330099
      *                                                                 10340099
           If  RTFCE110-I-Part-Amount-No-I Not = 'U'                    10350099
               Set  R115IRP0-In-Rel-MC   To    True                     10360099
           Else                                                         10370099
               Set  R115IRP0-In-Rel-PA   To    True                     10380099
               Move RTFCE110-I-Part-Amount-No-D                         10390099
                                         To    R115IRP0-PA-Seq-No       10400099
               Move Ws-Currency          To    R115IRP0-CA-Currency     10410099
           End-If                                                       10420099
      *                                                                 10430099
           If  RTFCE110-I-Customer-Id-I (Ws-Idx) Not = 'U'              10440099
               Move  +0                  To    R115IRP0-Customer-ID     10450099
      *        Move  'F'                 To                             10460099
      *                                RTFCE110-I-Customer-Id-O (Ws-Idx)10470099
      *        Move  'FELT1'             To    R400CH01-Message-Key(1)  10480099
      *        Move  'Kunde-Id'          To    R400CH01-Message-Data(1) 10490099
      *        Move  'GL-MISSING-FIELD&' To    R400CH01-Message-Code    10500099
      *        Perform  Z700-Error-AE                                   10510099
           Else                                                         10520099
               Move  RTFCE110-I-Customer-Id-D (Ws-Idx)                  10530099
                                         To    R115IRP0-Customer-ID     10540099
           End-If                                                       10550099
      *                                                                 10560099
           If  RTFCE110-I-Account-No-1-I (Ws-Idx)  = 'U'                10570099
               Move  RTFCE110-I-Account-No-1-D (Ws-Idx)                 10580099
                                         To    R115IRP0-Account         10590099
           End-If                                                       10600099
      *                                                                 10610099
           If  RTFCE110-I-Account-No-2-I (Ws-Idx) = 'U'                 10620099
               Move  RTFCE110-I-Account-No-2-D (Ws-Idx)                 10630099
                                         To    R115IRP0-Account-2       10640099
           End-If                                                       10650099
      *                                                                 10660099
           If  RTFCE110-I-Reference-I (Ws-Idx) = 'U'                    10670099
               Move  RTFCE110-I-Reference-D (Ws-Idx)                    10680099
                                         To    R115IRP0-Reference       10690099
           End-If                                                       10700099
      *                                                                 10710099
      *    If  RTFCE110-I-Bic-Swift-I (Ws-Idx) = 'U'                    10720099
      *    And RTFCE110-I-Custm-Type-I (Ws-Idx) = 'U'                   10730099
      *    And RTFCE110-I-Custm-Type-D (Ws-Idx) = 'B'                   10740099
      *        Move  RTFCE110-I-Bic-Swift-D (Ws-Idx)                    10750099
      *                                  To    R115IRP0-Bic-Code        10760099
      *    End-If                                                       10770099
      *                                                                 10780099
                                                                        10790099
           Call  'F115IRP0'              Using R115IRP0-Related-Party   10800099
                                               R7919999-Error-Area      10810099
           End-Call                                                     10820099
      *                                                                 10830099
           Evaluate True                                                10840099
             When R7919999-Return-Abend                                 10850099
               Move  'G201'              To    R7919999-Paragraph       10860099
               Move  'FM'                To    R400CH01-Message-Code    10870099
               Perform Z900-Abend                                       10880099
                                                                        10890099
             When R7919999-Return-Error                                 10900099
               Move  'G202'              To    R7919999-Paragraph       10910099
               Move  'FM'                To    R400CH01-Message-Code    10920099
               Perform Z900-Abend                                       10930099
                                                                        10940099
             When Other                                                 10950099
               Continue                                                 10960099
           End-Evaluate                                                 10970099
      *                                                                 10980099
      *    Legger inn alle parter (unntatt tasteparter) i TF-Customer   10990099
      *    22.01.2001.                                                  11000099
           If  R115IRP0-Customer-ID > 0                                 11010099
               Perform G210-Read-TF-Customer                            11020099
                                                                        11030099
               If  R7919999-Return-Error                                11040099
                   Set R7919999-Return-OK To   True                     11050099
                   Perform I200-Read-KF-Customer                        11060099
                   Perform G220-Insert-TF-Customer                      11070099
               End-If                                                   11080099
           End-If                                                       11090099
      *                                                                 11100099
           .                                                            11110099
      *                                                                 11120099
       G200-Insert-Related-Party-Ex.                                    11130099
           Exit.                                                        11140099
      *################################################################*11150099
       G210-Read-TF-Customer             Section.                       11160099
      *                                                                 11170099
      *                                                                 11180099
           Initialize                    R115ICU0-Customer              11190099
      *                                                                 11200099
           Set   R115ICU0-In-Select      To    True                     11210099
           Set   R115ICU0-Version        To    True                     11220099
      *                                                                 11230099
           Move  RTFCE110-I-Fin-Inst-No-D                               11240099
                                         To    R115ICU0-In-Fin-Inst-No  11250099
           Move  R115IRP0-Customer-ID    To    R115ICU0-In-Customer-ID  11260099
      *                                                                 11270099
           Call  'F115ICU0'              Using R115ICU0-Customer        11280099
                                               R7919999-Error-Area      11290099
           End-Call                                                     11300099
      *                                                                 11310099
      *                                                                 11320099
           Evaluate True                                                11330099
             When R7919999-Return-Abend                                 11340099
               Move  'G211'              To    R7919999-Paragraph       11350099
               Move  'FM'                To    R400CH01-Message-Code    11360099
               Perform Z900-Abend                                       11370099
                                                                        11380099
             When Other                                                 11390099
               Continue                                                 11400099
           End-Evaluate                                                 11410099
      *                                                                 11420099
           .                                                            11430099
      *                                                                 11440099
       G210-Read-TF-Customer-Ex.                                        11450099
           Exit.                                                        11460099
      *################################################################*11470099
       G220-Insert-TF-Customer           Section.                       11480099
      *                                                                 11490099
      *                                                                 11500099
           Initialize                    R115ICU0-Customer              11510099
      *                                                                 11520099
           Set   R115ICU0-In-Insert      To    True                     11530099
           Set   R115ICU0-Version        To    True                     11540099
      *                                                                 11550099
           Move  RTFCE110-I-Fin-Inst-No-D                               11560099
                                         To    R115ICU0-Fin-Inst-No     11570099
           Move  R115IRP0-Customer-ID    To    R115ICU0-Customer-ID     11580099
      *                                                                 11590099
           If    R728IXL0-KU-Type-Person                                11600099
               Move  R728IXL0-PK-Pers-Fornavn                           11610099
                                         To    R115ICU0-FirstName       11620099
               Move  R728IXL0-PK-Pers-Etternavn                         11630099
                                         To    R115ICU0-Surname         11640099
           Else                                                         11650099
               Move  Spaces              To    R115ICU0-FirstName       11660099
               Move  R728IXL0-NK-Naer-Firmanavn                         11670099
                                         To    R115ICU0-Surname         11680099
           End-If                                                       11690099
      ******************                                                11700099
      * Endrer til store bokstaver                                      11710099
           Initialize                          R7919340-Bokstav-Type    11720099
           Set   R7919340-Versjon        To    True                     11730099
           Move  R115ICU0-Surname(1:15)  To    R7919340-In-Tekst        11740099
           Set   R7919340-In-Store-Bokstaver                            11750099
                                         To    True                     11760099
           Perform I300-Call-F7919340                                   11770099
           Move  R7919340-Ut-Tekst       To    R115ICU0-Id-Surname      11780099
      *                                                                 11790099
      *    Move  Ws-Bic-Code             To    R115ICU0-Bic-Code        11800099
           Initialize                          R7919340-Bokstav-Type    11810099
           Set   R7919340-Versjon        To    True                     11820099
           Move  Ws-Bic-Code             To    R7919340-In-Tekst        11830099
           Set   R7919340-In-Store-Bokstaver                            11840099
                                         To    True                     11850099
           Perform I300-Call-F7919340                                   11860099
           Move  R7919340-Ut-Tekst       To    R115ICU0-Bic-Code        11870099
      *                                                                 11880099
      *    Move  R728IXL0-AD-Land-Kode   To    R115ICU0-Country-Code    11890099
           Initialize                          R7919340-Bokstav-Type    11900099
           Set   R7919340-Versjon        To    True                     11910099
           Move  R728IXL0-AD-Land-Kode   To    R7919340-In-Tekst        11920099
           Set   R7919340-In-Store-Bokstaver                            11930099
                                         To    True                     11940099
           Perform I300-Call-F7919340                                   11950099
           Move  R7919340-Ut-Tekst       To    R115ICU0-Country-Code    11960099
      *********************                                             11970099
           Move  R728IXL0-AD-Linje-1     To    R115ICU0-Address-1       11980099
           Move  R728IXL0-AD-Linje-2     To    R115ICU0-Address-2       11990099
           Move  R728IXL0-AD-Linje-3     To    R115ICU0-Address-3       12000099
           Move  R728IXL0-AD-Linje-4     To    R115ICU0-Address-4       12010099
      *                                                                 12020099
           Move  R728IXL0-AD-Geo-Kode    To    R115ICU0-Geo-Code        12030099
           Move  R728IXL0-KU-Sektor-Kode To    R115ICU0-Sector-Code     12040099
      *                                                                 12050099
           Move  R728IXL0-AD-Post-Nummer                                12060099
                                         To    R115ICU0-Postal-Code     12070099
           Move  R728IXL0-AD-Post-Sted   To    R115ICU0-Destination     12080099
      *                                                                 12090099
           Call  'F115ICU0'              Using R115ICU0-Customer        12100099
                                               R7919999-Error-Area      12110099
           End-Call                                                     12120099
      *                                                                 12130099
      *                                                                 12140099
           Evaluate True                                                12150099
             When R7919999-Return-Abend                                 12160099
               Move  'G221'              To    R7919999-Paragraph       12170099
               Move  'FM'                To    R400CH01-Message-Code    12180099
               Perform Z900-Abend                                       12190099
                                                                        12200099
             When R7919999-Return-Error                                 12210099
               Move  'G222'              To    R7919999-Paragraph       12220099
               Move  'FM'                To    R400CH01-Message-Code    12230099
               Perform Z700-Error-AE                                    12240099
                                                                        12250099
             When Other                                                 12260099
               Continue                                                 12270099
           End-Evaluate                                                 12280099
      *                                                                 12290099
           .                                                            12300099
      *                                                                 12310099
       G220-Insert-TF-Customer-Ex.                                      12320099
           Exit.                                                        12330099
      *################################################################*12340099
       G250-Insert-Related-Party         Section.                       12350099
      *                                                                 12360099
           Set   R115IRP0-In-Insert      To    True                     12370099
      *                                                                 12380099
           If  RTFCE110-I-Part-Amount-No-I Not = 'U'                    12390099
               Set  R115IRP0-In-Rel-MC   To    True                     12400099
           Else                                                         12410099
               Set  R115IRP0-In-Rel-PA   To    True                     12420099
               Move RTFCE110-I-Part-Amount-No-D                         12430099
                                         To    R115IRP0-PA-Seq-No       12440099
               Move Ws-Currency          To    R115IRP0-CA-Currency     12450099
           End-If                                                       12460099
      *                                                                 12470099
           If  RTFCE110-I-Account-No-1-I (Ws-Idx)  = 'U'                12480099
               Move  RTFCE110-I-Account-No-1-D (Ws-Idx)                 12490099
                                         To    R115IRP0-Account         12500099
           End-If                                                       12510099
      *                                                                 12520099
           If  RTFCE110-I-Account-No-2-I (Ws-Idx) = 'U'                 12530099
               Move  RTFCE110-I-Account-No-2-D (Ws-Idx)                 12540099
                                         To    R115IRP0-Account-2       12550099
           End-If                                                       12560099
      *                                                                 12570099
           If  RTFCE110-I-Reference-I (Ws-Idx) = 'U'                    12580099
               Move  RTFCE110-I-Reference-D (Ws-Idx)                    12590099
                                         To    R115IRP0-Reference       12600099
           End-If                                                       12610099
      *                                                                 12620099
      *    If  RTFCE110-I-Bic-Swift-I (Ws-Idx) = 'U'                    12630099
      *    And RTFCE110-I-Custm-Type-I (Ws-Idx) = 'U'                   12640099
      *    And RTFCE110-I-Custm-Type-D (Ws-Idx) = 'B'                   12650099
      *        Move  RTFCE110-I-Bic-Swift-D (Ws-Idx)                    12660099
      *                                  To    R115IRP0-Bic-Code        12670099
      *    End-If                                                       12680099
      *                                                                 12690099
           Call  'F115IRP0'              Using R115IRP0-Related-Party   12700099
                                               R7919999-Error-Area      12710099
           End-Call                                                     12720099
      *                                                                 12730099
           Evaluate True                                                12740099
             When R7919999-Return-Abend                                 12750099
               Move  'G251'              To    R7919999-Paragraph       12760099
               Move  'FM'                To    R400CH01-Message-Code    12770099
               Perform Z900-Abend                                       12780099
                                                                        12790099
             When R7919999-Return-Error                                 12800099
               Move  'G252'              To    R7919999-Paragraph       12810099
               Move  'FM'                To    R400CH01-Message-Code    12820099
               Perform Z900-Abend                                       12830099
                                                                        12840099
             When Other                                                 12850099
               Continue                                                 12860099
           End-Evaluate                                                 12870099
      *                                                                 12880099
           .                                                            12890099
      *                                                                 12900099
       G250-Insert-Related-Party-Ex.                                    12910099
           Exit.                                                        12920099
      *################################################################*12930099
       G300-Delete-Related-Party         Section.                       12940099
      *                                                                 12950099
           Set   R115IRP0-In-Delete      To    True                     12960099
      *                                                                 12970099
           Call  'F115IRP0'              Using R115IRP0-Related-Party   12980099
                                               R7919999-Error-Area      12990099
           End-Call                                                     13000099
      *                                                                 13010099
           Evaluate True                                                13020099
             When R7919999-Return-Abend                                 13030099
               Move  'G301'              To    R7919999-Paragraph       13040099
               Move  'FM'                To    R400CH01-Message-Code    13050099
               Perform Z900-Abend                                       13060099
                                                                        13070099
             When R7919999-Return-Error                                 13080099
               Move  'G302'              To    R7919999-Paragraph       13090099
               Move  'FM'                To    R400CH01-Message-Code    13100099
               Perform Z900-Abend                                       13110099
                                                                        13120099
             When Other                                                 13130099
               Continue                                                 13140099
           End-Evaluate                                                 13150099
      *                                                                 13160099
      *    We also delete tast-part if it exists                        13170099
      *                                                                 13180099
           If  R115IRP0-Customer-Id = 0                                 13190099
               Perform H500-Read-Tast-Part                              13200099
      *                                                                 13210099
               If  R7919999-Return-OK                                   13220099
                   Perform G900-Delete-Tast-Part                        13230099
               End-If                                                   13240099
           End-If                                                       13250099
           .                                                            13260099
      *                                                                 13270099
       G300-Delete-Related-Party-Ex.                                    13280099
           Exit.                                                        13290099
      *################################################################*13300099
       G400-Set-Timestamp                Section.                       13310099
      *                                                                 13320099
           Initialize                          R115L030-Set-Timestamp   13330099
           Set   R115L030-Version        To    True                     13340099
      *                                                                 13350099
           Move  RTFCE110-I-Fin-Inst-No-D                               13360099
                                         To    R115L030-Fin-Inst-No     13370099
           Move  RTFCE110-I-Contract-Type-D                             13380099
                                         To    R115L030-Contract-Type   13390099
           Move  RTFCE110-I-Contract-No-D                               13400099
                                         To    R115L030-Contract-No     13410099
           If RTFCE110-I-Part-Amount-No-I = 'U'                         13420099
              Move R115ICA0-Currency     To    R115L030-CA-Currency     13430099
              Move RTFCE110-I-Part-Amount-No-D                          13440099
                                         To    R115L030-PA-Seq-No       13450099
           End-If                                                       13460099
           Move  R400CH01-Function       To    R115L030-Function        13470099
           Move  R400CH01-Medium         To    R115L030-Medium          13480099
           Move  R400CH01-Exec-Date      To    R115L030-Exec-Date       13490099
           Move  R400CH01-System-Date    To    R115L030-System-Date     13500099
           Move  R400CH01-System-Time    To    R115L030-System-Time     13510099
           Move  R400CH01-Userid         To    R115L030-Userid          13520099
      *                                                                 13530099
           Set   R115L030-Set-Status     To    True                     13540099
           Move  R115ISR0-To-SC-Code     To    R115L030-Status          13550099
      *                                                                 13560099
           Call  'F115L030'              Using R115L030-Set-Timestamp   13570099
                                               R7919999-Error-Area      13580099
           End-Call                                                     13590099
      *                                                                 13600099
           Evaluate True                                                13610099
             When R7919999-Return-Abend                                 13620099
               Move  'G401'              To    R7919999-Paragraph       13630099
               Move  'FM'                To    R400CH01-Message-Code    13640099
               Perform Z900-Abend                                       13650099
                                                                        13660099
             When R7919999-Return-Error                                 13670099
               Move  'G402'              To    R7919999-Paragraph       13680099
               Move  'FM'                To    R400CH01-Message-Code    13690099
               Perform Z700-Error-AE                                    13700099
           End-Evaluate                                                 13710099
      *                                                                 13720099
           .                                                            13730099
      *                                                                 13740099
       G400-Set-Timestamp-Ex.                                           13750099
           Exit.                                                        13760099
      *################################################################*13770099
       G500-Update-Main-Contract         Section.                       13780099
      *                                                                 13790099
           Set   R115IMC0-In-Update      To    True                     13800099
      *                                                                 13810099
           Move  Ws-Cust-Id              To    R115IMC0-Customer-Id     13820099
      *                                                                 13830099
           Call  'F115IMC0'              Using R115IMC0-Main-Contract   13840099
                                               R7919999-Error           13850099
           End-Call                                                     13860099
      *                                                                 13870099
           Evaluate True                                                13880099
             When R7919999-Retur-Abend                                  13890099
               Move  'G501'              To    R7919999-Paragraf        13900099
               Move  'FM'                To    R400CH01-Message-Code    13910099
               Perform Z900-Abend                                       13920099
                                                                        13930099
             When R7919999-Retur-Feil                                   13940099
               Move  'G502'              To    R7919999-Paragraf        13950099
               Move  'FM'                To    R400CH01-Message-Code    13960099
               Perform Z900-Abend                                       13970099
           End-Evaluate                                                 13980099
      *                                                                 13990099
           .                                                            14000099
      *                                                                 14010099
       G500-Update-Main-Contract-Ex.                                    14020099
           Exit.                                                        14030099
      *################################################################*14040099
       G600-Create-Shadow                Section.                       14050099
      *                                                                 14060099
           Initialize                          R115L140-Shadow          14070099
           Set   R115L140-Version        To    True                     14080099
      *                                                                 14090099
           Move  R400CH01-Function       To    R115L140-Function        14100099
           Move  R400CH01-Medium         To    R115L140-Medium          14110099
      *                                                                 14120099
           Move  RTFCE110-I-Fin-Inst-No-D                               14130099
                                         To    R115L140-Fin-Inst-No     14140099
           Move  RTFCE110-I-Contract-Type-D                             14150099
                                         To    R115L140-Contract-Type   14160099
           Move  RTFCE110-I-Contract-No-D                               14170099
                                         To    R115L140-Contract-No     14180099
      *                                                                 14190099
           Set   R115L140-Create-Shadow  To    True                     14200099
      *                                                                 14210099
           Call  'F115L140'              Using R115L140-Shadow          14220099
                                               R7919999-Error-Area      14230099
           End-Call                                                     14240099
      *                                                                 14250099
           Evaluate True                                                14260099
             When R7919999-Return-Abend                                 14270099
               Move  'G601'              To    R7919999-Paragraph       14280099
               Move  'FM'                To    R400CH01-Message-Code    14290099
               Perform Z900-Abend                                       14300099
                                                                        14310099
             When R7919999-Return-Error                                 14320099
               Move  'G602'              To    R7919999-Paragraph       14330099
               Move  'FM'                To    R400CH01-Message-Code    14340099
               Perform Z700-Error-AE                                    14350099
                                                                        14360099
             When R7919999-Return-OK                                    14370099
               Continue                                                 14380099
           End-Evaluate                                                 14390099
      *                                                                 14400099
           .                                                            14410099
      *                                                                 14420099
       G600-Create-Shadow-Ex.                                           14430099
           Exit.                                                        14440099
      *################################################################*14450099
       G700-Update-Tast-Part             Section.                       14460099
      *                                                                 14470099
           Set   R115ITP0-In-Update      To    True                     14480099
      *                                                                 14490099
      * 17.12.01 ndl, endrer til store bokstaver                        14500099
      * 27.01.03 hb, bic-code må være 11 lang uten spaces               14510099
      *                                                                 14520099
           If  RTFCE110-I-BIC-Swift-I (Ws-Idx)  = 'U' And               14530099
               RTFCE110-I-BIC-Swift-D (Ws-Idx)  Not = Spaces And        14540099
               RTFCE110-I-BIC-Swift-D (Ws-Idx)  Not = Low-Values        14550099
              Initialize                 R7919340-Bokstav-Type          14560099
              Set   R7919340-Versjon     To    True                     14570099
              Move RTFCE110-I-Bic-Swift-D (Ws-Idx)                      14580099
                                         To      R7919340-In-Tekst      14590099
              Set   R7919340-In-Store-Bokstaver                         14600099
                                         To    True                     14610099
              Perform I300-Call-F7919340                                14620099
              Move  R7919340-Ut-Tekst    To    R115ITP0-Bic             14630099
                                               WS-Bic                   14640099
              Move +1                    To    WS-Bic-Ind               14650099
              Perform Until WS-Bic-Ind > +11                            14660099
      *                                                                 14670099
                If WS-Bic-Tab (WS-Bic-Ind) = Space                      14680099
                   Move  'VAR1'         To    R400CH01-Message-Key(1)   14690099
                   Move  'BIC-length not 11'                            14700099
                                        To    R400CH01-Message-Data(1)  14710099
                   Move  'TF-SWIFT-UNKNOWN-FMT'                         14720099
                                         To    R400CH01-Message-Code    14730099
                   Perform Z700-Error-AE                                14740099
                End-If                                                  14750099
      *                                                                 14760099
                Add +1                   To    WS-Bic-Ind               14770099
              End-Perform                                               14780099
           End-If                                                       14790099
      *                                                                 14800099
           If  RTFCE110-I-Surname-I (Ws-Idx)  = 'U'                     14810099
               Move RTFCE110-I-Surname-D (Ws-Idx)                       14820099
                                         To    R115ITP0-Name            14830099
           End-If                                                       14840099
      *                                                                 14850099
           If  RTFCE110-I-Address-Line-1-I (Ws-Idx)  = 'U'              14860099
               Move RTFCE110-I-Address-Line-1-D (Ws-Idx)                14870099
                                         To    R115ITP0-Address1        14880099
           End-If                                                       14890099
      *                                                                 14900099
           If  RTFCE110-I-Address-Line-2-I (Ws-Idx)  = 'U'              14910099
               Move RTFCE110-I-Address-Line-2-D (Ws-Idx)                14920099
                                         To    R115ITP0-Address2        14930099
           End-If                                                       14940099
      *                                                                 14950099
           If  RTFCE110-I-Address-Line-3-I (Ws-Idx)  = 'U'              14960099
               Move RTFCE110-I-Address-Line-3-D (Ws-Idx)                14970099
                                         To    R115ITP0-Address3        14980099
           End-If                                                       14990099
      *                                                                 15000099
           If  RTFCE110-I-Address-Line-4-I (Ws-Idx)  = 'U'              15010099
               Move RTFCE110-I-Address-Line-4-D (Ws-Idx)                15020099
                                         To    R115ITP0-Address4        15030099
           End-If                                                       15040099
      *                                                                 15050099
           If  RTFCE110-I-Country-Code-I (Ws-Idx)  = 'U'                15060099
               Move RTFCE110-I-Country-Code-D (Ws-Idx)                  15070099
                                         To    R115ITP0-Country-Code    15080099
           End-If                                                       15090099
      *                                                                 15100099
           If  RTFCE110-I-Geo-Code-I (Ws-Idx)  = 'U'                    15110099
               Move RTFCE110-I-Geo-Code-D (Ws-Idx)                      15120099
                                         To    R115ITP0-Geo-Code        15130099
           End-If                                                       15140099
      *                                                                 15150099
           Call  'F115ITP0'              Using R115ITP0-Tast-Part       15160099
                                               R7919999-Error-Area      15170099
           End-Call                                                     15180099
      *                                                                 15190099
           Evaluate True                                                15200099
             When R7919999-Return-Abend                                 15210099
               Move  'G701'              To    R7919999-Paragraph       15220099
               Move  'FM'                To    R400CH01-Message-Code    15230099
               Perform Z900-Abend                                       15240099
                                                                        15250099
             When R7919999-Return-Error                                 15260099
               Move  'G702'              To    R7919999-Paragraph       15270099
               Move  'FM'                To    R400CH01-Message-Code    15280099
               Perform Z900-Abend                                       15290099
                                                                        15300099
             When Other                                                 15310099
               Continue                                                 15320099
           End-Evaluate                                                 15330099
      *                                                                 15340099
           .                                                            15350099
      *                                                                 15360099
       G700-Update-Tast-Part-Ex.                                        15370099
           Exit.                                                        15380099
      *################################################################*15390099
       G800-Insert-Tast-Part             Section.                       15400099
      *                                                                 15410099
           Initialize                          R115ITP0-Tast-Part       15420099
           Set   R115ITP0-Version        To    True                     15430099
           Set   R115ITP0-In-Work        To    True                     15440099
      *                                                                 15450099
           Set   R115ITP0-In-Insert      To    True                     15460099
      *                                                                 15470099
           Move  RTFCE110-I-Fin-Inst-No-D                               15480099
                                         To    R115ITP0-Fin-Inst-No     15490099
           Move  RTFCE110-I-Contract-Type-D                             15500099
                                         To    R115ITP0-Contract-Type   15510099
           Move  RTFCE110-I-Contract-No-D                               15520099
                                         To    R115ITP0-Contract-No     15530099
      *                                                                 15540099
           If  RTFCE110-I-Part-Amount-No-I Not = 'U'                    15550099
               Set  R115ITP0-In-Rel-MC   To    True                     15560099
           Else                                                         15570099
               Set  R115ITP0-In-Rel-PA   To    True                     15580099
               Move RTFCE110-I-Part-Amount-No-D                         15590099
                                         To    R115ITP0-PA-Seq-No       15600099
               Move Ws-Currency          To    R115ITP0-CA-Currency     15610099
           End-If                                                       15620099
      *                                                                 15630099
           If  RTFCE110-I-Type-I (Ws-Idx) Not = 'U'                     15640099
               Move  'F'                 To                             15650099
                                       RTFCE110-I-Type-O (Ws-Idx)       15660099
               Move  'FELT1'             To    R400CH01-Message-Key(1)  15670099
               Move  'Rolle-Type'        To    R400CH01-Message-Data(1) 15680099
               Move  'GL-MISSING-FIELD&' To    R400CH01-Message-Code    15690099
               Perform  Z700-Error-AE                                   15700099
           Else                                                         15710099
               Move  RTFCE110-I-Type-D (Ws-Idx)                         15720099
                                         To    R115ITP0-Role-Type       15730099
           End-If                                                       15740099
      *                                                                 15750099
           If  RTFCE110-I-BIC-Swift-I (Ws-Idx)  = 'U' And               15760099
               RTFCE110-I-BIC-Swift-D (Ws-Idx)  Not = Spaces And        15770099
               RTFCE110-I-BIC-Swift-D (Ws-Idx)  Not = Low-Values        15780099
      * 17.12.01 ndl, endrer til store bokstaver                        15790099
              Initialize                 R7919340-Bokstav-Type          15800099
              Set   R7919340-Versjon     To    True                     15810099
              Move RTFCE110-I-Bic-Swift-D (Ws-Idx)                      15820099
                                         To      R7919340-In-Tekst      15830099
              Set   R7919340-In-Store-Bokstaver                         15840099
                                         To    True                     15850099
              Perform I300-Call-F7919340                                15860099
              Move  R7919340-Ut-Tekst    To    R115ITP0-Bic             15870099
                                               WS-Bic                   15880099
              Move +1                    To    WS-Bic-Ind               15890099
              Perform Until WS-Bic-Ind > +11                            15900099
      *                                                                 15910099
                If WS-Bic-Tab (WS-Bic-Ind) = Space                      15920099
                   Move  'VAR1'         To    R400CH01-Message-Key(1)   15930099
                   Move  'BIC-length not 11'                            15940099
                                        To    R400CH01-Message-Data(1)  15950099
                   Move  'TF-SWIFT-UNKNOWN-FMT'                         15960099
                                         To    R400CH01-Message-Code    15970099
                   Perform Z700-Error-AE                                15980099
                End-If                                                  15990099
      *                                                                 16000099
                Add +1                   To    WS-Bic-Ind               16010099
              End-Perform                                               16020099
           End-If                                                       16030099
      *                                                                 16040099
           If  RTFCE110-I-Surname-I (Ws-Idx)  = 'U'                     16050099
               Move RTFCE110-I-Surname-D (Ws-Idx)                       16060099
                                         To    R115ITP0-Name            16070099
           End-If                                                       16080099
      *                                                                 16090099
           If  RTFCE110-I-Address-Line-1-I (Ws-Idx)  = 'U'              16100099
               Move RTFCE110-I-Address-Line-1-D (Ws-Idx)                16110099
                                         To    R115ITP0-Address1        16120099
           End-If                                                       16130099
      *                                                                 16140099
           If  RTFCE110-I-Address-Line-2-I (Ws-Idx)  = 'U'              16150099
               Move RTFCE110-I-Address-Line-2-D (Ws-Idx)                16160099
                                         To    R115ITP0-Address2        16170099
           End-If                                                       16180099
      *                                                                 16190099
           If  RTFCE110-I-Address-Line-3-I (Ws-Idx)  = 'U'              16200099
               Move RTFCE110-I-Address-Line-3-D (Ws-Idx)                16210099
                                         To    R115ITP0-Address3        16220099
           End-If                                                       16230099
      *                                                                 16240099
           If  RTFCE110-I-Address-Line-4-I (Ws-Idx)  = 'U'              16250099
               Move RTFCE110-I-Address-Line-4-D (Ws-Idx)                16260099
                                         To    R115ITP0-Address4        16270099
           End-If                                                       16280099
      *                                                                 16290099
           If  RTFCE110-I-Country-Code-I (Ws-Idx)  = 'U'                16300099
               Move RTFCE110-I-Country-Code-D (Ws-Idx)                  16310099
                                         To    R115ITP0-Country-Code    16320099
           End-If                                                       16330099
      *                                                                 16340099
           If  RTFCE110-I-Geo-Code-I (Ws-Idx)  = 'U'                    16350099
               Move RTFCE110-I-Geo-Code-D (Ws-Idx)                      16360099
                                         To    R115ITP0-Geo-Code        16370099
           End-If                                                       16380099
      *                                                                 16390099
                                                                        16400099
           Call  'F115ITP0'              Using R115ITP0-Tast-Part       16410099
                                               R7919999-Error-Area      16420099
           End-Call                                                     16430099
      *                                                                 16440099
           Evaluate True                                                16450099
             When R7919999-Return-Abend                                 16460099
               Move  'G801'              To    R7919999-Paragraph       16470099
               Move  'FM'                To    R400CH01-Message-Code    16480099
               Perform Z900-Abend                                       16490099
                                                                        16500099
             When R7919999-Return-Error                                 16510099
               Move  'G802'              To    R7919999-Paragraph       16520099
               Move  'FM'                To    R400CH01-Message-Code    16530099
               Perform Z900-Abend                                       16540099
                                                                        16550099
             When Other                                                 16560099
               Continue                                                 16570099
           End-Evaluate                                                 16580099
      *                                                                 16590099
           .                                                            16600099
      *                                                                 16610099
       G800-Insert-Tast-Part-Ex.                                        16620099
           Exit.                                                        16630099
      *################################################################*16640099
       G850-Insert-Tast-Part             Section.                       16650099
      *                                                                 16660099
           Set   R115ITP0-In-Insert      To    True                     16670099
      *                                                                 16680099
           If  RTFCE110-I-Part-Amount-No-I Not = 'U'                    16690099
               Set  R115ITP0-In-Rel-MC   To    True                     16700099
           Else                                                         16710099
               Set  R115ITP0-In-Rel-PA   To    True                     16720099
               Move RTFCE110-I-Part-Amount-No-D                         16730099
                                         To    R115ITP0-PA-Seq-No       16740099
               Move Ws-Currency          To    R115ITP0-CA-Currency     16750099
           End-If                                                       16760099
      *                                                                 16770099
           If  RTFCE110-I-BIC-Swift-I (Ws-Idx)  = 'U' And               16780099
               RTFCE110-I-BIC-Swift-D (Ws-Idx)  Not = Spaces And        16790099
               RTFCE110-I-BIC-Swift-D (Ws-Idx)  Not = Low-Values        16800099
               Initialize                      R7919340-Bokstav-Type    16810099
               Set   R7919340-Versjon    To    True                     16820099
               Move RTFCE110-I-Bic-Swift-D (Ws-Idx)                     16830099
                                         To      R7919340-In-Tekst      16840099
               Set   R7919340-In-Store-Bokstaver                        16850099
                                         To    True                     16860099
               Perform I300-Call-F7919340                               16870099
               Move  R7919340-Ut-Tekst   To    R115ITP0-Bic             16880099
                                               WS-Bic                   16890099
               Move +1                   To    WS-Bic-Ind               16900099
               Perform Until WS-Bic-Ind > +11                           16910099
      *                                                                 16920099
                 If WS-Bic-Tab (WS-Bic-Ind) = Space                     16930099
                    Move  'VAR1'         To    R400CH01-Message-Key(1)  16940099
                    Move  'BIC-length not 11'                           16950099
                                         To    R400CH01-Message-Data(1) 16960099
                    Move  'TF-SWIFT-UNKNOWN-FMT'                        16970099
                                          To    R400CH01-Message-Code   16980099
                    Perform Z700-Error-AE                               16990099
                 End-If                                                 17000099
      *                                                                 17010099
                Add +1                   To    WS-Bic-Ind               17020099
              End-Perform                                               17030099
           End-If                                                       17040099
      *                                                                 17050099
           If  RTFCE110-I-Surname-I (Ws-Idx)  = 'U'                     17060099
               Move RTFCE110-I-Surname-D (Ws-Idx)                       17070099
                                         To    R115ITP0-Name            17080099
           End-If                                                       17090099
      *                                                                 17100099
           If  RTFCE110-I-Address-Line-1-I (Ws-Idx)  = 'U'              17110099
               Move RTFCE110-I-Address-Line-1-D (Ws-Idx)                17120099
                                         To    R115ITP0-Address1        17130099
           End-If                                                       17140099
      *                                                                 17150099
           If  RTFCE110-I-Address-Line-2-I (Ws-Idx)  = 'U'              17160099
               Move RTFCE110-I-Address-Line-2-D (Ws-Idx)                17170099
                                         To    R115ITP0-Address2        17180099
           End-If                                                       17190099
      *                                                                 17200099
           If  RTFCE110-I-Address-Line-3-I (Ws-Idx)  = 'U'              17210099
               Move RTFCE110-I-Address-Line-3-D (Ws-Idx)                17220099
                                         To    R115ITP0-Address3        17230099
           End-If                                                       17240099
      *                                                                 17250099
           If  RTFCE110-I-Address-Line-4-I (Ws-Idx)  = 'U'              17260099
               Move RTFCE110-I-Address-Line-4-D (Ws-Idx)                17270099
                                         To    R115ITP0-Address4        17280099
           End-If                                                       17290099
      *                                                                 17300099
           If  RTFCE110-I-Country-Code-I (Ws-Idx)  = 'U'                17310099
               Move RTFCE110-I-Country-Code-D (Ws-Idx)                  17320099
                                         To    R115ITP0-Country-Code    17330099
           End-If                                                       17340099
      *                                                                 17350099
           If  RTFCE110-I-Geo-Code-I (Ws-Idx)  = 'U'                    17360099
               Move RTFCE110-I-Geo-Code-D (Ws-Idx)                      17370099
                                         To    R115ITP0-Geo-Code        17380099
           End-If                                                       17390099
      *                                                                 17400099
           Call  'F115ITP0'              Using R115ITP0-Tast-Part       17410099
                                               R7919999-Error-Area      17420099
           End-Call                                                     17430099
      *                                                                 17440099
           Evaluate True                                                17450099
             When R7919999-Return-Abend                                 17460099
               Move  'G851'              To    R7919999-Paragraph       17470099
               Move  'FM'                To    R400CH01-Message-Code    17480099
               Perform Z900-Abend                                       17490099
                                                                        17500099
             When R7919999-Return-Error                                 17510099
               Move  'G852'              To    R7919999-Paragraph       17520099
               Move  'FM'                To    R400CH01-Message-Code    17530099
               Perform Z900-Abend                                       17540099
                                                                        17550099
             When Other                                                 17560099
               Continue                                                 17570099
           End-Evaluate                                                 17580099
      *                                                                 17590099
           .                                                            17600099
      *                                                                 17610099
       G850-Insert-Tast-Part-Ex.                                        17620099
           Exit.                                                        17630099
      *################################################################*17640099
       G900-Delete-Tast-Part             Section.                       17650099
      *                                                                 17660099
           Set   R115ITP0-In-Delete      To    True                     17670099
      *                                                                 17680099
           Call  'F115ITP0'              Using R115ITP0-Tast-Part       17690099
                                               R7919999-Error-Area      17700099
           End-Call                                                     17710099
      *                                                                 17720099
           Evaluate True                                                17730099
             When R7919999-Return-Abend                                 17740099
               Move  'G901'              To    R7919999-Paragraph       17750099
               Move  'FM'                To    R400CH01-Message-Code    17760099
               Perform Z900-Abend                                       17770099
                                                                        17780099
             When R7919999-Return-Error                                 17790099
               Move  'G902'              To    R7919999-Paragraph       17800099
               Move  'FM'                To    R400CH01-Message-Code    17810099
               Perform Z900-Abend                                       17820099
                                                                        17830099
             When Other                                                 17840099
               Continue                                                 17850099
           End-Evaluate                                                 17860099
      *                                                                 17870099
           .                                                            17880099
      *                                                                 17890099
       G900-Delete-Tast-Part-Ex.                                        17900099
           Exit.                                                        17910099
      *################################################################*17920099
       H100-Read-Related-Party           Section.                       17930099
      *                                                                 17940099
           Initialize                          R115IRP0-Related-Party   17950099
           Set   R115IRP0-In-Work        To    True                     17960099
      *                                                                 17970099
           Set   R115IRP0-Version        To    True                     17980099
           Set   R115IRP0-In-Select      To    True                     17990099
      *                                                                 18000099
           Move  RTFCE110-I-Fin-Inst-No-D                               18010099
                                         To    R115IRP0-In-Fin-Inst-No  18020099
           Move  RTFCE110-I-Contract-Type-D                             18030099
                                         To    R115IRP0-In-Contract-Type18040099
           Move  RTFCE110-I-Contract-No-D                               18050099
                                         To    R115IRP0-In-Contract-No  18060099
           Move  Ws-Role-Type            To    R115IRP0-In-Role-Type    18070099
      *                                                                 18080099
           If  Wb-Main                                                  18090099
               Set  R115IRP0-In-Rel-MC   To    True                     18100099
           Else                                                         18110099
               Set  R115IRP0-In-Rel-PA   To    True                     18120099
               Move RTFCE110-I-Part-Amount-No-D                         18130099
                                         To    R115IRP0-In-PA-Seq-No    18140099
               Move Ws-Currency          To    R115IRP0-In-CA-Currency  18150099
           End-If                                                       18160099
      *                                                                 18170099
           Call  'F115IRP0'              Using R115IRP0-Related-Party   18180099
                                               R7919999-Error-Area      18190099
           End-Call                                                     18200099
      *                                                                 18210099
           If  R7919999-Return-Abend                                    18220099
               Move  'H101'              To    R7919999-Paragraph       18230099
               Move  'FM'                To    R400CH01-Message-Code    18240099
               Perform Z900-Abend                                       18250099
           End-If                                                       18260099
      *                                                                 18270099
           .                                                            18280099
      *                                                                 18290099
       H100-Read-Related-Party-Ex.                                      18300099
           Exit.                                                        18310099
      *################################################################*18320099
       H200-Read-Main-Contract           Section.                       18330099
      *                                                                 18340099
           Initialize                          R115IMC0-Main-Contract   18350099
           Set   R115IMC0-Version        To    True                     18360099
           Set   R115IMC0-In-Select      To    True                     18370099
           If  Wb-In-Actual                                             18380099
               Set   R115IMC0-In-Actual  To    True                     18390099
           Else                                                         18400099
               Set   R115IMC0-In-Work    To    True                     18410099
           End-If                                                       18420099
      *                                                                 18430099
           Move  RTFCE110-I-Fin-Inst-No-D                               18440099
                                         To    R115IMC0-In-Fin-Inst-No  18450099
           Move  RTFCE110-I-Contract-Type-D                             18460099
                                         To    R115IMC0-In-Contract-Type18470099
           Move  RTFCE110-I-Contract-No-D                               18480099
                                         To    R115IMC0-In-Contract-No  18490099
      *                                                                 18500099
           Call  'F115IMC0'              Using R115IMC0-Main-Contract   18510099
                                               R7919999-Error-Area      18520099
           End-Call                                                     18530099
      *                                                                 18540099
           Evaluate True                                                18550099
             When R7919999-Return-Abend                                 18560099
               Move  'H201'              To    R7919999-Paragraph       18570099
               Move  'FM'                To    R400CH01-Message-Code    18580099
               Perform Z900-Abend                                       18590099
                                                                        18600099
             When R7919999-Return-Error                                 18610099
               Move  'H202'              To    R7919999-Paragraph       18620099
               Move  'FM'                To    R400CH01-Message-Code    18630099
               Perform Z700-Error-AE                                    18640099
           End-Evaluate                                                 18650099
      *                                                                 18660099
           .                                                            18670099
      *                                                                 18680099
       H200-Read-Main-Contract-Ex.                                      18690099
           Exit.                                                        18700099
      *################################################################*18710099
       H300-Read-Contract-Amount         Section.                       18720099
      *                                                                 18730099
           Initialize                          R115ICA0-Contract-Amount 18740099
           Set   R115ICA0-Version        To    True                     18750099
           Set   R115ICA0-In-Get-1st     To    True                     18760099
           Set   R115ICA0-In-Work        To    True                     18770099
      *                                                                 18780099
           Move  RTFCE110-I-Fin-Inst-No-D                               18790099
                                         To    R115ICA0-In-Fin-Inst-No  18800099
           Move  RTFCE110-I-Contract-Type-D                             18810099
                                         To    R115ICA0-In-Contract-Type18820099
           Move  RTFCE110-I-Contract-No-D                               18830099
                                         To    R115ICA0-In-Contract-No  18840099
      *                                                                 18850099
           Call  'F115ICA0'              Using R115ICA0-Contract-Amount 18860099
                                               R7919999-Error-Area      18870099
           End-Call                                                     18880099
      *                                                                 18890099
           Evaluate True                                                18900099
             When R7919999-Return-Abend                                 18910099
               Move  'H301'              To    R7919999-Paragraph       18920099
               Move  'FM'                To    R400CH01-Message-Code    18930099
               Perform Z900-Abend                                       18940099
                                                                        18950099
             When R7919999-Return-Error                                 18960099
               Move  'H302'              To    R7919999-Paragraph       18970099
               Move  'FM'                To    R400CH01-Message-Code    18980099
               Perform Z900-Abend                                       18990099
                                                                        19000099
             When Other                                                 19010099
               Continue                                                 19020099
           End-Evaluate                                                 19030099
      *                                                                 19040099
           Move  R115ICA0-Currency       To    Ws-Currency              19050099
      *                                                                 19060099
           .                                                            19070099
      *                                                                 19080099
       H300-Read-Contract-Amount-Ex.                                    19090099
           Exit.                                                        19100099
      *################################################################*19110099
       H400-Read-SYS-Code                Section.                       19120099
      *                                                                 19130099
           Initialize                          R115ISC0-Sys-Code        19140099
           Set   R115ISC0-Version        To    True                     19150099
           Set   R115ISC0-In-Select      To    True                     19160099
      *                                                                 19170099
           Move  RTFCE110-I-Fin-Inst-No-D                               19180099
                                         To    R115ISC0-In-Fin-Inst-No  19190099
           Move  'RELATED-PARTY'         To    R115ISC0-In-ST-Type      19200099
           Move  RTFCE110-I-Type-D (Ws-Idx)                             19210099
                                         To    R115ISC0-In-SC-Code      19220099
      *                                                                 19230099
           Call  'F115ISC0'              Using R115ISC0-Sys-Code        19240099
                                               R7919999-Error-Area      19250099
           End-Call                                                     19260099
      *                                                                 19270099
           Evaluate True                                                19280099
             When R7919999-Return-Abend                                 19290099
               Move  'H401'              To    R7919999-Paragraph       19300099
               Perform Z900-Abend                                       19310099
                                                                        19320099
             When R7919999-Return-Error                                 19330099
               Move  'H402'              To    R7919999-Paragraph       19340099
               Perform Z900-Abend                                       19350099
                                                                        19360099
             When R7919999-Return-OK                                    19370099
               Continue                                                 19380099
                                                                        19390099
           End-Evaluate                                                 19400099
      *                                                                 19410099
           .                                                            19420099
      *                                                                 19430099
       H400-Read-SYS-Code-Ex.                                           19440099
           Exit.                                                        19450099
      *################################################################*19460099
       H500-Read-Tast-Part               Section.                       19470099
      *                                                                 19480099
           Initialize                          R115ITP0-Tast-Part       19490099
           Set   R115ITP0-In-Work        To    True                     19500099
      *                                                                 19510099
           Set   R115ITP0-Version        To    True                     19520099
           Set   R115ITP0-In-Select      To    True                     19530099
      *                                                                 19540099
           Move  RTFCE110-I-Fin-Inst-No-D                               19550099
                                         To    R115ITP0-In-Fin-Inst-No  19560099
           Move  RTFCE110-I-Contract-Type-D                             19570099
                                         To    R115ITP0-In-Contract-Type19580099
           Move  RTFCE110-I-Contract-No-D                               19590099
                                         To    R115ITP0-In-Contract-No  19600099
           Move  Ws-Role-Type            To    R115ITP0-In-Role-Type    19610099
      *                                                                 19620099
           If  Wb-Main                                                  19630099
               Set  R115ITP0-In-Rel-MC   To    True                     19640099
           Else                                                         19650099
               Set  R115ITP0-In-Rel-PA   To    True                     19660099
               Move RTFCE110-I-Part-Amount-No-D                         19670099
                                         To    R115ITP0-In-PA-Seq-No    19680099
               Move Ws-Currency          To    R115ITP0-In-CA-Currency  19690099
           End-If                                                       19700099
      *                                                                 19710099
           Call  'F115ITP0'              Using R115ITP0-Tast-Part       19720099
                                               R7919999-Error-Area      19730099
           End-Call                                                     19740099
      *                                                                 19750099
           If  R7919999-Return-Abend                                    19760099
               Move  'H501'              To    R7919999-Paragraph       19770099
               Move  'FM'                To    R400CH01-Message-Code    19780099
               Perform Z900-Abend                                       19790099
           End-If                                                       19800099
      *                                                                 19810099
           .                                                            19820099
      *                                                                 19830099
       H500-Read-Tast-Part-Ex.                                          19840099
           Exit.                                                        19850099
      *################################################################*19860099
       H600-Read-All-Related-Party       Section.                       19870099
      *                                                                 19880099
           Initialize                          R115IRP0-Related-Party   19890099
           Set   R115IRP0-Version        To    True                     19900099
           Set   R115IRP0-In-Get-1st     To    True                     19910099
           Set   R115IRP0-In-Actual      To    True                     19920099
      *                                                                 19930099
           Move  RTFCE110-I-Fin-Inst-No-D                               19940099
                                         To    R115IRP0-In-Fin-Inst-No  19950099
           Move  Ws-Role-Type            To    R115IRP0-In-Role-Type    19960099
      *                                                                 19970099
           Call  'F115IRP0'              Using R115IRP0-Related-Party   19980099
                                               R7919999-Error-Area      19990099
           End-Call                                                     20000099
      *                                                                 20010099
           Perform Until R7919999-Return-Error                          20020099
                                                                        20030099
               If  R7919999-Return-Abend                                20040099
                   Move  'H601'          To    R7919999-Paragraph       20050099
                   Move  'FM'            To    R400CH01-Message-Code    20060099
                   Perform Z900-Abend                                   20070099
               End-If                                                   20080099
                                                                        20090099
      *        If  R115IRP0-Customer-ID =                               20100099
      *                               RTFCE110-I-Customer-Id-D(Ws-Idx)  20110099
      *        And R115IRP0-Reference =  RTFCE110-I-Reference-D(Ws-Idx) 20120099
               If  R115IRP0-Reference =  RTFCE110-I-Reference-D(Ws-Idx) 20130099
               And R115IRP0-Contract-No  Not =                          20140099
                                         RTFCE110-I-Contract-No-D       20150099
                                                                        20160099
                   Move R115IRP0-Contract-No                            20170099
                                         To    Ws-Contract-No           20180099
                   String                                               20190099
                  'Annen banks referanse eksisterer for kontrakt '      20200099
                                                     Delimited by Size  20210099
                          R115IRP0-Contract-Type     Delimited by Size  20220099
                          Ws-Contract-No             Delimited by Size  20230099
                                         Into  R7919999-Message         20240099
                   End-String                                           20250099
                   Move  'H602'          To    R7919999-Paragraph       20260099
                   Move  'FM'            To    R400CH01-Message-Code    20270099
      *            Perform  Z700-Error-AE                               20280099
                   Perform  Z600-Error-AW                               20290099
                   Set Wb-Warning        To    True                     20300099
               End-If                                                   20310099
                                                                        20320099
               Set  R115IRP0-In-Get-Next To    True                     20330099
               Call  'F115IRP0'          Using R115IRP0-Related-Party   20340099
                                               R7919999-Error-Area      20350099
               End-Call                                                 20360099
                                                                        20370099
           End-Perform                                                  20380099
           Set R7919999-Return-OK        To    True                     20390099
      *                                                                 20400099
           .                                                            20410099
      *                                                                 20420099
       H600-Read-All-Related-Party-Ex.                                  20430099
           Exit.                                                        20440099
      *################################################################*20450099
       I100-Create-Customer              Section.                       20460099
      *                                                                 20470099
      *    Create Customer : Stg-function KFCAD Dann Kunde              20480099
           Move  'F'                 To RTFCE110-I-Custm-Type-O (Ws-Idx)20490099
           Move  'TF-SY-NOT-IMPLEMENTED'                                20500099
                                         To R400CH01-Message-Code       20510099
           Perform  Z700-Error-AE                                       20520099
      *                                                                 20530099
           .                                                            20540099
      *                                                                 20550099
       I100-Create-Customer-Ex.                                         20560099
           Exit.                                                        20570099
      *################################################################*20580099
       I200-Read-KF-Customer             Section.                       20590099
      *                                                                 20600099
      *  Name and address of customer...                                20610099
           Perform I210-Read-KF-Cust                                    20620099
      *                                                                 20630099
ndlfix     Perform I220-Read-Sector-Code                                20631099
      *                                                                 20632099
      *  SWIFT of customer...                                           20640099
           If    R728IXL0-KU-Sektor-Eierkode = 0                        20641099
           And   BPOXINS0-Cat-Fin-Bus-Banks                             20642099
      *                                                                 20643099
ndlfix*    If    R728IXL0-KU-Sektor-Kode =  210                         20650099
      *    Or    R728IXL0-KU-Sektor-Kode =  215                         20660099
      *    Or    R728IXL0-KU-Sektor-Kode =  216                         20670099
      *    Or    R728IXL0-KU-Sektor-Kode =  217                         20680099
      *    Or    R728IXL0-KU-Sektor-Kode =  250                         20690099
      *    Or    R728IXL0-KU-Sektor-Kode =  255                         20700099
      *    Or    R728IXL0-KU-Sektor-Kode =  256                         20710099
      *    Or    R728IXL0-KU-Sektor-Kode =  257                         20720099
      *    Or    R728IXL0-KU-Sektor-Kode =  910                         20730099
      *    Or    R728IXL0-KU-Sektor-Kode =  920                         20740099
              Initialize                 R115L240-Find-SWIFT-Adr        20750099
              Set   R115L240-Version     To    True                     20760099
              Move  R115IRP0-Customer-Id To    R115L240-In-Cust-Id      20770099
              Move  R115IRP0-Fin-Inst-ID To    R115L240-In-Fin-Inst-ID  20780099
      *                                                                 20790099
              Call  'F115L240'           Using R115L240-Find-SWIFT-Adr  20800099
                                               R7919999-Error-Area      20810099
              End-Call                                                  20820099
      *                                                                 20830099
              Evaluate True                                             20840099
                When R7919999-Return-Abend                              20850099
                  Move  'I201'           To    R7919999-Paragraph       20860099
                  Perform Z900-Abend                                    20870099
                                                                        20880099
                When R7919999-Return-Error                              20890099
                  Move  'I202'           To    R7919999-Paragraph       20900099
                  Perform Z700-Error-AE                                 20910099
                                                                        20920099
                When R7919999-Return-OK                                 20930099
                  Move  R115L240-Swift-Address (1:11)                   20940099
                                         To    Ws-Bic-Code              20950099
              End-Evaluate                                              20960099
           Else                                                         20970099
              Move Spaces                To    Ws-Bic-Code              20980099
           End-If                                                       20990099
                                                                        21000099
      *                                                                 21010099
           .                                                            21020099
      *                                                                 21030099
       I200-Read-KF-Cust-Info-Ex.                                       21040099
           Exit.                                                        21050099
      *################################################################*21060099
       I210-Read-KF-Cust                 Section.                       21070099
      *                                                                 21080099
           Initialize                          R728IXL0-Kunde           21090099
           Set   R728IXL0-Versjon        To    True                     21100099
           Set   R728IXL0-In-Select      To    True                     21110099
      *                                                                 21120099
           Set   R728IXL0-In-Hent-Navn-Ja                               21130099
                                         To    True                     21140099
           Set   R728IXL0-In-Hent-Adresse-Ja                            21141099
                                         To    True                     21142099
      *    Set   R728IXL0-In-Hent-Notat-Ja                              21143099
      *                                  To    True                     21144099
      *    Set   R728IXL0-In-Hent-Bosted-Ja                             21150099
      *                                  To    True                     21160099
      *                                                                 21170099
      **** Move  R115IRP0-Fin-Inst-No    To    Ws-Fin-Inst-No           21180099
      **** Move  Ws-Fin-Inst             To    R728IXL0-In-Konsern-Nr   21190099
           Move  R115IRP0-Fin-Inst-ID    To    R728IXL0-In-Konsern-ID   21200099
      *                                                                 21210099
           Move  R115IRP0-Customer-ID    To    R728IXL0-In-Kunde-ID     21220099
      *                                                                 21230099
           Call  'F728IXL0'              Using R728IXL0-Kunde           21240099
                                               R7919999-Error           21250099
           End-Call                                                     21260099
      *                                                                 21270099
           Evaluate True                                                21280099
             When R7919999-Return-Abend                                 21290099
               Move  'I211'              To    R7919999-Paragraph       21300099
               Perform Z900-Abend                                       21310099
                                                                        21320099
             When R7919999-Return-Error                                 21330099
               Move  'I212'              To    R7919999-Paragraph       21340099
               Perform Z700-Error-AE                                    21350099
                                                                        21360099
             When R7919999-Return-OK                                    21370099
               Continue                                                 21380099
           End-Evaluate                                                 21390099
      *                                                                 21400099
           .                                                            21410099
      *                                                                 21420099
       I210-Read-KF-Cust-Ex.                                            21430099
           Exit.                                                        21440099
      *################################################################*21441099
       I220-Read-Sector-Code             Section.                       21442099
      *                                                                 21443099
           Initialize                       BPOXINS0-PO-NC-NOR-SECTOR   21444099
                                                                        21445099
           Set  BPOXINS0-Eyecatcher      To True                        21446099
           Set  BPOXINS0-Version         To True                        21447099
           Set  BPOXINS0-In-Select       To True                        21448099
      *                                                                 21449099
           Move R728IXL0-KU-Sektor-Kode  To BPOXINS0-In-PONS-SECTOR-CODE21450099
           Move R400CH01-Exec-Date       To BPOXINS0-In-PONS-VAL-FROM-DT21451099
      *                                                                 21451599
           Call 'BPOXINS0'               Using BPOXINS0-PO-NC-NOR-SECTOR21451699
      *                                        R7919999-Error           21451799
             On Exception                                               21451899
             Move 'GL-LOAD-NF&'          To R791ERR0-In-Message-Id      21451999
             Move 'PROG1'                To R791ERR0-In-Var-Key  (1)    21452099
             Move WC-Program-Id          To R791ERR0-In-Var-Data (1)    21452199
             Move 'PROG2'                To R791ERR0-In-Var-Key  (2)    21452299
             Move 'BPOXINS0'             To R791ERR0-In-Var-Data (2)    21452399
             Move 'I220'                 To R791ERR0-In-Paragraph-Id    21452499
             Set  R7919999-Retur-Abend   To True                        21452599
             Perform Z600-Error-Handling                                21452699
      *                                                                 21452799
           End-Call                                                     21452899
      *                                                                 21452999
           Evaluate True                                                21453099
             When R791ERRX-State-OK                                     21453199
               Continue                                                 21453299
      *                                                                 21453399
             When R791ERRX-State-Error                                  21453499
               Move  'VAR1'              To    R400CH01-Message-Key(1)  21453699
               Move  'Sektor-kode'       To    R400CH01-Message-Data(1) 21453799
               Move  'DB-FOREKOMST-NF'   To    R400CH01-Message-Code    21453899
               Set   R7919999-Retur-Feil To    True                     21453999
               Perform Z700-Error-AE                                    21454099
      *                                                                 21454199
             When R791ERRX-State-Abend                                  21454299
               Set  R7919999-Retur-Abend To    True                     21454399
               Move  'I222'              To    R791ERR0-In-Paragraph-Id 21454499
               Perform Z300-Call-Trace-R7919999-2-Old                   21454599
               Move  'FM'                To    R400CH01-Message-Code    21454699
               Perform Z900-Abend                                       21454799
      *                                                                 21454899
           End-Evaluate                                                 21454999
      *                                                                 21455099
           .                                                            21455199
      *                                                                 21455299
       I220-Read-Sector-Ex.                                             21455399
           Exit.                                                        21455499
      *################################################################*21456099
       I300-Call-F7919340                Section.                       21460099
      *                                                                 21470099
           Call  'F7919340'              Using R7919340-Bokstav-Type    21480099
                                               R7919999-Error           21490099
           End-Call                                                     21500099
      *                                                                 21510099
           Evaluate True                                                21520099
             When  R7919999-Return-Error                                21530099
               Move 'FM'                 To    R400CH01-Message-Code    21540099
               Move 'I301'               To    R7919999-Paragraph       21550099
               Perform Z700-Error-AE                                    21560099
             When  R7919999-Return-Abend                                21570099
               Move 'FM'                 To    R400CH01-Message-Code    21580099
               Move 'I302'               To    R7919999-Paragraph       21590099
               Perform Z900-Abend                                       21600099
           End-Evaluate                                                 21610099
           .                                                            21620099
      *                                                                 21630099
        I300-Call-F7919340-Ex.                                          21640099
           Exit.                                                        21650099
112018*################################################################*21660099
112018*I400-Insert-Field79-MT707         Section.                       21670099
112018*                                                                 21680099
112018*                                                                 21690099
112018*    Initialize                          R115L330-Field79         21700099
112018*    Set   R115L330-Version        To    True                     21710099
112018*                                                                 21720099
112018*    Move  RTFCE110-I-Fin-Inst-No-D                               21730099
112018*                                  To    R115L330-In-Fin-Inst-No  21740099
112018*    Move  RTFCE110-I-Contract-Type-D                             21750099
112018*                                  To    R115L330-In-Contract-Type21760099
112018*    Move  RTFCE110-I-Contract-No-D                               21770099
112018*                                  To    R115L330-In-Contract-No  21780099
112018*    Move  RTFCE110-I-Operation-Type-D                            21790099
112018*                                  To   R115L330-In-Operation-Type21800099
112018*                                                                 21810099
112018*                                                                 21820099
112018*    Call  'F115L330'              Using R115L330-Field79         21830099
112018*                                        R7919999-Error           21840099
112018*    End-Call                                                     21850099
112018*                                                                 21860099
112018*    Evaluate True                                                21870099
112018*      When  R7919999-Return-Error                                21880099
112018*        Move 'FM'                 To    R400CH01-Message-Code    21890099
112018*        Move 'I401'               To    R7919999-Paragraph       21900099
112018*        Perform Z700-Error-AE                                    21910099
112018*      When  R7919999-Return-Abend                                21920099
112018*        Move 'FM'                 To    R400CH01-Message-Code    21930099
112018*        Move 'I402'               To    R7919999-Paragraph       21940099
112018*        Perform Z900-Abend                                       21950099
112018*    End-Evaluate                                                 21960099
112018*    .                                                            21970099
112018*                                                                 21980099
112018* I400-Ex.                                                        21990099
112018*    Exit.                                                        22000099
      *################################################################*22010099
       U000-Out-Fields                   Section.                       22020099
      *                                                                 22030099
      *    Item 900. Sist-Lagret-Dato                                   22040099
           Move  'U'                     To RTFCE110-B-Last-Saved-Date-O22050099
           Move  R115IMC0-Upd-Timestamp  To RTFCE110-B-Last-Saved-Date-D22060099
           If Wb-Warning                                                22070099
              Set   R7919999-Return-Warning                             22080099
                                         To    True                     22090099
           End-If                                                       22100099
      *                                                                 22110099
           .                                                            22120099
      *                                                                 22130099
       U000-Out-Fields-Ex.                                              22140099
           Exit.                                                        22150099
      *################################################################*22160099
      * Set Warning status                                             *22170099
      *                                                                *22180099
      *----------------------------------------------------------------*22190099
      *<META Z600-ERROR-AW>                                             22200099
       Z600-Error-AW                     Section.                       22210099
      *                                                                 22220099
      *    Move  'FTFCL110'              To    R400CH01-Message-Text    22230099
           Set   R7919999-Return-Warning To    True                     22240099
           If    R400CH01-Message-Code   =     'FM'                     22250099
                 String   'FTFCL110'           Delimited By Size        22260099
                          ': '                 Delimited By Size        22270099
                       R7919999-Message        Delimited By Size        22280099
                                         Into  R400CH01-Message-Text    22290099
                 End-String                                             22300099
           Else                                                         22310099
                 Move  'FTFCL110'        To    R400CH01-Message-Text    22320099
           End-If                                                       22330099
                                                                        22340099
           .                                                            22350099
      *                                                                 22360099
       Z600-Error-AW-Ex.                                                22370099
           Exit.                                                        22380099
      *</META>                                                          22390099
                                                                        22400099
      *################################################################*22410099
      * Syntax Error status                                            *22420099
      *                                                                *22430099
      *----------------------------------------------------------------*22440099
      *<META Z700-ERROR-AE>                                             22450099
       Z700-Error-AE                     Section.                       22460099
      *                                                                 22470099
           Set   R7919999-Return-Error   To    True                     22480099
           If    R400CH01-Message-Code   =     'FM'                     22490099
                 String   'FTFCL110'           Delimited By Size        22500099
                          ': '                 Delimited By Size        22510099
                       R7919999-Message        Delimited By Size        22520099
                                         Into  R400CH01-Message-Text    22530099
                 End-String                                             22540099
           Else                                                         22550099
                 Move  'FTFCL110'        To    R400CH01-Message-Text    22560099
           End-If                                                       22570099
           .                                                            22580099
      *                                                                 22590099
       Z700-Error-AE-Ex.                                                22600099
           Goback.                                                      22610099
      *</META>                                                          22620099
                                                                        22630099
      *################################################################*22640099
      * Severe error. Will genereate USER-ABEND in STG when the        *22650099
      * function is executed in batch.                                 *22660099
      *----------------------------------------------------------------*22670099
      *<META Z800-ERROR-AS>                                             22680099
       Z800-Error-AS                     Section.                       22690099
      *                                                                 22700099
           Set   R7919999-Return-Abend   To    True                     22710099
           If    R400CH01-Message-Code   =     'FM'                     22720099
                 String   'FTFCL110'           Delimited By Size        22730099
                          ': '                 Delimited By Size        22740099
                       R7919999-Message        Delimited By Size        22750099
                                         Into  R400CH01-Message-Text    22760099
                 End-String                                             22770099
           Else                                                         22780099
                 Move  'FTFCL110'        To    R400CH01-Message-Text    22790099
           End-If                                                       22800099
           .                                                            22810099
      *                                                                 22820099
       Z800-Error-AS-Ex.                                                22830099
           Goback.                                                      22840099
      *</META>                                                          22850099
                                                                        22860099
      *################################################################*22870099
      * Severe error. Will genereate USER-ABEND in STG when the        *22880099
      * function is executed in batch.                                 *22890099
      *----------------------------------------------------------------*22900099
      *<META Z900-ABEND>                                                22910099
       Z900-Abend                        Section.                       22920099
      *                                                                 22930099
           Set   R7919999-Return-Abend   To    True                     22940099
           If    R400CH01-Message-Code   =     'FM'                     22950099
                 String   'FTFCL110'           Delimited By Size        22960099
                          ': '                 Delimited By Size        22970099
                       R7919999-Message        Delimited By Size        22980099
                                         Into  R400CH01-Message-Text    22990099
                 End-String                                             23000099
           Else                                                         23010099
                 Move  'FTFCL110'        To    R400CH01-Message-Text    23020099
           End-If                                                       23030099
      *                                                                 23040099
      *----------------------------------------------------------------*23050099
      *                                                                 23060099
           If  R7919999-Return-Code      Not   Numeric                  23070099
           or  Not R7919999-Return-Abend                                23080099
               Move  +0                  To    R7919999-Module-Ind      23090099
           End-If                                                       23100099
           Add   +1                      To    R7919999-Module-Ind      23110099
           If  R7919999-Module-Ind       Not >                          23120099
                             ( Length    Of    R7919999-Module-Tab      23130099
                             / Length    Of    R7919999-Module-Element )23140099
               Move  'FTFCL110'          To    R7919999-Module-Name     23150099
                                               (R7919999-Module-Ind)    23160099
               Move  R7919999-Paragraph  To    R7919999-Module-Para     23170099
                                               (R7919999-Module-Ind)    23180099
           End-If                                                       23190099
           Set   R7919999-Return-Abend   To    True                     23200099
           .                                                            23210099
      *                                                                 23220099
       Z900-Abend-Ex.                                                   23230099
           Goback.                                                      23240099
      *</META>                                                          23250099
      *                                                                 23260099
      * Error-Handling                                                  23260199
       Copy S791ERR0.                                                   23260299
       Copy S791ERX0.                                                   23260399
       Copy S791ERRS.                                                   23260499
      *                                                                 23261099
       End Program FTFCL110.                                            23270099
